rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// Free Fonts are included via TFT_eSPI when LOAD_GFXFF is enabled
// Available: FreeMonoBold9pt7b, FreeMonoBold12pt7b, FreeMonoBold18pt7b

// Activity EQ bars — 16 skinny bars that bounce with broadcast activity
#define SP_EQ_BARS 16
#define SP_EQ_HEIGHT 22
#define SP_EQ_Y (SCREEN_HEIGHT - 73)       // Just above skulls
#define SP_EQ_X 12
#define SP_EQ_WIDTH (SCREEN_WIDTH - 24)
static uint8_t eqHeat[SP_EQ_BARS] = {0};

// Pulsing status blink state
static bool statusBlink = false;

// Helper: draw centered FreeFont text
static void spDrawFreeFont(int y, const char* text, uint16_t color, const GFXfont* font) {
    tft.setFreeFont(font);
    tft.setTextColor(color, TFT_BLACK);
    int w = tft.textWidth(text);
    int x = (SCREEN_WIDTH - w) / 2;
    if (x < 0) x = 0;
    tft.setCursor(x, y);
    tft.print(text);
    tft.setFreeFont(NULL);
}

// Helper: gradient color from cyan to hot pink (ratio 0.0 → 1.0)
static uint16_t spGradientColor(float ratio) {
    if (ratio > 1.0f) ratio = 1.0f;
    if (ratio < 0.0f) ratio = 0.0f;
    uint8_t r = (uint8_t)(ratio * 255);
    uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
    uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
    return tft.color565(r, g, b);
}

static void drawIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, HALEHOUND_GUNMETAL);
    for (int i = 0; i < SP_ICON_NUM; i++) {
        uint16_t color = HALEHOUND_MAGENTA;
        if (i == 1 && spamming) color = HALEHOUND_HOTPINK;  // Toggle icon hot when active
        tft.drawBitmap(spIconX[i], ICON_BAR_Y, spIcons[i], SP_ICON_SIZE, SP_ICON_SIZE, color);
    }
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

static void drawHeader() {
    tft.fillRect(0, 40, SCREEN_WIDTH, 52, TFT_BLACK);

    // Skull watermark behind header (subtle dark cyan)
    tft.drawBitmap(180, 40, bitmap_icon_skull_bluetooth, 16, 16, tft.color565(0, 30, 40));

    // Title — Nosifer with glitch effect
    drawGlitchText(SCALE_Y(60), "BLE SPOOFER", &Nosifer_Regular10pt7b);

    // Status — pulsing when active
    tft.setTextSize(1);
    if (spamming) {
        statusBlink = !statusBlink;
        uint16_t statusColor = statusBlink ? HALEHOUND_HOTPINK : tft.color565(200, 50, 100);
        tft.setTextColor(statusColor, TFT_BLACK);
        tft.setCursor(88, 68);
        tft.print(">> ACTIVE <<");
    } else {
        tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
        tft.setCursor(95, 68);
        tft.print("- IDLE -");
    }

    // Mode — in rounded double-border frame
    tft.drawRoundRect(5, 74, GRAPH_PADDED_W, 16, 3, HALEHOUND_VIOLET);
    tft.drawRoundRect(6, 75, GRAPH_PADDED_W - 2, 14, 2, HALEHOUND_GUNMETAL);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(10, 78);
    tft.printf(" %s", MODE_NAMES[currentMode]);

    // Device name + platform target on right side of frame
    if (currentMode == MODE_CHAOS) {
        tft.setCursor(150, 78);
        tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
        tft.print("[ALL]");
    } else {
        int devCount = getDeviceCount(currentMode);
        if (devCount > 0) {
            // Truncate device name to fit
            char devBuf[22];
            snprintf(devBuf, sizeof(devBuf), "%s", getDeviceName(currentMode, deviceIndex[currentMode]));
            tft.setCursor(130, 78);
            tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
            tft.print(devBuf);
        }
    }

    tft.drawLine(0, 92, SCREEN_WIDTH, 92, HALEHOUND_HOTPINK);
}

static void addLogEntry(const char* text, uint16_t color) {
    // Scroll up if buffer is full
    if (logCount >= SP_LOG_MAX_LINES) {
        memmove(logLines[0], logLines[1], (SP_LOG_MAX_LINES - 1) * sizeof(logLines[0]));
        memmove(logColors, logColors + 1, (SP_LOG_MAX_LINES - 1) * sizeof(uint16_t));
        logCount = SP_LOG_MAX_LINES - 1;
    }

    strncpy(logLines[logCount], text, sizeof(logLines[0]) - 1);
    logLines[logCount][sizeof(logLines[0]) - 1] = '\0';
    logColors[logCount] = color;
    logCount++;
    logDirty = true;  // Display update happens in loop() at 10fps
}

// Redraw log area — only called from display update section (10fps)
static void drawLog() {
    if (!logDirty) return;
    logDirty = false;

    tft.fillRect(0, SP_LOG_START_Y, SCREEN_WIDTH, SP_LOG_END_Y - SP_LOG_START_Y, TFT_BLACK);

    // Subtle skull watermark behind log (very dark)
    tft.drawBitmap(112, 155, bitmap_icon_skull_bluetooth, 16, 16, tft.color565(0, 18, 25));

    tft.setTextSize(1);
    for (int i = 0; i < logCount; i++) {
        tft.setTextColor(logColors[i], TFT_BLACK);
        tft.setCursor(3, SP_LOG_START_Y + i * SP_LOG_LINE_HEIGHT);
        tft.print(logLines[i]);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// ACTIVITY EQUALIZER — 16 bars that react to broadcast activity
// Cyan-to-hot-pink gradient, bounces when spamming, decays when idle
// ═══════════════════════════════════════════════════════════════════════════

static void updateEqHeat() {
    if (spamming) {
        // Spike random bars on each frame — simulates broadcast energy
        for (int i = 0; i < SP_EQ_BARS; i++) {
            // Each bar has a chance to spike
            if (random(100) < 60) {
                int spike = 60 + random(65);  // 60-124
                eqHeat[i] = (eqHeat[i] + spike) / 2;
            } else {
                // Gentle decay
                eqHeat[i] = eqHeat[i] * 3 / 4;
            }
            if (eqHeat[i] > 124) eqHeat[i] = 124;
        }
    } else {
        // Fast decay when stopped
        for (int i = 0; i < SP_EQ_BARS; i++) {
            eqHeat[i] = eqHeat[i] / 2;
        }
    }
}

static void drawEqualizer() {
    updateEqHeat();

    int barWidth = SP_EQ_WIDTH / SP_EQ_BARS;
    int maxBarH = SP_EQ_HEIGHT - 4;

    // Clear EQ area
    tft.fillRect(SP_EQ_X - 1, SP_EQ_Y, SP_EQ_WIDTH + 2, SP_EQ_HEIGHT, TFT_BLACK);

    // Frame around EQ
    tft.drawRect(SP_EQ_X - 2, SP_EQ_Y - 1, SP_EQ_WIDTH + 4, SP_EQ_HEIGHT + 2, HALEHOUND_GUNMETAL);

    bool hasHeat = false;
    for (int i = 0; i < SP_EQ_BARS; i++) {
        if (eqHeat[i] > 3) { hasHeat = true; break; }
    }

    if (!hasHeat && !spamming) {
        // Standby — tiny flat bars
        for (int i = 0; i < SP_EQ_BARS; i++) {
            int x = SP_EQ_X + (i * barWidth);
            int barH = 3 + (i % 3);
            int barY = SP_EQ_Y + SP_EQ_HEIGHT - barH - 2;
            tft.fillRect(x + 1, barY, barWidth - 2, barH, HALEHOUND_GUNMETAL);
        }
        return;
    }

    // Draw active bars with gradient
    for (int i = 0; i < SP_EQ_BARS; i++) {
        int x = SP_EQ_X + (i * barWidth);
        uint8_t heat = eqHeat[i];

        int barH = (heat * maxBarH) / 100;
        if (barH > maxBarH) barH = maxBarH;
        if (barH < 3) barH = 3;

        int barY = SP_EQ_Y + SP_EQ_HEIGHT - barH - 2;

        // Per-pixel gradient (cyan at bottom → hot pink at top)
        for (int y = 0; y < barH; y++) {
            float ratio = (float)y / (float)barH;
            float heatRatio = (float)heat / 124.0f;
            float r = ratio * (0.3f + heatRatio * 0.7f);
            if (r > 1.0f) r = 1.0f;
            uint16_t color = spGradientColor(r);
            tft.drawFastHLine(x + 1, barY + barH - 1 - y, barWidth - 2, color);
        }

        // Glow at base for hot bars
        if (heat > 80) {
            tft.drawFastHLine(x + 1, barY + barH, barWidth - 2, HALEHOUND_HOTPINK);
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SKULL ROWS — 2x8 with animated wave + red pulse on active broadcast
// ═══════════════════════════════════════════════════════════════════════════

static void drawSkulls() {
    int skullStartX = 10;
    int skullSpacing = (SCREEN_WIDTH - 20) / SP_SKULL_NUM;

    for (int row = 0; row < SP_SKULL_ROWS; row++) {
        int rowY = SP_SKULL_Y + (row * SP_SKULL_ROW_SPACING);

        for (int i = 0; i < SP_SKULL_NUM; i++) {
            int x = skullStartX + (i * skullSpacing);
            tft.fillRect(x, rowY, 16, 16, TFT_BLACK);

