rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
            uint16_t color;
            if (spamming) {
                // Map current mode to a "hot skull" position for visual feedback
                int activeSkull = currentMode % SP_SKULL_NUM;
                int dist = abs(i - activeSkull);

                if (dist == 0) {
                    // ACTIVE MODE SKULL — pulsing bright red
                    int pulse = (skullFrame + (row * 2)) % 4;
                    uint8_t brightness = 180 + (pulse * 25);
                    color = tft.color565(brightness, 0, 0);
                } else if (dist == 1) {
                    // ADJACENT SKULLS — orange glow
                    int pulse = (skullFrame + i + (row * 3)) % 6;
                    uint8_t r = 200 + (pulse * 9);
                    uint8_t g = 40 + (pulse * 8);
                    color = tft.color565(r, g, 0);
                } else {
                    // Normal cyan-to-hot-pink wave
                    int phase = (skullFrame + i + (row * 3)) % 8;
                    if (phase < 4) {
                        float ratio = phase / 3.0f;
                        color = spGradientColor(ratio);
                    } else {
                        float ratio = (phase - 4) / 3.0f;
                        uint8_t r = 255 - (uint8_t)(ratio * 255);
                        uint8_t g = 28 + (uint8_t)(ratio * (207 - 28));
                        uint8_t b = 82 + (uint8_t)(ratio * (255 - 82));
                        color = tft.color565(r, g, b);
                    }
                }
            } else {
                color = HALEHOUND_GUNMETAL;  // Gray when inactive
            }

            tft.drawBitmap(x, rowY, spSkulls[i], 16, 16, color);
        }

        // TX/OFF label next to first row
        if (row == 0) {
            tft.fillRect(skullStartX + (SP_SKULL_NUM * skullSpacing), rowY, 50, 16, TFT_BLACK);
            tft.setTextColor(spamming ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
            tft.setTextSize(1);
            tft.setCursor(skullStartX + (SP_SKULL_NUM * skullSpacing) + 5, rowY + 4);
            tft.print(spamming ? "TX!" : "OFF");
        }
    }

    skullFrame++;
}

// ═══════════════════════════════════════════════════════════════════════════
// COUNTER BAR — Gradient progress bar + rate display
// ═══════════════════════════════════════════════════════════════════════════

static void drawCounter() {
    int counterY = SCREEN_HEIGHT - 30;
    tft.fillRect(0, counterY, SCREEN_WIDTH, 25, TFT_BLACK);

    // Gradient bar showing activity (fills based on rate, max at 30/s)
    int barX = 10;
    int barY = counterY + 2;
    int barW = SCALE_W(140);
    int barH = 10;

    // Border
    tft.drawRoundRect(barX - 1, barY - 1, barW + 2, barH + 2, 2, HALEHOUND_MAGENTA);
    tft.fillRoundRect(barX, barY, barW, barH, 1, HALEHOUND_DARK);

    // Fill with gradient based on rate (0-30 pps mapped to 0-100%)
    float fillPct = (currentRate > 0) ? (float)currentRate / 30.0f : 0.0f;
    if (fillPct > 1.0f) fillPct = 1.0f;
    int fillW = (int)(fillPct * barW);
    if (fillW > 0) {
        for (int px = 0; px < fillW; px++) {
            float ratio = (float)px / (float)barW;
            uint16_t c = spGradientColor(ratio);
            tft.drawFastVLine(barX + px, barY + 1, barH - 2, c);
        }
    }

    // Packet count inside the bar
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_BRIGHT, TFT_BLACK);
    char cntBuf[12];
    snprintf(cntBuf, sizeof(cntBuf), "%lu", packetCount);
    tft.setCursor(barX + 4, barY + 1);
    tft.print(cntBuf);

    // Rate display to the right
    tft.setTextColor(spamming ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setCursor(SCALE_X(160), counterY + 3);
    tft.printf("%d pkt/s", currentRate);

    // Small skull icon next to rate when active
    if (spamming) {
        tft.drawBitmap(SCALE_X(220), counterY + 1, bitmap_icon_skull_bluetooth, 16, 16, HALEHOUND_HOTPINK);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// MODE / DEVICE CONTROL
// ═══════════════════════════════════════════════════════════════════════════

static void nextMode() {
    currentMode = (currentMode + 1) % MODE_COUNT;
    drawHeader();
    char buf[42];
    snprintf(buf, sizeof(buf), "[*] Mode: %s", MODE_NAMES[currentMode]);
    addLogEntry(buf, HALEHOUND_HOTPINK);
}

static void prevMode() {
    currentMode = (currentMode - 1 + MODE_COUNT) % MODE_COUNT;
    drawHeader();
    char buf[42];
    snprintf(buf, sizeof(buf), "[*] Mode: %s", MODE_NAMES[currentMode]);
    addLogEntry(buf, HALEHOUND_HOTPINK);
}

static void nextDevice() {
    if (currentMode == MODE_CHAOS) return;
    int count = getDeviceCount(currentMode);
    if (count == 0) return;
    deviceIndex[currentMode] = (deviceIndex[currentMode] + 1) % count;
    drawHeader();
}

static void prevDevice() {
    if (currentMode == MODE_CHAOS) return;
    int count = getDeviceCount(currentMode);
    if (count == 0) return;
    deviceIndex[currentMode] = (deviceIndex[currentMode] - 1 + count) % count;
    drawHeader();
}

// ═══════════════════════════════════════════════════════════════════════════
// RAW ESP-IDF ADVERTISING PARAMS (bypasses Arduino wrapper for reliable BLE spam)
// ADV_TYPE_NONCONN_IND = non-connectable undirected (BLE spam standard)
// BLE_ADDR_TYPE_RANDOM = use our random MAC per broadcast cycle
// 0x20 interval = 20ms = fastest BLE spec allows
// ═══════════════════════════════════════════════════════════════════════════

static esp_ble_adv_params_t bleSpamAdvParams = {
    .adv_int_min = 0x20,
    .adv_int_max = 0x20,
    .adv_type = ADV_TYPE_NONCONN_IND,
    .own_addr_type = BLE_ADDR_TYPE_RANDOM,
    .channel_map = ADV_CHNL_ALL,
    .adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY,
};

// ═══════════════════════════════════════════════════════════════════════════
// BROADCAST ENGINE
// ═══════════════════════════════════════════════════════════════════════════

static void doBroadcast() {
    // ═══════════════════════════════════════════════════════════════════════
    // BLE BROADCAST — Raw ESP-IDF API (Arduino wrapper doesn't cycle MACs correctly)
    // Sequence: stop → setRandAddr → configDataRaw → start → delay → stop
    // ═══════════════════════════════════════════════════════════════════════

