rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Kill WiFi completely — it shares the 2.4GHz radio with BLE
    // MUST use Arduino API to keep _esp_wifi_started flag in sync
    WiFi.mode(WIFI_OFF);
    delay(200);

    // Initialize BLE — must wait for controller to be fully ready before setting TX power
    releaseClassicBtMemory();
    BLEDevice::init("HaleHound");
    delay(150);  // BLE controller needs time to finish internal init

    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_DEFAULT, ESP_PWR_LVL_P9);
    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_ADV, ESP_PWR_LVL_P9);

    Serial.println("[BLESPOOF] BLE stack initialized, max TX power set");

    // Reset state
    spamming = false;
    exitRequested = false;
    packetCount = 0;
    currentRate = 0;
    rateWindowCount = 0;
    logCount = 0;
    skullFrame = 0;
    chaosStep = 0;
    for (int i = 0; i < MODE_COUNT; i++) deviceIndex[i] = 0;
    spamTaskHandle = NULL;
    spamTaskRunning = false;

    // Apply initial mode if set (for SourApple redirect)
    if (initialMode >= 0 && initialMode < MODE_COUNT) {
        currentMode = initialMode;
        initialMode = -1;
    } else {
        currentMode = MODE_APPLE_POPUP;
    }

    // Draw full UI
    drawIconBar();
    drawHeader();
    drawEqualizer();
    drawSkulls();
    drawCounter();

    addLogEntry("[*] BLE Spoofer ready", HALEHOUND_MAGENTA);
    char modeBuf[42];
    snprintf(modeBuf, sizeof(modeBuf), "[*] Mode: %s", MODE_NAMES[currentMode]);
    addLogEntry(modeBuf, HALEHOUND_MAGENTA);
    drawLog();  // Force initial log display

    lastDisplayUpdate = millis();
    initialized = true;

    #if CYD_DEBUG
    Serial.println("[BLESPOOF] Ready");
    #endif
}

void loop() {
    if (!initialized) return;

    touchButtonsUpdate();

    // ═══════════════════════════════════════════════════════════════════════
    // TOUCH HANDLING - with release detection (prevents repeat triggers)
    // Icons: Back=10, Toggle=60, PrevMode=105, NextMode=140, PrevDev=180, NextDev=215
    // ═══════════════════════════════════════════════════════════════════════
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        // Icon bar area
        if (ty >= ICON_BAR_Y && ty <= (ICON_BAR_BOTTOM + 4)) {
            // Wait for touch release to prevent repeated triggers
            waitForTouchRelease();

            // Back icon (x=10)
            if (tx >= 5 && tx <= 30) {
                if (spamming) stopSpam();
                exitRequested = true;
                return;
            }
            // Toggle icon (x=60)
            else if (tx >= 50 && tx <= 80) {
                toggleSpam();
                return;
            }
            // Prev mode icon (x=105)
            else if (tx >= 95 && tx <= 125) {
                prevMode();
                return;
            }
            // Next mode icon (x=140)
            else if (tx >= 130 && tx <= 160) {
                nextMode();
                return;
            }
            // Prev device icon (x=180)
            else if (tx >= 170 && tx <= 200) {
                prevDevice();
                return;
            }
            // Next device icon at right edge
            else if (tx >= (tft.width() - 35) && tx <= tft.width()) {
                nextDevice();
                return;
            }
        }
    }

    // Hardware button fallback
    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (spamming) stopSpam();
        exitRequested = true;
        return;
    }

    // Button navigation
    if (buttonPressed(BTN_LEFT)) prevDevice();
    if (buttonPressed(BTN_RIGHT)) nextDevice();
    if (buttonPressed(BTN_UP)) prevMode();
    if (buttonPressed(BTN_DOWN)) nextMode();
    if (buttonPressed(BTN_SELECT)) toggleSpam();

    // Broadcast engine runs on Core 0 (spamTxTask)
    // Rate calculation also runs on Core 0

    // Feed the watchdog
    yield();

    // ═══════════════════════════════════════════════════════════════════════
    // DISPLAY UPDATE (~10fps = 100ms throttle for skulls + counter + log)
    // ═══════════════════════════════════════════════════════════════════════
    if (millis() - lastDisplayUpdate >= 100) {
        drawEqualizer();
        drawSkulls();
        drawCounter();
        drawLog();
        lastDisplayUpdate = millis();
    }
}

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    stopSpamTask();  // Stop Core 0 task before BLE teardown

    BLEDevice::deinit(false);  // false = library bug: deinit(true) never resets initialized flag

    spamming = false;
    initialized = false;
    exitRequested = false;
    initialMode = -1;
    logDirty = false;
    logCount = 0;

    #if CYD_DEBUG
    Serial.println("[BLESPOOF] Cleanup complete");
    #endif
}

}  // namespace BleSpoofer


// ═══════════════════════════════════════════════════════════════════════════
// BLE UTILITIES
// ═══════════════════════════════════════════════════════════════════════════

void bleInit() {
    releaseClassicBtMemory();
    BLEDevice::init("HaleHound");
}

void bleCleanup() {
    BLEDevice::deinit(false);  // false = library bug: deinit(true) never resets initialized flag
}


// ═══════════════════════════════════════════════════════════════════════════
// BLE BEACON - iBeacon / Eddystone Beacon Transmitter
// Standards-compliant beacon broadcasting for testing beacon-aware apps,
// geo-fencing systems, and proximity detection.
// Uses same proven ESP-IDF raw advertising API as BleSpoofer.
// Created: 2026-02-14
// ═══════════════════════════════════════════════════════════════════════════

namespace BleBeacon {

// ═══════════════════════════════════════════════════════════════════════════
// BEACON MODES
// ═══════════════════════════════════════════════════════════════════════════

enum BeaconMode {
    BCN_RANDOM_IBEACON = 0,
    BCN_APPLE_STORE,
    BCN_STARBUCKS,
    BCN_EDDYSTONE_URL,
    BCN_EDDYSTONE_UID,
    BCN_GEO_FENCE,
    BCN_MODE_COUNT  // 6
};

static const char* BCN_MODE_NAMES[] = {
    "RANDOM iBEACON",
    "APPLE STORE",
    "STARBUCKS",
    "EDDYSTONE URL",
    "EDDYSTONE UID",
    "GEO-FENCE"
};

// ═══════════════════════════════════════════════════════════════════════════
// iBEACON PRESETS
// iBeacon format: Flags(3) + Mfr(0xFF) + Apple(4C00) + type(0215) +
//                 UUID(16) + Major(2) + Minor(2) + TX Power(1)
// ═══════════════════════════════════════════════════════════════════════════

// Apple Store iBeacon UUID: E2C56DB5-DFFB-48D2-B060-D0F5A71096E0
static const uint8_t UUID_APPLE_STORE[16] = {
    0xE2, 0xC5, 0x6D, 0xB5, 0xDF, 0xFB, 0x48, 0xD2,
    0xB0, 0x60, 0xD0, 0xF5, 0xA7, 0x10, 0x96, 0xE0
};

