rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// Starbucks retail beacon UUID: 2F234454-CF6D-4A0F-ADF2-F4911BA9FFA6
static const uint8_t UUID_STARBUCKS[16] = {
    0x2F, 0x23, 0x44, 0x54, 0xCF, 0x6D, 0x4A, 0x0F,
    0xAD, 0xF2, 0xF4, 0x91, 0x1B, 0xA9, 0xFF, 0xA6
};

// Target retail beacon UUID: AA6062F0-98CA-4211-8EC4-3D0B20EA9616
static const uint8_t UUID_TARGET[16] = {
    0xAA, 0x60, 0x62, 0xF0, 0x98, 0xCA, 0x42, 0x11,
    0x8E, 0xC4, 0x3D, 0x0B, 0x20, 0xEA, 0x96, 0x16
};

// Walmart retail beacon UUID: 74278BDA-B644-4520-8F0C-720EAF059935
static const uint8_t UUID_WALMART[16] = {
    0x74, 0x27, 0x8B, 0xDA, 0xB6, 0x44, 0x45, 0x20,
    0x8F, 0x0C, 0x72, 0x0E, 0xAF, 0x05, 0x99, 0x35
};

// Macy's retail beacon UUID: B9407F30-F5F8-466E-AFF9-25556B57FE6D (Estimote)
static const uint8_t UUID_MACYS[16] = {
    0xB9, 0x40, 0x7F, 0x30, 0xF5, 0xF8, 0x46, 0x6E,
    0xAF, 0xF9, 0x25, 0x55, 0x6B, 0x57, 0xFE, 0x6D
};

// Geo-fence preset table
#define GEO_FENCE_PRESET_COUNT 5
static const uint8_t* GEO_FENCE_UUIDS[GEO_FENCE_PRESET_COUNT] = {
    UUID_APPLE_STORE, UUID_STARBUCKS, UUID_TARGET, UUID_WALMART, UUID_MACYS
};
static const char* GEO_FENCE_NAMES[GEO_FENCE_PRESET_COUNT] = {
    "AppleStore", "Starbucks", "Target", "Walmart", "Macys"
};

// Eddystone URL preset
static const char* EDDYSTONE_URL_PRESET = "google.com";

// ═══════════════════════════════════════════════════════════════════════════
// STATE VARIABLES
// ═══════════════════════════════════════════════════════════════════════════

static bool initialized = false;
static volatile bool beaconing = false;
static bool exitRequested = false;
static volatile int currentMode = BCN_RANDOM_IBEACON;

static volatile uint32_t packetCount = 0;
static volatile uint32_t rateWindowCount = 0;
static volatile uint16_t currentRate = 0;
static volatile int geoFenceStep = 0;

// ═══════════════════════════════════════════════════════════════════════════
// DUAL-CORE TASK MANAGEMENT
// Core 0: BLE broadcast engine (doBroadcast loop)
// Core 1: Display + touch (Arduino main loop)
// ═══════════════════════════════════════════════════════════════════════════

static TaskHandle_t bcnTaskHandle = NULL;
static volatile bool bcnTaskRunning = false;

// ═══════════════════════════════════════════════════════════════════════════
// SCROLLING LOG
// ═══════════════════════════════════════════════════════════════════════════

#define BCN_LOG_MAX_LINES 8
#define BCN_LOG_LINE_HEIGHT 13
#define BCN_LOG_START_Y 115
#define BCN_LOG_END_Y (SCREEN_HEIGHT - 90)

static char bcnLogLines[BCN_LOG_MAX_LINES][42];
static uint16_t bcnLogColors[BCN_LOG_MAX_LINES];
static volatile int bcnLogCount = 0;
static volatile bool bcnLogDirty = false;  // Core 0 sets via bcnAddLog, Core 1 reads in bcnDrawLog

static unsigned long lastDisplayUpdate = 0;

// ═══════════════════════════════════════════════════════════════════════════
// RAW ESP-IDF ADVERTISING PARAMS (same proven pattern as BleSpoofer)
// ADV_TYPE_NONCONN_IND = non-connectable undirected (beacon standard)
// BLE_ADDR_TYPE_RANDOM = random MAC per broadcast
// 0xA0 interval = 100ms = standard iBeacon rate
// ═══════════════════════════════════════════════════════════════════════════

static esp_ble_adv_params_t bcnAdvParams = {
    .adv_int_min = 0xA0,
    .adv_int_max = 0xA0,
    .adv_type = ADV_TYPE_NONCONN_IND,
    .own_addr_type = BLE_ADDR_TYPE_RANDOM,
    .channel_map = ADV_CHNL_ALL,
    .adv_filter_policy = ADV_FILTER_ALLOW_SCAN_ANY_CON_ANY,
};

// ═══════════════════════════════════════════════════════════════════════════
// ICON BAR - 4 icons: Back | Toggle | PrevMode | NextMode
// ═══════════════════════════════════════════════════════════════════════════

#define BCN_ICON_SIZE 16
#define BCN_ICON_NUM 4

static const int bcnIconX[BCN_ICON_NUM] = {10, 70, 140, 200};
static const unsigned char* bcnIcons[BCN_ICON_NUM] = {
    bitmap_icon_go_back,           // 0: Back/Exit
    bitmap_icon_start,             // 1: Toggle beacon ON/OFF
    bitmap_icon_LEFT,              // 2: Previous mode
    bitmap_icon_RIGHT              // 3: Next mode
};

// ═══════════════════════════════════════════════════════════════════════════
// LOG FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

static void bcnAddLog(const char* text, uint16_t color) {
    if (bcnLogCount >= BCN_LOG_MAX_LINES) {
        memmove(bcnLogLines[0], bcnLogLines[1], (BCN_LOG_MAX_LINES - 1) * sizeof(bcnLogLines[0]));
        memmove(bcnLogColors, bcnLogColors + 1, (BCN_LOG_MAX_LINES - 1) * sizeof(uint16_t));
        bcnLogCount = BCN_LOG_MAX_LINES - 1;
    }
    strncpy(bcnLogLines[bcnLogCount], text, sizeof(bcnLogLines[0]) - 1);
    bcnLogLines[bcnLogCount][sizeof(bcnLogLines[0]) - 1] = '\0';
    bcnLogColors[bcnLogCount] = color;
    bcnLogCount++;
    bcnLogDirty = true;
}

static void bcnDrawLog() {
    if (!bcnLogDirty) return;
    bcnLogDirty = false;

    tft.fillRect(0, BCN_LOG_START_Y, SCREEN_WIDTH, BCN_LOG_END_Y - BCN_LOG_START_Y, TFT_BLACK);

    tft.setTextSize(1);
    for (int i = 0; i < bcnLogCount; i++) {
        tft.setTextColor(bcnLogColors[i], TFT_BLACK);
        tft.setCursor(3, BCN_LOG_START_Y + i * BCN_LOG_LINE_HEIGHT);
        tft.print(bcnLogLines[i]);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// UI DRAWING
// ═══════════════════════════════════════════════════════════════════════════

static void bcnDrawIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, HALEHOUND_GUNMETAL);
    for (int i = 0; i < BCN_ICON_NUM; i++) {
        uint16_t color = HALEHOUND_MAGENTA;
        if (i == 1 && beaconing) color = HALEHOUND_HOTPINK;
        tft.drawBitmap(bcnIconX[i], ICON_BAR_Y, bcnIcons[i], BCN_ICON_SIZE, BCN_ICON_SIZE, color);
    }
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

static void bcnDrawHeader() {
    tft.fillRect(0, 40, SCREEN_WIDTH, 72, TFT_BLACK);

    // Title — Nosifer with glitch effect
    drawGlitchText(SCALE_Y(60), "BLE BEACON", &Nosifer_Regular10pt7b);

    // Status
    tft.setTextSize(1);
    if (beaconing) {
        tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
        tft.setCursor(78, 68);
        tft.print(">> BEACONING <<");
    } else {
        tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
        tft.setCursor(95, 68);
        tft.print("- IDLE -");
    }

    // Mode in framed bar
    tft.drawRoundRect(5, 82, GRAPH_PADDED_W, 16, 3, HALEHOUND_VIOLET);
    tft.drawRoundRect(6, 83, GRAPH_PADDED_W - 2, 14, 2, HALEHOUND_GUNMETAL);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(10, 86);
    tft.printf(" %s", BCN_MODE_NAMES[currentMode]);

    // Packet count on right side
    if (packetCount > 0) {
        char cntBuf[14];
        snprintf(cntBuf, sizeof(cntBuf), "%lu pkt", packetCount);
        tft.setCursor(170, 86);
        tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
        tft.print(cntBuf);
    }

