rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    tft.drawLine(0, 100, SCREEN_WIDTH, 100, HALEHOUND_HOTPINK);

    // Rate display bar
    tft.fillRect(0, 102, SCREEN_WIDTH, 12, TFT_BLACK);
    tft.setTextColor(beaconing ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setCursor(5, 103);
    tft.printf("Rate: %d bcn/s", currentRate);

    if (beaconing) {
        // Animated gradient pulse: cyan → hot pink → cyan
        int phase = (millis() / 100) % 16;
        float ratio = (phase < 8) ? (phase / 7.0f) : ((16 - phase) / 8.0f);
        uint8_t r = (uint8_t)(ratio * 255);
        uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
        uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
        tft.drawBitmap(220, 102, bitmap_icon_signal, 16, 16, tft.color565(r, g, b));
    }
}

// Lightweight rate-only update — no fillRect clear on title/mode areas
// Called in 100ms display loop instead of full bcnDrawHeader()
static void bcnDrawRate() {
    // Rate display bar only (Y=102-114)
    tft.fillRect(0, 102, 215, 12, TFT_BLACK);
    tft.setTextColor(beaconing ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setCursor(5, 103);
    tft.printf("Rate: %d bcn/s", currentRate);

    // Packet count in mode bar (right side, Y=86)
    if (packetCount > 0) {
        tft.fillRect(165, 84, 70, 12, TFT_BLACK);
        char cntBuf[14];
        snprintf(cntBuf, sizeof(cntBuf), "%lu pkt", packetCount);
        tft.setCursor(170, 86);
        tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
        tft.print(cntBuf);
    }

    // Animated signal icon
    if (beaconing) {
        int phase = (millis() / 100) % 16;
        float ratio = (phase < 8) ? (phase / 7.0f) : ((16 - phase) / 8.0f);
        uint8_t r = (uint8_t)(ratio * 255);
        uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
        uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
        tft.drawBitmap(220, 102, bitmap_icon_signal, 16, 16, tft.color565(r, g, b));
    }
}

static void bcnDrawCounter() {
    int counterY = SCREEN_HEIGHT - 88;
    tft.fillRect(0, counterY, SCREEN_WIDTH, 20, TFT_BLACK);

    // Gradient bar
    int barX = 10;
    int barY = counterY + 2;
    int barW = SCALE_W(140);
    int barH = 10;

    tft.drawRoundRect(barX - 1, barY - 1, barW + 2, barH + 2, 2, HALEHOUND_MAGENTA);
    tft.fillRoundRect(barX, barY, barW, barH, 1, HALEHOUND_DARK);

    float fillPct = (currentRate > 0) ? (float)currentRate / 12.0f : 0.0f;
    if (fillPct > 1.0f) fillPct = 1.0f;
    int fillW = (int)(fillPct * barW);
    if (fillW > 0) {
        for (int px = 0; px < fillW; px++) {
            float ratio = (float)px / (float)barW;
            // Cyan to hot pink gradient
            uint8_t r = (uint8_t)(ratio * 255);
            uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
            uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
            uint16_t c = tft.color565(r, g, b);
            tft.drawFastVLine(barX + px, barY + 1, barH - 2, c);
        }
    }

    // Count text
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_BRIGHT, TFT_BLACK);
    char cntBuf[12];
    snprintf(cntBuf, sizeof(cntBuf), "%lu", packetCount);
    tft.setCursor(barX + 4, barY + 1);
    tft.print(cntBuf);

    // Rate on right
    tft.setTextColor(beaconing ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setCursor(SCALE_X(160), counterY + 3);
    tft.printf("%d bcn/s", currentRate);
}

// Skull row at bottom (matches BleSpoofer pattern)
static int bcnSkullFrame = 0;
static const unsigned char* bcnSkulls[8] = {
    bitmap_icon_skull_wifi, bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer, bitmap_icon_skull_subghz,
    bitmap_icon_skull_ir, bitmap_icon_skull_tools,
    bitmap_icon_skull_setting, bitmap_icon_skull_about
};

static void bcnDrawSkulls() {
    int skullY = SCREEN_HEIGHT - 48;
    int skullStartX = 10;
    int skullSpacing = (SCREEN_WIDTH - 20) / 8;

    for (int i = 0; i < 8; i++) {
        int x = skullStartX + (i * skullSpacing);
        tft.fillRect(x, skullY, 16, 16, TFT_BLACK);

        uint16_t color;
        if (beaconing) {
            int phase = (bcnSkullFrame + i) % 8;
            if (phase < 4) {
                float ratio = phase / 3.0f;
                uint8_t r = (uint8_t)(ratio * 255);
                uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
                uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
                color = tft.color565(r, g, b);
            } else {
                float ratio = (phase - 4) / 3.0f;
                uint8_t r = 255 - (uint8_t)(ratio * 255);
                uint8_t g = 28 + (uint8_t)(ratio * (207 - 28));
                uint8_t b = 82 + (uint8_t)(ratio * (255 - 82));
                color = tft.color565(r, g, b);
            }
        } else {
            color = HALEHOUND_GUNMETAL;
        }

        tft.drawBitmap(x, skullY, bcnSkulls[i], 16, 16, color);
    }

    // TX/OFF label
    tft.fillRect(skullStartX + (8 * skullSpacing), skullY, 50, 16, TFT_BLACK);
    tft.setTextColor(beaconing ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(skullStartX + (8 * skullSpacing) + 5, skullY + 4);
    tft.print(beaconing ? "TX!" : "OFF");

    bcnSkullFrame++;
}

// ═══════════════════════════════════════════════════════════════════════════
// PACKET BUILDERS
// ═══════════════════════════════════════════════════════════════════════════

// Build standard 30-byte iBeacon advertisement payload
// Returns total packet length (always 30)
static int buildIBeaconPacket(uint8_t* buf, const uint8_t* uuid, uint16_t major, uint16_t minor, int8_t txPower) {
    int i = 0;
    // Flags AD structure
    buf[i++] = 0x02;  // Length
    buf[i++] = 0x01;  // Flags type
    buf[i++] = 0x06;  // General Discoverable + BR/EDR Not Supported
    // Manufacturer Specific Data
    buf[i++] = 0x1A;  // AD Length = 26 bytes follow
    buf[i++] = 0xFF;  // Manufacturer Specific Data type
    buf[i++] = 0x4C;  // Apple Inc (low byte)
    buf[i++] = 0x00;  // Apple Inc (high byte)
    buf[i++] = 0x02;  // iBeacon type
    buf[i++] = 0x15;  // iBeacon data length (21 bytes)
    // UUID (16 bytes)
    memcpy(&buf[i], uuid, 16);
    i += 16;
    // Major (big-endian)
    buf[i++] = (major >> 8) & 0xFF;
    buf[i++] = major & 0xFF;
    // Minor (big-endian)
    buf[i++] = (minor >> 8) & 0xFF;
    buf[i++] = minor & 0xFF;
    // TX Power (calibrated at 1m)
    buf[i++] = (uint8_t)txPower;
    return i;  // 30
}

// Build Eddystone-URL advertisement payload
// Returns total packet length
static int buildEddystoneURL(uint8_t* buf, const char* url) {
    int i = 0;
    // Flags AD structure
    buf[i++] = 0x02;  // Length
    buf[i++] = 0x01;  // Flags type
    buf[i++] = 0x06;  // General Discoverable + BR/EDR Not Supported
    // Complete 16-bit Service UUID (Eddystone 0xFEAA)
    buf[i++] = 0x03;  // Length
    buf[i++] = 0x03;  // Complete 16-bit UUID list type
    buf[i++] = 0xAA;  // 0xFEAA little-endian low
    buf[i++] = 0xFE;  // 0xFEAA little-endian high
    // Service Data start — length filled at end
    int svcLenPos = i;
    buf[i++] = 0x00;  // Placeholder for service data length
    buf[i++] = 0x16;  // Service Data type
    buf[i++] = 0xAA;  // 0xFEAA little-endian low
    buf[i++] = 0xFE;  // 0xFEAA little-endian high
    // Eddystone-URL frame
    buf[i++] = 0x10;  // Frame type: URL
    buf[i++] = 0xF4;  // TX Power at 0m (-12 dBm typical)
    // URL scheme prefix
    buf[i++] = 0x01;  // "https://www."
    // Encode URL (with .com expansion code per Eddystone spec)
    int urlLen = strlen(url);
    if (urlLen > 17) urlLen = 17;  // Max URL bytes in BLE adv
    for (int u = 0; u < urlLen; u++) {
        // Encode .com as 0x00 per Eddystone spec
        if (u + 3 < urlLen && url[u] == '.' && url[u+1] == 'c' && url[u+2] == 'o' && url[u+3] == 'm') {
            buf[i++] = 0x00;  // .com expansion code
            u += 3;  // Skip past ".com"
        } else {
            buf[i++] = (uint8_t)url[u];
        }
    }
    // Fill in service data length (everything after the length byte)
    buf[svcLenPos] = (uint8_t)(i - svcLenPos - 1);
    return i;
}

