rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// Build Eddystone-UID advertisement payload
// Returns total packet length
static int buildEddystoneUID(uint8_t* buf, const uint8_t* ns, const uint8_t* instance) {
    int i = 0;
    // Flags AD structure
    buf[i++] = 0x02;
    buf[i++] = 0x01;
    buf[i++] = 0x06;
    // Complete 16-bit Service UUID (Eddystone 0xFEAA)
    buf[i++] = 0x03;
    buf[i++] = 0x03;
    buf[i++] = 0xAA;
    buf[i++] = 0xFE;
    // Service Data
    buf[i++] = 0x15;  // Length: 21 bytes follow
    buf[i++] = 0x16;  // Service Data type
    buf[i++] = 0xAA;  // 0xFEAA
    buf[i++] = 0xFE;
    // Eddystone-UID frame
    buf[i++] = 0x00;  // Frame type: UID
    buf[i++] = 0xF4;  // TX Power at 0m
    // Namespace (10 bytes)
    memcpy(&buf[i], ns, 10);
    i += 10;
    // Instance (6 bytes)
    memcpy(&buf[i], instance, 6);
    i += 6;
    // Reserved (2 bytes, must be 0x00)
    buf[i++] = 0x00;
    buf[i++] = 0x00;
    return i;  // 25
}

// ═══════════════════════════════════════════════════════════════════════════
// BROADCAST ENGINE
// ═══════════════════════════════════════════════════════════════════════════

static void doBroadcast() {
    // Stop any current advertising
    esp_ble_gap_stop_advertising();

    // Generate random BLE MAC address
    esp_bd_addr_t addr;
    esp_fill_random(addr, 6);
    addr[0] |= 0xC0;  // BLE random static address type

    esp_ble_gap_set_rand_addr(addr);

    // Build packet based on current mode
    uint8_t pkt[31];
    int pktLen = 0;
    char logBuf[42];

    switch (currentMode) {
        case BCN_RANDOM_IBEACON: {
            // Random UUID, Major, Minor each cycle
            uint8_t randUUID[16];
            esp_fill_random(randUUID, 16);
            uint16_t major = (uint16_t)random(0xFFFF);
            uint16_t minor = (uint16_t)random(0xFFFF);
            pktLen = buildIBeaconPacket(pkt, randUUID, major, minor, -59);
            snprintf(logBuf, sizeof(logBuf), "[+] iBeacon %04X:%04X", major, minor);
            break;
        }
        case BCN_APPLE_STORE: {
            uint16_t major = 1 + (uint16_t)random(50);  // Store section
            uint16_t minor = 1 + (uint16_t)random(200);  // Fixture
            pktLen = buildIBeaconPacket(pkt, UUID_APPLE_STORE, major, minor, -59);
            snprintf(logBuf, sizeof(logBuf), "[+] Apple %d:%d", major, minor);
            break;
        }
        case BCN_STARBUCKS: {
            uint16_t major = 100 + (uint16_t)random(900);
            uint16_t minor = 1 + (uint16_t)random(50);
            pktLen = buildIBeaconPacket(pkt, UUID_STARBUCKS, major, minor, -59);
            snprintf(logBuf, sizeof(logBuf), "[+] Starbucks %d:%d", major, minor);
            break;
        }
        case BCN_EDDYSTONE_URL: {
            pktLen = buildEddystoneURL(pkt, EDDYSTONE_URL_PRESET);
            snprintf(logBuf, sizeof(logBuf), "[+] Eddy-URL: %s", EDDYSTONE_URL_PRESET);
            break;
        }
        case BCN_EDDYSTONE_UID: {
            uint8_t ns[10];
            uint8_t instance[6];
            esp_fill_random(ns, 10);
            esp_fill_random(instance, 6);
            pktLen = buildEddystoneUID(pkt, ns, instance);
            snprintf(logBuf, sizeof(logBuf), "[+] Eddy-UID %02X%02X:%02X%02X",
                     ns[0], ns[1], instance[0], instance[1]);
            break;
        }
        case BCN_GEO_FENCE: {
            // Cycle through all retail presets rapidly
            int presetIdx = geoFenceStep % GEO_FENCE_PRESET_COUNT;
            uint16_t major = 1 + (uint16_t)random(500);
            uint16_t minor = 1 + (uint16_t)random(500);
            pktLen = buildIBeaconPacket(pkt, GEO_FENCE_UUIDS[presetIdx], major, minor, -59);
            snprintf(logBuf, sizeof(logBuf), "[+] GeoF %s %d:%d",
                     GEO_FENCE_NAMES[presetIdx], major, minor);
            geoFenceStep++;
            break;
        }
        default:
            return;
    }

    // Set raw advertising data via ESP-IDF
    esp_ble_gap_config_adv_data_raw(pkt, pktLen);
    delay(1);

    // Start advertising
    esp_ble_gap_start_advertising(&bcnAdvParams);
    delay(20);
    esp_ble_gap_stop_advertising();

    // Update counters
    packetCount++;
    rateWindowCount++;

    // Serial debug for first 5 packets
    if (packetCount <= 5) {
        Serial.printf("[BEACON] TX #%lu mode=%d len=%d addr=%02X:%02X:%02X\n",
            packetCount, currentMode, pktLen, addr[0], addr[1], addr[2]);
    }

    bcnAddLog(logBuf, HALEHOUND_VIOLET);
}

// ═══════════════════════════════════════════════════════════════════════════
// CORE 0 BROADCAST TASK — Runs doBroadcast() as fast as BLE allows
// BLE advertising has inherent ~21ms per cycle (delay(1) + delay(20))
// ═══════════════════════════════════════════════════════════════════════════

static void bcnTxTask(void* param) {
    bcnTaskRunning = true;
    unsigned long rateStart = millis();

    while (beaconing) {
        // Heap safety — BLEAdvertisementData allocates std::string on heap
        if (esp_get_free_heap_size() < 8192) {
            vTaskDelay(pdMS_TO_TICKS(50));
            continue;
        }

        doBroadcast();  // Increments packetCount and rateWindowCount

        // Update rate counter every second
        unsigned long now = millis();
        if (now - rateStart >= 1000) {
            currentRate = (uint16_t)rateWindowCount;
            rateWindowCount = 0;
            rateStart = now;
        }

        // Yield — delay(20) in doBroadcast already yields, but belt and suspenders
        vTaskDelay(1);
    }

    bcnTaskRunning = false;
    vTaskDelete(NULL);
}

static void startBcnTask() {
    if (bcnTaskHandle != NULL) return;
    xTaskCreatePinnedToCore(bcnTxTask, "bleBeacon", 8192, NULL, 1, &bcnTaskHandle, 0);
}

static void stopBcnTask() {
    beaconing = false;
    if (bcnTaskHandle == NULL) return;

    // Wait for task to finish (500ms timeout)
    unsigned long start = millis();
    while (bcnTaskRunning && (millis() - start < 500)) {
        delay(10);
    }

    // Force kill if task didn't exit cleanly
    if (bcnTaskRunning) {
        vTaskDelete(bcnTaskHandle);
    }

    bcnTaskHandle = NULL;
    bcnTaskRunning = false;

    // Stop any lingering advertising
    esp_ble_gap_stop_advertising();
}

// ═══════════════════════════════════════════════════════════════════════════
// CONTROL FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

static void startBeacon() {
    beaconing = true;
    rateWindowCount = 0;
    bcnAddLog("[!] BEACON STARTED", HALEHOUND_HOTPINK);
    bcnDrawIconBar();
    bcnDrawHeader();
    bcnDrawLog();

    startBcnTask();  // Launch Core 0 broadcast engine

    #if CYD_DEBUG
    Serial.printf("[BEACON] Started - Mode: %s (Core 0)\n", BCN_MODE_NAMES[currentMode]);
    #endif
}

