rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
static void stopBeacon() {
    stopBcnTask();  // Stop Core 0 task first
    bcnAddLog("[!] BEACON STOPPED", HALEHOUND_HOTPINK);
    bcnDrawIconBar();
    bcnDrawHeader();

    #if CYD_DEBUG
    Serial.println("[BEACON] Stopped");
    #endif
}

static void toggleBeacon() {
    if (beaconing) stopBeacon(); else startBeacon();
}

static void nextMode() {
    currentMode = (currentMode + 1) % BCN_MODE_COUNT;
    bcnDrawHeader();
    char buf[42];
    snprintf(buf, sizeof(buf), "[*] Mode: %s", BCN_MODE_NAMES[currentMode]);
    bcnAddLog(buf, HALEHOUND_HOTPINK);
}

static void prevMode() {
    currentMode = (currentMode - 1 + BCN_MODE_COUNT) % BCN_MODE_COUNT;
    bcnDrawHeader();
    char buf[42];
    snprintf(buf, sizeof(buf), "[*] Mode: %s", BCN_MODE_NAMES[currentMode]);
    bcnAddLog(buf, HALEHOUND_HOTPINK);
}

// ═══════════════════════════════════════════════════════════════════════════
// PUBLIC FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

void setup() {
    if (initialized) return;

    #if CYD_DEBUG
    Serial.println("[BEACON] Initializing BLE Beacon...");
    #endif

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();

    // Kill WiFi — shares 2.4GHz radio with BLE
    // MUST use Arduino API to keep _esp_wifi_started flag in sync
    WiFi.mode(WIFI_OFF);
    delay(200);

    // Initialize BLE — wait for controller ready before TX power
    releaseClassicBtMemory();
    BLEDevice::init("HaleHound");
    delay(150);  // BLE controller needs time to finish internal init

    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_DEFAULT, ESP_PWR_LVL_P9);
    esp_ble_tx_power_set(ESP_BLE_PWR_TYPE_ADV, ESP_PWR_LVL_P9);

    Serial.println("[BEACON] BLE stack initialized, max TX power set");

    // Reset state
    beaconing = false;
    exitRequested = false;
    packetCount = 0;
    currentRate = 0;
    rateWindowCount = 0;
    bcnLogCount = 0;
    bcnSkullFrame = 0;
    geoFenceStep = 0;
    currentMode = BCN_RANDOM_IBEACON;
    bcnTaskHandle = NULL;
    bcnTaskRunning = false;

    // Draw full UI
    bcnDrawIconBar();
    bcnDrawHeader();
    bcnDrawSkulls();
    bcnDrawCounter();

    bcnAddLog("[*] BLE Beacon ready", HALEHOUND_MAGENTA);
    char modeBuf[42];
    snprintf(modeBuf, sizeof(modeBuf), "[*] Mode: %s", BCN_MODE_NAMES[currentMode]);
    bcnAddLog(modeBuf, HALEHOUND_MAGENTA);
    bcnDrawLog();

    lastDisplayUpdate = millis();
    initialized = true;

    #if CYD_DEBUG
    Serial.println("[BEACON] Ready");
    #endif
}

void loop() {
    if (!initialized) return;

    touchButtonsUpdate();

    // ═══════════════════════════════════════════════════════════════════════
    // TOUCH HANDLING
    // Icons: Back=10, Toggle=70, PrevMode=140, NextMode=200
    // ═══════════════════════════════════════════════════════════════════════
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        // Icon bar area (y=20-40)
        if (ty >= 20 && ty <= 40) {
            waitForTouchRelease();

            // Back icon (x=10)
            if (tx >= 5 && tx <= 30) {
                if (beaconing) stopBeacon();
                exitRequested = true;
                return;
            }
            // Toggle icon (x=70)
            else if (tx >= 60 && tx <= 90) {
                toggleBeacon();
                return;
            }
            // Prev mode icon (x=140)
            else if (tx >= 130 && tx <= 160) {
                prevMode();
                return;
            }
            // Next mode icon (x=200)
            else if (tx >= 190 && tx <= 220) {
                nextMode();
                return;
            }
        }
    }

    // Hardware button fallback
    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (beaconing) stopBeacon();
        exitRequested = true;
        return;
    }

    // Button navigation
    if (buttonPressed(BTN_LEFT)) prevMode();
    if (buttonPressed(BTN_RIGHT)) nextMode();
    if (buttonPressed(BTN_SELECT)) toggleBeacon();

    // Broadcast engine runs on Core 0 (bcnTxTask)
    // Rate calculation also runs on Core 0

    // Feed the watchdog
    yield();

    // ═══════════════════════════════════════════════════════════════════════
    // DISPLAY UPDATE (~10fps)
    // ═══════════════════════════════════════════════════════════════════════
    if (millis() - lastDisplayUpdate >= 100) {
        bcnDrawSkulls();
        bcnDrawCounter();
        bcnDrawLog();
        bcnDrawRate();  // Lightweight — only rate + pkt count, no full header clear
        lastDisplayUpdate = millis();
    }
}

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    stopBcnTask();  // Stop Core 0 task before BLE teardown

    BLEDevice::deinit(false);  // false = library bug: deinit(true) never resets initialized flag

    initialized = false;
    exitRequested = false;
    bcnLogDirty = false;
    bcnLogCount = 0;

    #if CYD_DEBUG
    Serial.println("[BEACON] Cleanup complete");
    #endif
}

}  // namespace BleBeacon

// ═══════════════════════════════════════════════════════════════════════════
// BLE SCAN IMPLEMENTATION - Bluetooth Device Scanner
// ═══════════════════════════════════════════════════════════════════════════

namespace BleScan {

#define MAX_VISIBLE_DEVICES 12
#define DEVICE_LINE_HEIGHT 16

static bool initialized = false;
static bool exitRequested = false;
static bool scanning = false;
static bool detailView = false;

static BLEScan* pBleScan = nullptr;
static BLEScanResults scanResults;

static int currentIndex = 0;
static int listStartIndex = 0;
static int deviceCount = 0;

// Icon bar - MATCHES ORIGINAL (2 icons: undo at x=210, back at x=10)
#define BSCAN_ICON_SIZE 16
#define BSCAN_ICON_NUM 2
static int bscanIconX[BSCAN_ICON_NUM] = {210, 10};
static int bscanIconY = ICON_BAR_Y;

// Draw icon bar - MATCHES ORIGINAL ESP32-DIV
static void drawBleScanUI() {
    tft.drawLine(0, ICON_BAR_TOP, tft.width(), ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(SCALE_X(140), ICON_BAR_Y, SCREEN_WIDTH - SCALE_X(140), ICON_BAR_H, HALEHOUND_GUNMETAL);
    tft.drawBitmap(bscanIconX[0], bscanIconY, bitmap_icon_undo, BSCAN_ICON_SIZE, BSCAN_ICON_SIZE, HALEHOUND_MAGENTA);
    tft.drawBitmap(bscanIconX[1], bscanIconY, bitmap_icon_go_back, BSCAN_ICON_SIZE, BSCAN_ICON_SIZE, HALEHOUND_MAGENTA);
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

