rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// Draw device list
static void drawDeviceList() {
    tft.fillRect(0, 37, SCREEN_WIDTH, SCREEN_HEIGHT - 37, HALEHOUND_BLACK);

    deviceCount = scanResults.getCount();

    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(5, 45);
    tft.print("BLE Devices: ");
    tft.print(deviceCount);

    if (deviceCount == 0) {
        tft.setCursor(10, 70);
        tft.print("No devices found");
        tft.setCursor(10, 85);
        tft.print("Press SELECT to scan");
        return;
    }

    int y = 60;
    for (int i = 0; i < MAX_VISIBLE_DEVICES && i + listStartIndex < deviceCount; i++) {
        int idx = i + listStartIndex;
        BLEAdvertisedDevice device = scanResults.getDevice(idx);

        String name;
        if (device.getName().length() > 0) {
            name = String(device.getName().c_str()).substring(0, 16);
        } else if (device.haveManufacturerData()) {
            std::string mfg = device.getManufacturerData();
            if (mfg.length() >= 2) {
                uint16_t cid = (uint8_t)mfg[0] | ((uint8_t)mfg[1] << 8);
                const char* cn = lookupCompanyName(cid);
                name = cn ? String("[") + cn + "]" : "Unknown";
            } else {
                name = "Unknown";
            }
        } else {
            name = "Unknown";
        }

        if (idx == currentIndex) {
            tft.fillRect(0, y - 2, SCREEN_WIDTH, DEVICE_LINE_HEIGHT, HALEHOUND_DARK);
            tft.setTextColor(HALEHOUND_HOTPINK);
            tft.setCursor(5, y);
            tft.print("> ");
        } else {
            tft.setTextColor(HALEHOUND_MAGENTA);
            tft.setCursor(5, y);
            tft.print("  ");
        }

        tft.setCursor(20, y);
        tft.print(name);

        tft.setCursor(SCREEN_WIDTH - 50, y);
        tft.print(device.getRSSI());
        tft.print("dB");

        y += DEVICE_LINE_HEIGHT;
    }

    tft.setTextColor(HALEHOUND_VIOLET);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("UP/DOWN=Nav SELECT=Details/Scan");
}

// Draw device details
static void drawDeviceDetails() {
    tft.fillRect(0, 37, SCREEN_WIDTH, SCREEN_HEIGHT - 37, HALEHOUND_BLACK);

    if (deviceCount == 0 || currentIndex >= deviceCount) return;

    BLEAdvertisedDevice device = scanResults.getDevice(currentIndex);

    String name;
    if (device.getName().length() > 0) {
        name = String(device.getName().c_str());
    } else if (device.haveManufacturerData()) {
        std::string mfg = device.getManufacturerData();
        if (mfg.length() >= 2) {
            uint16_t cid = (uint8_t)mfg[0] | ((uint8_t)mfg[1] << 8);
            const char* cn = lookupCompanyName(cid);
            name = cn ? String("[") + cn + " Device]" : "Unknown Device";
        } else {
            name = "Unknown Device";
        }
    } else {
        name = "Unknown Device";
    }
    String address = String(device.getAddress().toString().c_str());
    int rssi = device.getRSSI();
    int txPower = device.getTXPower();

    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(5, 45);
    tft.print("Device Details");

    tft.setTextColor(HALEHOUND_BRIGHT);
    int y = 65;

    tft.setCursor(10, y); tft.print("Name: "); tft.print(name.substring(0, 20));
    y += 18;
    tft.setCursor(10, y); tft.print("MAC: "); tft.print(address);
    y += 18;
    tft.setCursor(10, y); tft.print("RSSI: "); tft.print(rssi); tft.print(" dBm");
    y += 18;
    tft.setCursor(10, y); tft.print("TX Power: "); tft.print(txPower); tft.print(" dBm");
    y += 18;

    if (device.haveServiceUUID()) {
        tft.setCursor(10, y);
        tft.print("UUID: ");
        tft.print(String(device.getServiceUUID().toString().c_str()).substring(0, 20));
    } else {
        tft.setCursor(10, y);
        tft.print("No Service UUID");
    }
    y += 18;

    if (device.haveManufacturerData()) {
        tft.setCursor(10, y);
        tft.print("Has Manufacturer Data");
    } else {
        tft.setCursor(10, y);
        tft.print("No Manufacturer Data");
    }

    tft.setTextColor(HALEHOUND_VIOLET);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("BACK=Return to list");
}

// Show scanning animation
static void showScanning() {
    tft.fillRect(0, 37, SCREEN_WIDTH, SCREEN_HEIGHT - 37, HALEHOUND_BLACK);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, 50);
    tft.print("[*] Scanning for BLE devices...");
}

void startScan() {
    showScanning();
    scanning = true;

    scanResults = pBleScan->start(5, false);
    deviceCount = scanResults.getCount();
    currentIndex = 0;
    listStartIndex = 0;

    scanning = false;
    drawDeviceList();
}

void setup() {
    if (initialized) return;

    #if CYD_DEBUG
    Serial.println("[BLESCAN] Initializing...");
    #endif

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    drawBleScanUI();

    // Tear down WiFi before BLE init — frees ~50KB heap
    WiFi.mode(WIFI_OFF);
    delay(50);

    releaseClassicBtMemory();
    BLEDevice::init("");
    delay(150);  // BLE controller needs time after deinit/reinit cycle

    pBleScan = BLEDevice::getScan();
    if (!pBleScan) {
        Serial.println("[BLESCAN] ERROR: getScan() returned NULL");
        exitRequested = true;
        return;
    }
    pBleScan->setActiveScan(true);

    detailView = false;
    exitRequested = false;
    initialized = true;

    startScan();

    // Consume any lingering touch from menu selection — prevents
    // isBackButtonTapped() in .ino from immediately exiting
    waitForTouchRelease();

    #if CYD_DEBUG
    Serial.println("[BLESCAN] Ready");
    #endif
}

void loop() {
    if (!initialized) return;

    touchButtonsUpdate();

    // Icon bar touch handling - undo at x=210, back at x=10
    static unsigned long lastIconTap = 0;
    if (millis() - lastIconTap > 200) {
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty)) {
            if (ty >= ICON_BAR_Y && ty <= ICON_BAR_BOTTOM) {
                // Back icon at x=10-26
                if (tx >= 10 && tx < 26) {
                    if (detailView) {
                        detailView = false;
                        drawDeviceList();
                        waitForTouchRelease();  // Eat touch so .ino isBackButtonTapped() doesn't double-fire
                    } else {
                        exitRequested = true;
                    }
                    lastIconTap = millis();
                    return;
                }
                // Undo/Rescan icon at x=210-226
                else if (tx >= 210 && tx < 226) {
                    startScan();
                    lastIconTap = millis();
                    return;
                }
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (detailView) {
            detailView = false;
            drawDeviceList();
            waitForTouchRelease();  // Eat touch so .ino doesn't double-fire exit
        } else {
            exitRequested = true;
        }
        return;
    }

    if (detailView) {
        // Detail view - LEFT to go back
        if (buttonPressed(BTN_LEFT)) {
            detailView = false;
            drawDeviceList();
            waitForTouchRelease();
        }
    } else {
        // List view
        if (buttonPressed(BTN_UP)) {
            if (currentIndex > 0) {
                currentIndex--;
                if (currentIndex < listStartIndex) listStartIndex--;
                drawDeviceList();
            }
        }

        if (buttonPressed(BTN_DOWN)) {
            if (currentIndex < deviceCount - 1) {
                currentIndex++;
                if (currentIndex >= listStartIndex + MAX_VISIBLE_DEVICES) listStartIndex++;
                drawDeviceList();
            }
        }

        if (buttonPressed(BTN_RIGHT)) {
            if (deviceCount > 0) {
                detailView = true;
                drawDeviceDetails();
            }
        }

        if (buttonPressed(BTN_SELECT)) {
            if (deviceCount > 0 && !detailView) {
                detailView = true;
                drawDeviceDetails();
            } else {
                startScan();
            }
        }

        if (buttonPressed(BTN_LEFT)) {
            startScan();
        }

        // Touch to select device
        int touched = getTouchedMenuItem(60, DEVICE_LINE_HEIGHT, min(MAX_VISIBLE_DEVICES, deviceCount - listStartIndex));
        if (touched >= 0) {
            currentIndex = listStartIndex + touched;
            detailView = true;
            drawDeviceDetails();
        }
    }
}

