rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
int getDeviceCount() { return deviceCount; }
bool isScanning() { return scanning; }
bool isDetailView() { return detailView; }
bool isExitRequested() { return exitRequested; }

void cleanup() {
    if (pBleScan) pBleScan->stop();
    BLEDevice::deinit(false);  // false = keep BLE memory so reinit works
    initialized = false;
    exitRequested = false;

    // Restore WiFi for other modules
    WiFi.mode(WIFI_STA);

    #if CYD_DEBUG
    Serial.println("[BLESCAN] Cleanup complete");
    #endif
}

}  // namespace BleScan


// ═══════════════════════════════════════════════════════════════════════════
// AIRTAG DETECTOR - Apple FindMy Tracker Detection
// Scans BLE advertisements for Apple FindMy network devices:
//   - AirTags, FindMy accessories, OpenHaystack clones
//   - Detects manufacturer data: Company 0x004C, Type 0x12, Len 0x19
//   - Extracts battery level from status byte (bits 6-7)
//   - Tracks unique devices by MAC with proximity RSSI bars
//   - Auto-rescan every 5 seconds, alert flash on new tracker
// ═══════════════════════════════════════════════════════════════════════════

namespace AirTagDetect {

#define AT_MAX_TRACKERS    20
#define AT_MAX_VISIBLE     10
#define AT_LINE_HEIGHT     18
#define AT_SCAN_DURATION   4
#define AT_RESCAN_INTERVAL 5000
#define AT_ICON_SIZE       16

// Tracked device struct
struct TrackedTag {
    uint8_t mac[6];
    int rssi;
    uint8_t battery;      // 0=full, 1=medium, 2=low, 3=critical
    uint8_t statusByte;
    unsigned long firstSeen;
    unsigned long lastSeen;
    bool isNew;
};

static TrackedTag trackers[AT_MAX_TRACKERS];
static int trackerCount = 0;
static int currentIndex = 0;
static int listStartIndex = 0;

static bool initialized = false;
static bool exitRequested = false;
static bool scanning = false;
static bool detailView = false;
static bool alertFlash = false;
static unsigned long lastScanTime = 0;
static unsigned long alertStart = 0;
static int totalScans = 0;

static BLEScan* pAtScan = nullptr;

// ═══════════════════════════════════════════════════════════════════════════
// HELPERS
// ═══════════════════════════════════════════════════════════════════════════

static String macToStr(const uint8_t* mac) {
    char buf[18];
    snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return String(buf);
}

static const char* batteryStr(uint8_t level) {
    switch (level) {
        case 0: return "FULL";
        case 1: return "MED";
        case 2: return "LOW";
        case 3: return "CRIT";
        default: return "???";
    }
}

static uint16_t batteryColor(uint8_t level) {
    switch (level) {
        case 0: return HALEHOUND_GREEN;
        case 1: return HALEHOUND_MAGENTA;
        case 2: return HALEHOUND_HOTPINK;
        case 3: return 0xF800;  // Red
        default: return HALEHOUND_GUNMETAL;
    }
}

// Find existing tracker by MAC, returns index or -1
static int findTracker(const uint8_t* mac) {
    for (int i = 0; i < trackerCount; i++) {
        if (memcmp(trackers[i].mac, mac, 6) == 0) return i;
    }
    return -1;
}

// Add or update a tracked device
static bool addOrUpdateTracker(const uint8_t* mac, int rssi, uint8_t battery, uint8_t status) {
    int idx = findTracker(mac);
    if (idx >= 0) {
        // Update existing
        trackers[idx].rssi = rssi;
        trackers[idx].battery = battery;
        trackers[idx].statusByte = status;
        trackers[idx].lastSeen = millis();
        trackers[idx].isNew = false;
        return false;  // Not new
    }
    if (trackerCount >= AT_MAX_TRACKERS) return false;

    // Add new tracker
    memcpy(trackers[trackerCount].mac, mac, 6);
    trackers[trackerCount].rssi = rssi;
    trackers[trackerCount].battery = battery;
    trackers[trackerCount].statusByte = status;
    trackers[trackerCount].firstSeen = millis();
    trackers[trackerCount].lastSeen = millis();
    trackers[trackerCount].isNew = true;
    trackerCount++;
    return true;  // New tracker found
}

// Estimate distance from RSSI
static const char* proximityStr(int rssi) {
    if (rssi > -40) return "< 1m";
    if (rssi > -55) return "1-3m";
    if (rssi > -70) return "3-8m";
    if (rssi > -85) return "8-15m";
    return "> 15m";
}

// Draw RSSI bar (5 segments)
static void drawRssiBar(int x, int y, int rssi) {
    int bars = 0;
    if (rssi > -40) bars = 5;
    else if (rssi > -55) bars = 4;
    else if (rssi > -65) bars = 3;
    else if (rssi > -75) bars = 2;
    else if (rssi > -90) bars = 1;

    for (int i = 0; i < 5; i++) {
        int barH = 3 + i * 2;
        int barY = y + (12 - barH);
        uint16_t color = (i < bars) ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL;
        tft.fillRect(x + i * 4, barY, 3, barH, color);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// UI DRAWING
// ═══════════════════════════════════════════════════════════════════════════

static void drawIconBar() {
    tft.drawLine(0, 19, SCREEN_WIDTH, 19, HALEHOUND_MAGENTA);
    tft.fillRect(0, 20, SCREEN_WIDTH, 16, HALEHOUND_GUNMETAL);
    tft.drawBitmap(10, 20, bitmap_icon_go_back, AT_ICON_SIZE, AT_ICON_SIZE, HALEHOUND_MAGENTA);
    tft.drawBitmap(210, 20, bitmap_icon_undo, AT_ICON_SIZE, AT_ICON_SIZE, HALEHOUND_MAGENTA);
    tft.drawLine(0, 36, SCREEN_WIDTH, 36, HALEHOUND_HOTPINK);
}

static void drawTitle() {
    tft.drawLine(0, 38, SCREEN_WIDTH, 38, HALEHOUND_HOTPINK);
    drawGlitchTitle(58, "AIRTAG");
    tft.drawLine(0, 62, SCREEN_WIDTH, 62, HALEHOUND_HOTPINK);
}

static void drawTrackerList() {
    tft.fillRect(0, 63, SCREEN_WIDTH, SCREEN_HEIGHT - 63, HALEHOUND_BLACK);

    // Header line
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_VIOLET);
    tft.setCursor(5, 67);
    tft.printf("TRACKERS: %d", trackerCount);
    tft.setCursor(120, 67);
    tft.printf("SCANS: %d", totalScans);

    if (trackerCount == 0) {
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(10, 100);
        tft.print("No FindMy trackers detected");
        tft.setTextColor(HALEHOUND_GUNMETAL);
        tft.setCursor(10, 120);
        tft.print("Scanning for AirTags,");
        tft.setCursor(10, 135);
        tft.print("FindMy accessories...");

        // Scanning animation
        if (scanning) {
            static int dots = 0;
            dots = (dots + 1) % 4;
            tft.setTextColor(HALEHOUND_HOTPINK);
            tft.setCursor(10, 160);
            tft.print("[*] SCANNING");
            for (int d = 0; d < dots; d++) tft.print(".");
        }
        return;
    }

    int y = 80;
    for (int i = 0; i < AT_MAX_VISIBLE && i + listStartIndex < trackerCount; i++) {
        int idx = i + listStartIndex;
        TrackedTag& t = trackers[idx];

