rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
        if (idx == currentIndex) {
            tft.fillRect(0, y - 2, SCREEN_WIDTH, AT_LINE_HEIGHT, HALEHOUND_DARK);
        }

        // RSSI bars
        drawRssiBar(5, y, t.rssi);

        // MAC address (shortened)
        uint16_t textCol = (idx == currentIndex) ? HALEHOUND_HOTPINK : HALEHOUND_MAGENTA;
        tft.setTextColor(textCol);
        tft.setCursor(28, y + 2);
        char shortMac[12];
        snprintf(shortMac, sizeof(shortMac), "%02X:%02X:%02X",
                 t.mac[3], t.mac[4], t.mac[5]);
        tft.print(shortMac);

        // Battery
        tft.setTextColor(batteryColor(t.battery));
        tft.setCursor(88, y + 2);
        tft.print(batteryStr(t.battery));

        // RSSI value
        tft.setTextColor(HALEHOUND_VIOLET);
        tft.setCursor(125, y + 2);
        tft.printf("%ddB", t.rssi);

        // Proximity
        tft.setTextColor(HALEHOUND_BRIGHT);
        tft.setCursor(175, y + 2);
        tft.print(proximityStr(t.rssi));

        // New indicator
        if (t.isNew) {
            tft.fillCircle(SCREEN_WIDTH - 8, y + 5, 3, HALEHOUND_HOTPINK);
        }

        y += AT_LINE_HEIGHT;
    }

    // Footer
    tft.setTextColor(HALEHOUND_GUNMETAL);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("UP/DN=Nav SELECT=Details");
}

static void drawTrackerDetail() {
    tft.fillRect(0, 63, SCREEN_WIDTH, SCREEN_HEIGHT - 63, HALEHOUND_BLACK);

    if (trackerCount == 0 || currentIndex >= trackerCount) return;

    TrackedTag& t = trackers[currentIndex];
    int y = 72;

    // MAC
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("MAC: ");
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.print(macToStr(t.mac));
    y += 18;

    // Type
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Type: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    tft.print("Apple FindMy Tracker");
    y += 18;

    // RSSI + Proximity
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("RSSI: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    tft.printf("%d dBm  (%s)", t.rssi, proximityStr(t.rssi));
    y += 18;

    // Large proximity bar
    int barWidth = map(constrain(t.rssi, -100, -30), -100, -30, 5, 200);
    tft.fillRect(10, y, barWidth, 10, HALEHOUND_HOTPINK);
    tft.drawRect(10, y, 200, 10, HALEHOUND_VIOLET);
    y += 18;

    // Battery
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Battery: ");
    tft.setTextColor(batteryColor(t.battery));
    tft.print(batteryStr(t.battery));
    y += 18;

    // Status byte raw
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Status: ");
    tft.setTextColor(HALEHOUND_VIOLET);
    tft.printf("0x%02X", t.statusByte);
    y += 18;

    // Time tracking
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("First seen: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    unsigned long elapsed = (millis() - t.firstSeen) / 1000;
    if (elapsed < 60) {
        tft.printf("%lus ago", elapsed);
    } else {
        tft.printf("%lum %lus ago", elapsed / 60, elapsed % 60);
    }
    y += 18;

    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Last seen: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    unsigned long lastElapsed = (millis() - t.lastSeen) / 1000;
    tft.printf("%lus ago", lastElapsed);

    // Footer
    tft.setTextColor(HALEHOUND_GUNMETAL);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("BACK=Return to list");
}

static void drawAlertFlash() {
    if (!alertFlash) return;
    if (millis() - alertStart > 800) {
        alertFlash = false;
        return;
    }
    // Flash border
    bool on = ((millis() - alertStart) / 100) % 2 == 0;
    uint16_t color = on ? HALEHOUND_HOTPINK : HALEHOUND_BLACK;
    tft.drawRect(0, 63, SCREEN_WIDTH, 3, color);
    tft.drawRect(0, SCREEN_HEIGHT - 15, SCREEN_WIDTH, 3, color);
}

// ═══════════════════════════════════════════════════════════════════════════
// SCANNING
// ═══════════════════════════════════════════════════════════════════════════

static void processScanResults(BLEScanResults results) {
    int count = results.getCount();
    bool foundNew = false;

    for (int i = 0; i < count; i++) {
        BLEAdvertisedDevice device = results.getDevice(i);

        if (!device.haveManufacturerData()) continue;

        std::string mfgData = device.getManufacturerData();
        if (mfgData.length() < 4) continue;

        // Check for Apple company ID (0x004C) + FindMy type (0x12) + length (0x19)
        uint8_t compLow = (uint8_t)mfgData[0];
        uint8_t compHigh = (uint8_t)mfgData[1];
        uint8_t type = (uint8_t)mfgData[2];
        uint8_t len = (uint8_t)mfgData[3];

        if (compLow != 0x4C || compHigh != 0x00) continue;  // Not Apple
        if (type != 0x12 || len != 0x19) continue;           // Not FindMy

        // Extract battery from status byte (bits 6-7)
        uint8_t statusByte = (mfgData.length() > 4) ? (uint8_t)mfgData[4] : 0;
        uint8_t battery = (statusByte >> 6) & 0x03;

        // Get MAC
        uint8_t mac[6];
        memcpy(mac, *device.getAddress().getNative(), 6);

        if (addOrUpdateTracker(mac, device.getRSSI(), battery, statusByte)) {
            foundNew = true;

            #if CYD_DEBUG
            Serial.printf("[AIRTAG] NEW tracker: %s RSSI:%d BAT:%s\n",
                          macToStr(mac).c_str(), device.getRSSI(), batteryStr(battery));
            #endif
        }
    }

    if (foundNew) {
        alertFlash = true;
        alertStart = millis();
    }
}

static void runScan() {
    scanning = true;
    totalScans++;

    BLEScanResults results = pAtScan->start(AT_SCAN_DURATION, false);
    processScanResults(results);
    pAtScan->clearResults();

    scanning = false;
    lastScanTime = millis();
}

// ═══════════════════════════════════════════════════════════════════════════
// SETUP AND LOOP
// ═══════════════════════════════════════════════════════════════════════════

void setup() {
    if (initialized) return;

    #if CYD_DEBUG
    Serial.println("[AIRTAG] Initializing detector...");
    #endif

    trackerCount = 0;
    currentIndex = 0;
    listStartIndex = 0;
    totalScans = 0;
    exitRequested = false;
    detailView = false;
    alertFlash = false;

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    drawIconBar();
    drawTitle();

    // Init BLE
    releaseClassicBtMemory();
    BLEDevice::init("");
    delay(150);

