rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    pAtScan = BLEDevice::getScan();
    if (!pAtScan) {
        Serial.println("[AIRTAG] ERROR: getScan() returned NULL");
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setCursor(10, 100);
        tft.print("BLE INIT FAILED");
        exitRequested = true;
        return;
    }
    pAtScan->setActiveScan(false);  // Passive scan — don't alert the tracker
    pAtScan->setInterval(100);
    pAtScan->setWindow(99);

    initialized = true;

    // First scan
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, 100);
    tft.print("[*] Scanning for trackers...");
    runScan();
    drawTrackerList();

    #if CYD_DEBUG
    Serial.println("[AIRTAG] Detector ready");
    #endif
}

void loop() {
    if (!initialized) return;

    touchButtonsUpdate();

    // Icon bar touch
    static unsigned long lastIconTap = 0;
    if (millis() - lastIconTap > 200) {
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty)) {
            if (ty >= 20 && ty <= 36) {
                if (tx >= 10 && tx < 26) {
                    if (detailView) {
                        detailView = false;
                        drawTrackerList();
                    } else {
                        exitRequested = true;
                    }
                    lastIconTap = millis();
                    return;
                }
                else if (tx >= 210 && tx < 226) {
                    runScan();
                    if (!detailView) drawTrackerList();
                    lastIconTap = millis();
                    return;
                }
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (detailView) {
            detailView = false;
            drawTrackerList();
        } else {
            exitRequested = true;
        }
        return;
    }

    if (detailView) {
        if (buttonPressed(BTN_LEFT)) {
            detailView = false;
            drawTrackerList();
        }
    } else {
        if (buttonPressed(BTN_UP)) {
            if (currentIndex > 0) {
                currentIndex--;
                if (currentIndex < listStartIndex) listStartIndex--;
                drawTrackerList();
            }
        }

        if (buttonPressed(BTN_DOWN)) {
            if (currentIndex < trackerCount - 1) {
                currentIndex++;
                if (currentIndex >= listStartIndex + AT_MAX_VISIBLE) listStartIndex++;
                drawTrackerList();
            }
        }

        if (buttonPressed(BTN_RIGHT) || buttonPressed(BTN_SELECT)) {
            if (trackerCount > 0) {
                detailView = true;
                drawTrackerDetail();
            }
        }

        // Touch to select device
        int touched = getTouchedMenuItem(80, AT_LINE_HEIGHT, min(AT_MAX_VISIBLE, trackerCount - listStartIndex));
        if (touched >= 0) {
            currentIndex = listStartIndex + touched;
            detailView = true;
            drawTrackerDetail();
        }
    }

    // Auto-rescan
    if (!scanning && millis() - lastScanTime >= AT_RESCAN_INTERVAL) {
        runScan();
        if (!detailView) drawTrackerList();
    }

    // Alert flash animation
    drawAlertFlash();
}

bool isExitRequested() { return exitRequested; }

void cleanup() {
    if (pAtScan) pAtScan->stop();
    BLEDevice::deinit(false);
    initialized = false;
    exitRequested = false;
    trackerCount = 0;

    #if CYD_DEBUG
    Serial.println("[AIRTAG] Cleanup complete");
    #endif
}

}  // namespace AirTagDetect


// ═══════════════════════════════════════════════════════════════════════════
// LUNATIC FRINGE IMPLEMENTATION - Multi-Platform BLE Tracker Detection
// Detects: Google FMDN (0xFEAA), Samsung SmartTag (0xFD5A), Tile (0xFEED),
//          Chipolo (0xFE33), Apple AirTag (0x004C type 0x12)
// Verified signatures from Bluetooth SIG Assigned Numbers & Google FMDN Spec
// ═══════════════════════════════════════════════════════════════════════════

namespace LunaticFringe {

#define TD_MAX_TRACKERS    20
#define TD_MAX_VISIBLE     10
#define TD_LINE_HEIGHT     18
#define TD_SCAN_DURATION   4
#define TD_RESCAN_INTERVAL 5000
#define TD_ICON_SIZE       16

// Tracker type enum
enum TrackerType : uint8_t {
    TRACKER_GOOGLE_FMDN = 0,
    TRACKER_SAMSUNG_TAG,
    TRACKER_TILE,
    TRACKER_CHIPOLO,
    TRACKER_APPLE_AIRTAG,
    TRACKER_UNKNOWN
};

// Tracked device struct
struct TrackedDevice {
    uint8_t mac[6];
    int rssi;
    TrackerType type;
    uint8_t statusByte;
    unsigned long firstSeen;
    unsigned long lastSeen;
    bool isNew;
};

static TrackedDevice devices[TD_MAX_TRACKERS];
static int deviceCount = 0;
static int currentIndex = 0;
static int listStartIndex = 0;

static bool initialized = false;
static bool exitRequested = false;
static bool scanning = false;
static bool detailView = false;
static bool alertFlash = false;
static unsigned long lastScanTime = 0;
static unsigned long alertStart = 0;
static int totalScans = 0;

static BLEScan* pTdScan = nullptr;

// Service data UUIDs — BT SIG Assigned Numbers verified
static BLEUUID UUID_FMDN((uint16_t)0xFEAA);     // Google LLC
static BLEUUID UUID_SAMSUNG((uint16_t)0xFD5A);   // Samsung Electronics Co., Ltd.
static BLEUUID UUID_TILE((uint16_t)0xFEED);       // Tile, Inc.
static BLEUUID UUID_CHIPOLO((uint16_t)0xFE33);    // CHIPOLO d.o.o.

// ═══════════════════════════════════════════════════════════════════════════
// HELPERS
// ═══════════════════════════════════════════════════════════════════════════

static const char* typeStr(TrackerType t) {
    switch (t) {
        case TRACKER_GOOGLE_FMDN:  return "Google FMDN";
        case TRACKER_SAMSUNG_TAG:  return "Samsung SmartTag";
        case TRACKER_TILE:         return "Tile";
        case TRACKER_CHIPOLO:      return "Chipolo";
        case TRACKER_APPLE_AIRTAG: return "Apple AirTag";
        default:                   return "Unknown";
    }
}

static const char* typeShort(TrackerType t) {
    switch (t) {
        case TRACKER_GOOGLE_FMDN:  return "FMDN";
        case TRACKER_SAMSUNG_TAG:  return "SMRT";
        case TRACKER_TILE:         return "TILE";
        case TRACKER_CHIPOLO:      return "CHIP";
        case TRACKER_APPLE_AIRTAG: return "ATAG";
        default:                   return "????";
    }
}

static uint16_t typeColor(TrackerType t) {
    switch (t) {
        case TRACKER_GOOGLE_FMDN:  return HALEHOUND_GREEN;
        case TRACKER_SAMSUNG_TAG:  return HALEHOUND_VIOLET;
        case TRACKER_TILE:         return HALEHOUND_BRIGHT;
        case TRACKER_CHIPOLO:      return HALEHOUND_MAGENTA;
        case TRACKER_APPLE_AIRTAG: return HALEHOUND_HOTPINK;
        default:                   return HALEHOUND_GUNMETAL;
    }
}

static String tdMacToStr(const uint8_t* mac) {
    char buf[18];
    snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
             mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
    return String(buf);
}

// Find existing device by MAC, returns index or -1
static int findDevice(const uint8_t* mac) {
    for (int i = 0; i < deviceCount; i++) {
        if (memcmp(devices[i].mac, mac, 6) == 0) return i;
    }
    return -1;
}

// Add or update a tracked device
static bool addOrUpdateDevice(const uint8_t* mac, int rssi, TrackerType type, uint8_t status) {
    int idx = findDevice(mac);
    if (idx >= 0) {
        // Update existing
        devices[idx].rssi = rssi;
        devices[idx].lastSeen = millis();
        devices[idx].isNew = false;
        return false;  // Not new
    }
    if (deviceCount >= TD_MAX_TRACKERS) return false;

