rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Add new device
    memcpy(devices[deviceCount].mac, mac, 6);
    devices[deviceCount].rssi = rssi;
    devices[deviceCount].type = type;
    devices[deviceCount].statusByte = status;
    devices[deviceCount].firstSeen = millis();
    devices[deviceCount].lastSeen = millis();
    devices[deviceCount].isNew = true;
    deviceCount++;
    return true;  // New device found
}

// Estimate distance from RSSI
static const char* tdProximityStr(int rssi) {
    if (rssi > -40) return "< 1m";
    if (rssi > -55) return "1-3m";
    if (rssi > -70) return "3-8m";
    if (rssi > -85) return "8-15m";
    return "> 15m";
}

// Draw RSSI bar (5 segments)
static void tdDrawRssiBar(int x, int y, int rssi) {
    int bars = 0;
    if (rssi > -40) bars = 5;
    else if (rssi > -55) bars = 4;
    else if (rssi > -65) bars = 3;
    else if (rssi > -75) bars = 2;
    else if (rssi > -90) bars = 1;

    for (int i = 0; i < 5; i++) {
        int barH = 3 + i * 2;
        int barY = y + (12 - barH);
        uint16_t color = (i < bars) ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL;
        tft.fillRect(x + i * 4, barY, 3, barH, color);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// UI DRAWING
// ═══════════════════════════════════════════════════════════════════════════

static void tdDrawIconBar() {
    tft.drawLine(0, 19, SCREEN_WIDTH, 19, HALEHOUND_MAGENTA);
    tft.fillRect(0, 20, SCREEN_WIDTH, 16, HALEHOUND_GUNMETAL);
    tft.drawBitmap(10, 20, bitmap_icon_go_back, TD_ICON_SIZE, TD_ICON_SIZE, HALEHOUND_MAGENTA);
    tft.drawBitmap(210, 20, bitmap_icon_undo, TD_ICON_SIZE, TD_ICON_SIZE, HALEHOUND_MAGENTA);
    tft.drawLine(0, 36, SCREEN_WIDTH, 36, HALEHOUND_HOTPINK);
}

static void tdDrawTitle() {
    tft.drawLine(0, 38, SCREEN_WIDTH, 38, HALEHOUND_HOTPINK);
    drawGlitchTitle(50, "LUNATIC");
    drawGlitchStatus(66, "FRINGE", HALEHOUND_VIOLET);
    tft.drawLine(0, 72, SCREEN_WIDTH, 72, HALEHOUND_HOTPINK);
}

static void drawDeviceList() {
    tft.fillRect(0, 73, SCREEN_WIDTH, SCREEN_HEIGHT - 73, HALEHOUND_BLACK);

    // Header line
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_VIOLET);
    tft.setCursor(5, 77);
    tft.printf("FOUND: %d", deviceCount);
    tft.setCursor(120, 77);
    tft.printf("SCANS: %d", totalScans);

    if (deviceCount == 0) {
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(10, 100);
        tft.print("No trackers detected");
        tft.setTextColor(HALEHOUND_GUNMETAL);
        tft.setCursor(10, 120);
        tft.print("Scanning for Google, Samsung,");
        tft.setCursor(10, 135);
        tft.print("Tile, Chipolo, Apple...");

        // Scanning animation
        if (scanning) {
            static int dots = 0;
            dots = (dots + 1) % 4;
            tft.setTextColor(HALEHOUND_HOTPINK);
            tft.setCursor(10, 160);
            tft.print("[*] SCANNING");
            for (int d = 0; d < dots; d++) tft.print(".");
        }
        return;
    }

    int y = 80;
    for (int i = 0; i < TD_MAX_VISIBLE && i + listStartIndex < deviceCount; i++) {
        int idx = i + listStartIndex;
        TrackedDevice& d = devices[idx];

        if (idx == currentIndex) {
            tft.fillRect(0, y - 2, SCREEN_WIDTH, TD_LINE_HEIGHT, HALEHOUND_DARK);
        }

        // RSSI bars
        tdDrawRssiBar(5, y, d.rssi);

        // Type label (short)
        tft.setTextColor(typeColor(d.type));
        tft.setCursor(28, y + 2);
        tft.print(typeShort(d.type));

        // MAC address (shortened)
        uint16_t textCol = (idx == currentIndex) ? HALEHOUND_HOTPINK : HALEHOUND_MAGENTA;
        tft.setTextColor(textCol);
        tft.setCursor(64, y + 2);
        char shortMac[12];
        snprintf(shortMac, sizeof(shortMac), "%02X:%02X:%02X",
                 d.mac[3], d.mac[4], d.mac[5]);
        tft.print(shortMac);

        // RSSI value
        tft.setTextColor(HALEHOUND_VIOLET);
        tft.setCursor(125, y + 2);
        tft.printf("%ddB", d.rssi);

        // Proximity
        tft.setTextColor(HALEHOUND_BRIGHT);
        tft.setCursor(175, y + 2);
        tft.print(tdProximityStr(d.rssi));

        // New indicator
        if (d.isNew) {
            tft.fillCircle(SCREEN_WIDTH - 8, y + 5, 3, HALEHOUND_HOTPINK);
        }

        y += TD_LINE_HEIGHT;
    }

    // Footer
    tft.setTextColor(HALEHOUND_GUNMETAL);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("UP/DN=Nav SELECT=Details");
}

static void drawDeviceDetail() {
    tft.fillRect(0, 73, SCREEN_WIDTH, SCREEN_HEIGHT - 73, HALEHOUND_BLACK);

    if (deviceCount == 0 || currentIndex >= deviceCount) return;

    TrackedDevice& d = devices[currentIndex];
    int y = 82;

    // Type
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Type: ");
    tft.setTextColor(typeColor(d.type));
    tft.print(typeStr(d.type));
    y += 18;

    // MAC
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("MAC: ");
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.print(tdMacToStr(d.mac));
    y += 18;

    // RSSI + Proximity
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("RSSI: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    tft.printf("%d dBm  (%s)", d.rssi, tdProximityStr(d.rssi));
    y += 18;

    // Large proximity bar
    int barWidth = map(constrain(d.rssi, -100, -30), -100, -30, 5, 200);
    tft.fillRect(10, y, barWidth, 10, HALEHOUND_HOTPINK);
    tft.drawRect(10, y, 200, 10, HALEHOUND_VIOLET);
    y += 18;

    // Battery
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Battery: ");
    if (d.type == TRACKER_APPLE_AIRTAG) {
        // AirTag battery from status byte bits 6-7
        uint8_t bat = (d.statusByte >> 6) & 0x03;
        const char* batLabels[] = {"FULL", "MED", "LOW", "CRIT"};
        uint16_t batColors[] = {HALEHOUND_GREEN, HALEHOUND_MAGENTA, HALEHOUND_HOTPINK, (uint16_t)0xF800};
        tft.setTextColor(batColors[bat]);
        tft.print(batLabels[bat]);
    } else {
        tft.setTextColor(HALEHOUND_GUNMETAL);
        tft.print("N/A");
    }
    y += 18;

    // Status byte raw
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Status: ");
    tft.setTextColor(HALEHOUND_VIOLET);
    tft.printf("0x%02X", d.statusByte);
    y += 18;

    // Time tracking
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("First seen: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    unsigned long elapsed = (millis() - d.firstSeen) / 1000;
    if (elapsed < 60) {
        tft.printf("%lus ago", elapsed);
    } else {
        tft.printf("%lum %lus ago", elapsed / 60, elapsed % 60);
    }
    y += 18;

    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y);
    tft.print("Last seen: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    unsigned long lastElapsed = (millis() - d.lastSeen) / 1000;
    tft.printf("%lus ago", lastElapsed);

