rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Footer
    tft.setTextColor(HALEHOUND_GUNMETAL);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("BACK=Return to list");
}

static void tdDrawAlertFlash() {
    if (!alertFlash) return;
    if (millis() - alertStart > 800) {
        alertFlash = false;
        return;
    }
    // Flash border
    bool on = ((millis() - alertStart) / 100) % 2 == 0;
    uint16_t color = on ? HALEHOUND_HOTPINK : HALEHOUND_BLACK;
    tft.drawRect(0, 73, SCREEN_WIDTH, 3, color);
    tft.drawRect(0, SCREEN_HEIGHT - 15, SCREEN_WIDTH, 3, color);
}

// ═══════════════════════════════════════════════════════════════════════════
// SCANNING
// ═══════════════════════════════════════════════════════════════════════════

static void processScanResults(BLEScanResults results) {
    int count = results.getCount();
    bool foundNew = false;

    for (int i = 0; i < count; i++) {
        BLEAdvertisedDevice device = results.getDevice(i);

        uint8_t mac[6];
        memcpy(mac, *device.getAddress().getNative(), 6);
        int rssi = device.getRSSI();

        // Check service data for tracker UUIDs
        if (device.haveServiceData()) {
            BLEUUID sdUUID = device.getServiceDataUUID();
            std::string sd = device.getServiceData();

            // Google FMDN — UUID 0xFEAA, frame type 0x40 or 0x41
            if (sdUUID.equals(UUID_FMDN) && sd.length() >= 1) {
                uint8_t frameType = (uint8_t)sd[0];
                if (frameType == 0x40 || frameType == 0x41) {
                    if (addOrUpdateDevice(mac, rssi, TRACKER_GOOGLE_FMDN, frameType)) {
                        foundNew = true;
                        #if CYD_DEBUG
                        Serial.printf("[LUNATIC] NEW Google FMDN: %s RSSI:%d frame:0x%02X\n",
                                      tdMacToStr(mac).c_str(), rssi, frameType);
                        #endif
                    }
                    continue;
                }
            }

            // Samsung SmartTag — UUID 0xFD5A, byte 0 & 0xF8 == 0x10
            if (sdUUID.equals(UUID_SAMSUNG) && sd.length() >= 1) {
                uint8_t firstByte = (uint8_t)sd[0];
                if ((firstByte & 0xF8) == 0x10) {
                    if (addOrUpdateDevice(mac, rssi, TRACKER_SAMSUNG_TAG, firstByte)) {
                        foundNew = true;
                        #if CYD_DEBUG
                        Serial.printf("[LUNATIC] NEW Samsung SmartTag: %s RSSI:%d status:0x%02X\n",
                                      tdMacToStr(mac).c_str(), rssi, firstByte);
                        #endif
                    }
                    continue;
                }
            }

            // Tile — UUID 0xFEED, first bytes 0x02 0x00
            if (sdUUID.equals(UUID_TILE) && sd.length() >= 2) {
                if ((uint8_t)sd[0] == 0x02 && (uint8_t)sd[1] == 0x00) {
                    if (addOrUpdateDevice(mac, rssi, TRACKER_TILE, (uint8_t)sd[0])) {
                        foundNew = true;
                        #if CYD_DEBUG
                        Serial.printf("[LUNATIC] NEW Tile: %s RSSI:%d\n",
                                      tdMacToStr(mac).c_str(), rssi);
                        #endif
                    }
                    continue;
                }
            }

            // Chipolo — UUID 0xFE33, any service data present
            if (sdUUID.equals(UUID_CHIPOLO)) {
                uint8_t sb = (sd.length() > 0) ? (uint8_t)sd[0] : 0;
                if (addOrUpdateDevice(mac, rssi, TRACKER_CHIPOLO, sb)) {
                    foundNew = true;
                    #if CYD_DEBUG
                    Serial.printf("[LUNATIC] NEW Chipolo: %s RSSI:%d\n",
                                  tdMacToStr(mac).c_str(), rssi);
                    #endif
                }
                continue;
            }
        }

        // Apple AirTag — Manufacturer data 0x004C, type 0x12, len 0x19
        if (device.haveManufacturerData()) {
            std::string mfgData = device.getManufacturerData();
            if (mfgData.length() >= 4) {
                uint8_t compLow  = (uint8_t)mfgData[0];
                uint8_t compHigh = (uint8_t)mfgData[1];
                uint8_t type     = (uint8_t)mfgData[2];
                uint8_t len      = (uint8_t)mfgData[3];

                if (compLow == 0x4C && compHigh == 0x00 && type == 0x12 && len == 0x19) {
                    uint8_t statusByte = (mfgData.length() > 4) ? (uint8_t)mfgData[4] : 0;
                    if (addOrUpdateDevice(mac, rssi, TRACKER_APPLE_AIRTAG, statusByte)) {
                        foundNew = true;
                        #if CYD_DEBUG
                        Serial.printf("[LUNATIC] NEW Apple AirTag: %s RSSI:%d status:0x%02X\n",
                                      tdMacToStr(mac).c_str(), rssi, statusByte);
                        #endif
                    }
                }
            }
        }
    }

    if (foundNew) {
        alertFlash = true;
        alertStart = millis();
    }
}

static void tdRunScan() {
    scanning = true;
    totalScans++;

    BLEScanResults results = pTdScan->start(TD_SCAN_DURATION, false);
    processScanResults(results);
    pTdScan->clearResults();

    scanning = false;
    lastScanTime = millis();
}

// ═══════════════════════════════════════════════════════════════════════════
// SETUP AND LOOP
// ═══════════════════════════════════════════════════════════════════════════

void setup() {
    if (initialized) return;

    #if CYD_DEBUG
    Serial.println("[LUNATIC] Initializing multi-tracker detector...");
    #endif

    deviceCount = 0;
    currentIndex = 0;
    listStartIndex = 0;
    totalScans = 0;
    exitRequested = false;
    detailView = false;
    alertFlash = false;

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    tdDrawIconBar();
    tdDrawTitle();

    // Init BLE
    releaseClassicBtMemory();
    BLEDevice::init("");
    delay(150);

    pTdScan = BLEDevice::getScan();
    if (!pTdScan) {
        Serial.println("[LUNATIC] ERROR: getScan() returned NULL");
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setCursor(10, 100);
        tft.print("BLE INIT FAILED");
        exitRequested = true;
        return;
    }
    pTdScan->setActiveScan(true);  // Active scan for full advertisement data
    pTdScan->setInterval(100);
    pTdScan->setWindow(99);

    initialized = true;

    // First scan
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, 100);
    tft.print("[*] Scanning for trackers...");
    tdRunScan();
    drawDeviceList();

    #if CYD_DEBUG
    Serial.println("[LUNATIC] Multi-tracker detector ready");
    #endif
}

void loop() {
    if (!initialized) return;

