rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    touchButtonsUpdate();

    // Icon bar touch
    static unsigned long lastIconTap = 0;
    if (millis() - lastIconTap > 200) {
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty)) {
            if (ty >= 20 && ty <= 36) {
                if (tx >= 10 && tx < 26) {
                    if (detailView) {
                        detailView = false;
                        drawDeviceList();
                    } else {
                        exitRequested = true;
                    }
                    lastIconTap = millis();
                    return;
                }
                else if (tx >= 210 && tx < 226) {
                    tdRunScan();
                    if (!detailView) drawDeviceList();
                    lastIconTap = millis();
                    return;
                }
            }
        }
    }

    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (detailView) {
            detailView = false;
            drawDeviceList();
        } else {
            exitRequested = true;
        }
        return;
    }

    if (detailView) {
        if (buttonPressed(BTN_LEFT)) {
            detailView = false;
            drawDeviceList();
        }
    } else {
        if (buttonPressed(BTN_UP)) {
            if (currentIndex > 0) {
                currentIndex--;
                if (currentIndex < listStartIndex) listStartIndex--;
                drawDeviceList();
            }
        }

        if (buttonPressed(BTN_DOWN)) {
            if (currentIndex < deviceCount - 1) {
                currentIndex++;
                if (currentIndex >= listStartIndex + TD_MAX_VISIBLE) listStartIndex++;
                drawDeviceList();
            }
        }

        if (buttonPressed(BTN_RIGHT) || buttonPressed(BTN_SELECT)) {
            if (deviceCount > 0) {
                detailView = true;
                drawDeviceDetail();
            }
        }

        // Touch to select device
        int touched = getTouchedMenuItem(80, TD_LINE_HEIGHT, min(TD_MAX_VISIBLE, deviceCount - listStartIndex));
        if (touched >= 0) {
            currentIndex = listStartIndex + touched;
            detailView = true;
            drawDeviceDetail();
        }
    }

    // Auto-rescan
    if (!scanning && millis() - lastScanTime >= TD_RESCAN_INTERVAL) {
        tdRunScan();
        if (!detailView) drawDeviceList();
    }

    // Alert flash animation
    tdDrawAlertFlash();
}

bool isExitRequested() { return exitRequested; }

void cleanup() {
    if (pTdScan) pTdScan->stop();
    BLEDevice::deinit(false);
    initialized = false;
    exitRequested = false;
    deviceCount = 0;

    #if CYD_DEBUG
    Serial.println("[LUNATIC] Cleanup complete");
    #endif
}

}  // namespace LunaticFringe


// ═══════════════════════════════════════════════════════════════════════════
// BLE JAMMER IMPLEMENTATION - NRF24L01+PA+LNA Continuous Carrier Wave
// Targets Bluetooth 2.402-2.480 GHz band (79 channels)
// Uses same proven NRF24 technique as WLAN Jammer
// Modes: ALL CHANNELS | ADV ONLY (Ch37/38/39) | DATA ONLY
// ═══════════════════════════════════════════════════════════════════════════

namespace BleJammer {

// ═══════════════════════════════════════════════════════════════════════════
// BLE CHANNEL MAPPING
// ═══════════════════════════════════════════════════════════════════════════
// Bluetooth uses 79 x 1MHz channels: 2.402 - 2.480 GHz
// NRF24 channel N = 2400 + N MHz
// BT channel 0 (2402 MHz) = NRF24 channel 2
// BT channel 78 (2480 MHz) = NRF24 channel 80
//
// BLE Advertising channels (most effective targets):
//   Ch 37 = 2402 MHz = NRF24 ch 2
//   Ch 38 = 2426 MHz = NRF24 ch 26
//   Ch 39 = 2480 MHz = NRF24 ch 80
// ═══════════════════════════════════════════════════════════════════════════

#define BJ_BT_NRF_START    2     // BT channel 0 = NRF channel 2
#define BJ_BT_NRF_END      80    // BT channel 78 = NRF channel 80

// BLE Advertising channel NRF24 mappings (used by equalizer display markers)
static const uint8_t BJ_ADV_CHANNELS[] = {2, 26, 80};  // Ch37, Ch38, Ch39
#define BJ_ADV_COUNT 3

// ═══════════════════════════════════════════════════════════════════════════
// CHANNEL ARRAYS — Bruce firmware pattern (PROVEN WORKING ON AIRPODS)
// Bruce: startConstCarrier() once → setChannel() in tight loop = KILLS BLE
// We tried raw SPI, data flooding, CE toggling — all FAILED.
// Bruce's simple pattern WORKS. Don't overthink it.
// ═══════════════════════════════════════════════════════════════════════════

// BLE channels — NRF24 ch 2-41 (all 40 BLE data + advertising channels)
// This is what kills CONNECTED devices (AirPods, speakers, headphones)
static const uint8_t BJ_BLE_CHANNELS[] = {
     2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
    22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41
};
#define BJ_BLE_COUNT 40

// BLE Advertising Priority — Bruce firmware's exact channel set
// Targets ADV frequencies (2402/2426/2480 MHz) + adjacent channels for splash
static const uint8_t BJ_BLE_ADV_CHANNELS[] = {37, 38, 39, 1, 2, 3, 25, 26, 27, 79, 80, 81};
#define BJ_BLE_ADV_COUNT 12

// Full Bluetooth band — NRF24 ch 2-80 (all 79 BT channels)
static const uint8_t BJ_BT_CHANNELS[] = {
     2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21,
    22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41,
    42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61,
    62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80
};
#define BJ_BT_COUNT 79

// ADV KILL — ONLY the 3 BLE advertising channels (maximum focus)
// BLE adv ch 37 = 2402 MHz = NRF24 ch 2
// BLE adv ch 38 = 2426 MHz = NRF24 ch 26
// BLE adv ch 39 = 2480 MHz = NRF24 ch 80
// Each channel gets 33% of jammer time — nowhere to reconnect
static const uint8_t BJ_ADV_KILL_CHANNELS[] = {2, 26, 80};
#define BJ_ADV_KILL_COUNT 3

// Jamming modes
#define BJ_MODE_BLE      0    // BLE data+adv channels — kills connected devices
#define BJ_MODE_BLE_ADV  1    // BLE advertising priority — disrupts discovery/pairing
#define BJ_MODE_BT       2    // Full Bluetooth band — maximum coverage
#define BJ_MODE_ADV_KILL 3    // ADV KILL — 3 channels only, maximum range
#define BJ_MODE_COUNT    4
static const char* BJ_MODE_NAMES[] = {"BLE", "BLE ADV", "BLUETOOTH", "ADV KILL"};

