rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// Helper: check if NRF channel is a BLE advertising channel (for equalizer display)
static bool bjIsAdvChannel(int ch) {
    return (ch == 2 || ch == 26 || ch == 80);
}

// ═══════════════════════════════════════════════════════════════════════════
// UI DRAWING FUNCTIONS
// ═══════════════════════════════════════════════════════════════════════════

static void drawIconBar() {
    tft.drawLine(0, ICON_BAR_TOP, SCREEN_WIDTH, ICON_BAR_TOP, HALEHOUND_MAGENTA);
    tft.fillRect(0, ICON_BAR_Y, SCREEN_WIDTH, ICON_BAR_H, HALEHOUND_GUNMETAL);
    for (int i = 0; i < BJ_ICON_NUM; i++) {
        uint16_t color = HALEHOUND_MAGENTA;
        if (i == 1 && jamming) color = HALEHOUND_HOTPINK;   // Toggle icon hot when jamming
        if (i == 4 && jamming) color = HALEHOUND_HOTPINK;  // Antenna icon hot when jamming
        tft.drawBitmap(bjIconX[i], ICON_BAR_Y, bjIcons[i], BJ_ICON_SIZE, BJ_ICON_SIZE, color);
    }
    tft.drawLine(0, ICON_BAR_BOTTOM, SCREEN_WIDTH, ICON_BAR_BOTTOM, HALEHOUND_HOTPINK);
}

// Helper to draw centered FreeFont text (Proto Kill style)
static void bjDrawFreeFont(int y, const char* text, uint16_t color, const GFXfont* font) {
    tft.setFreeFont(font);
    tft.setTextColor(color, TFT_BLACK);
    int w = tft.textWidth(text);
    int x = (SCREEN_WIDTH - w) / 2;
    if (x < 0) x = 0;
    tft.setCursor(x, y);
    tft.print(text);
    tft.setFreeFont(NULL);
}

// Chromatic aberration / glitch text - corrupted hacker aesthetic
static void bjDrawGlitchText(int y, const char* text, const GFXfont* font) {
    tft.setFreeFont(font);
    int w = tft.textWidth(text);
    int x = (SCREEN_WIDTH - w) / 2;
    if (x < 0) x = 0;

    // Pass 1: Cyan ghost offset left-up
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(x - 1, y - 1);
    tft.print(text);

    // Pass 2: Hot pink ghost offset right-down
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(x + 1, y + 1);
    tft.print(text);

    // Pass 3: White main text on top
    tft.setTextColor(TFT_WHITE);
    tft.setCursor(x, y);
    tft.print(text);

    tft.setFreeFont(NULL);
}

static void drawBjMainUI() {
    // Clear main area
    tft.fillRect(0, 38, SCREEN_WIDTH, 115, TFT_BLACK);

    // Title line (Proto Kill style)
    tft.drawLine(0, 38, SCREEN_WIDTH, 38, HALEHOUND_HOTPINK);
    tft.setFreeFont(NULL);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(70, 45);
    tft.print("BLE JAMMER");
    tft.drawLine(0, 56, SCREEN_WIDTH, 56, HALEHOUND_HOTPINK);

    // Rounded frame for main content (Proto Kill style)
    tft.drawRoundRect(10, 60, CONTENT_INNER_W, 70, 8, HALEHOUND_VIOLET);
    tft.drawRoundRect(11, 61, CONTENT_INNER_W - 2, 68, 7, HALEHOUND_GUNMETAL);

    // Mode Name - Nosifer18pt with glitch effect
    tft.fillRect(15, 65, SCREEN_WIDTH - 30, 30, TFT_BLACK);
    bjDrawGlitchText(90, BJ_MODE_DISPLAY[currentMode], &Nosifer_Regular12pt7b);

    // Status - Nosifer12pt
    tft.fillRect(15, 100, SCREEN_WIDTH - 30, 25, TFT_BLACK);
    if (jamming) {
        bjDrawFreeFont(120, "JAMMING", HALEHOUND_HOTPINK, &Nosifer_Regular10pt7b);
    } else {
        bjDrawFreeFont(120, "STANDBY", HALEHOUND_GUNMETAL, &Nosifer_Regular10pt7b);
    }

    // Stats line - default font
    tft.setFreeFont(NULL);
    tft.fillRect(0, SCALE_Y(135), SCREEN_WIDTH, 15, TFT_BLACK);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(10, SCALE_Y(140));
    tft.printf("CH:%03d", currentNRFChannel);
    tft.setTextColor(jamming ? HALEHOUND_HOTPINK : HALEHOUND_VIOLET, TFT_BLACK);
    tft.setCursor(SCALE_X(80), SCALE_Y(140));
    tft.printf("CH#:%d", bjModes[currentMode].count);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(SCALE_X(170), SCALE_Y(140));
    tft.printf("HITS:%d", bjHitCount);

    // Separator before equalizer
    tft.drawLine(0, 152, SCREEN_WIDTH, 152, HALEHOUND_HOTPINK);
}

static void bjUpdateStatus() {
    // Fast partial update - content inside the frame only
    tft.fillRect(15, 65, SCREEN_WIDTH - 30, 60, TFT_BLACK);
    bjDrawGlitchText(90, BJ_MODE_DISPLAY[currentMode], &Nosifer_Regular12pt7b);
    if (jamming) {
        bjDrawFreeFont(120, "JAMMING", HALEHOUND_HOTPINK, &Nosifer_Regular10pt7b);
    } else {
        bjDrawFreeFont(120, "STANDBY", HALEHOUND_GUNMETAL, &Nosifer_Regular10pt7b);
    }
}

static void bjUpdateStats() {
    // Fast partial update - stats line only
    tft.setFreeFont(NULL);
    tft.setTextSize(1);
    tft.fillRect(10, SCALE_Y(140), 60, 10, TFT_BLACK);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(10, SCALE_Y(140));
    tft.printf("CH:%03d", currentNRFChannel);
    tft.fillRect(SCALE_X(80), SCALE_Y(140), 80, 10, TFT_BLACK);
    tft.setTextColor(jamming ? HALEHOUND_HOTPINK : HALEHOUND_VIOLET, TFT_BLACK);
    tft.setCursor(SCALE_X(80), SCALE_Y(140));
    tft.printf("CH#:%d", bjModes[currentMode].count);
    tft.fillRect(SCALE_X(170), SCALE_Y(140), 70, 10, TFT_BLACK);
    tft.setTextColor(HALEHOUND_MAGENTA, TFT_BLACK);
    tft.setCursor(SCALE_X(170), SCALE_Y(140));
    tft.printf("HITS:%d", bjHitCount);
}

// Forward declaration
static void drawAdvMarkers();

// ═══════════════════════════════════════════════════════════════════════════
// EQUALIZER HEAT LOGIC (matches WLAN/SubGHz Jammer pattern)
// ═══════════════════════════════════════════════════════════════════════════

static void updateChannelHeat() {
    if (!jamming) {
        // Decay all channels when not jamming
        for (int i = 0; i < BJ_NUM_BARS; i++) {
            if (channelHeat[i] > 0) {
                channelHeat[i] = channelHeat[i] / 2;  // Fast decay when stopped
            }
        }
        return;
    }

    if (currentMode == BJ_MODE_BLE || currentMode == BJ_MODE_BT) {
        // BLE/BT modes - band hopping, insane equalizer
        for (int i = 0; i < BJ_NUM_BARS; i++) {
            int dist = abs(i - currentNRFChannel);

            if (i == currentNRFChannel) {
                // Direct hit - MAX HEAT
                channelHeat[i] = 125;
            } else if (dist <= 6) {
                // Splash zone - strong heat with falloff
                int splash = 110 - (dist * 12);
                channelHeat[i] = (channelHeat[i] + splash) / 2;
            } else {
                // Background chaos - all bars dance randomly
                int chaos = 50 + random(40);
                channelHeat[i] = (channelHeat[i] + chaos) / 2;
            }
        }
    } else {
        // BLE ADV mode - focused attack on advertising channels
        for (int i = 0; i < BJ_NUM_BARS; i++) {
            bool isCurrentChannel = (i == currentNRFChannel);

            // Distance to nearest ADV channel
            int distToNearest = BJ_NUM_BARS;
            for (int a = 0; a < BJ_ADV_COUNT; a++) {
                int d = abs(i - (int)BJ_ADV_CHANNELS[a]);
                if (d < distToNearest) distToNearest = d;
            }

            if (isCurrentChannel) {
                // Currently being hit - MAX HEAT
                channelHeat[i] = 125;
            } else if (bjIsAdvChannel(i)) {
                // Other ADV channels stay warm
                int baseHeat = 70 + random(30);
                channelHeat[i] = (channelHeat[i] + baseHeat) / 2;
            } else if (distToNearest <= 4) {
                // Splash zone around ADV channels
                int splash = 60 - (distToNearest * 12);
                if (splash < 10) splash = 10;
                channelHeat[i] = (channelHeat[i] + splash) / 2;
            } else {
                // Background - subtle decay
                if (channelHeat[i] > 0) {
                    channelHeat[i] = (channelHeat[i] * 3) / 4;
                }
            }
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// EQUALIZER DISPLAY (85 skinny bars - matches WLAN/SubGHz Jammer)
// ═══════════════════════════════════════════════════════════════════════════

