rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
static void drawJammerDisplay() {
    // Update heat levels first
    updateChannelHeat();

    // Clear display area
    tft.fillRect(BJ_GRAPH_X, BJ_GRAPH_Y, BJ_GRAPH_WIDTH, BJ_GRAPH_HEIGHT, TFT_BLACK);

    // Draw frame
    tft.drawRect(BJ_GRAPH_X - 1, BJ_GRAPH_Y - 1, BJ_GRAPH_WIDTH + 2, BJ_GRAPH_HEIGHT + 2, HALEHOUND_MAGENTA);

    int maxBarH = BJ_GRAPH_HEIGHT - 25;

    if (!jamming) {
        // Check if any heat remains (for decay animation)
        bool hasHeat = false;
        for (int i = 0; i < BJ_NUM_BARS; i++) {
            if (channelHeat[i] > 3) { hasHeat = true; break; }
        }

        if (!hasHeat) {
            // Fully stopped - show standby bars
            for (int i = 0; i < BJ_NUM_BARS; i++) {
                int x = BJ_GRAPH_X + (i * BJ_GRAPH_WIDTH / BJ_NUM_BARS);
                int barH = 8 + (i % 5) * 2;  // Slight variation
                int barY = BJ_GRAPH_Y + BJ_GRAPH_HEIGHT - barH - 10;
                tft.drawFastVLine(x, barY, barH, HALEHOUND_GUNMETAL);
                tft.drawFastVLine(x + 1, barY, barH, HALEHOUND_GUNMETAL);
            }

            // Standby text
            tft.setTextColor(HALEHOUND_GUNMETAL, TFT_BLACK);
            tft.setTextSize(1);
            tft.setCursor(BJ_GRAPH_X + 85, BJ_GRAPH_Y + 5);
            tft.print("STANDBY");

            // ADV channel markers
            drawAdvMarkers();
            return;
        }
    }

    // ═══════════════════════════════════════════════════════════════════════
    // DRAW THE EQUALIZER - 85 skinny bars of FIRE!
    // ═══════════════════════════════════════════════════════════════════════
    for (int i = 0; i < BJ_NUM_BARS; i++) {
        int x = BJ_GRAPH_X + (i * BJ_GRAPH_WIDTH / BJ_NUM_BARS);
        uint8_t heat = channelHeat[i];

        // Bar height based on heat - MORE AGGRESSIVE scaling
        int barH = (heat * maxBarH) / 100;  // Taller bars!
        if (barH > maxBarH) barH = maxBarH;
        if (barH < 8) barH = 8;  // Higher minimum

        int barY = BJ_GRAPH_Y + BJ_GRAPH_HEIGHT - barH - 8;

        // Color based on heat - vibrant gradient from cyan to hot pink
        for (int y = 0; y < barH; y++) {
            float heightRatio = (float)y / (float)barH;
            float heatRatio = (float)heat / 125.0f;

            // More aggressive color gradient
            float ratio = heightRatio * (0.3f + heatRatio * 0.7f);
            if (ratio > 1.0f) ratio = 1.0f;

            // Cyan (0, 207, 255) -> Hot Pink (255, 28, 82)
            uint8_t r = (uint8_t)(ratio * 255);
            uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
            uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
            uint16_t color = tft.color565(r, g, b);

            tft.drawFastHLine(x, barY + barH - 1 - y, 2, color);
        }

        // Add glow effect at base for hot bars
        if (heat > 80) {
            tft.drawFastHLine(x, barY + barH, 2, HALEHOUND_HOTPINK);
            tft.drawFastHLine(x, barY + barH + 1, 2, tft.color565(128, 14, 41));
        }
    }

    // ADV channel markers
    drawAdvMarkers();

    // Current frequency display
    if (jamming) {
        tft.fillRect(BJ_GRAPH_X + 50, BJ_GRAPH_Y + 2, 140, 12, TFT_BLACK);
        tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
        tft.setTextSize(1);
        tft.setCursor(BJ_GRAPH_X + 55, BJ_GRAPH_Y + 3);
        tft.printf(">>> %d MHz <<<", 2400 + currentNRFChannel);
    }
}

// Draw BLE advertising channel markers below the equalizer bars
static void drawAdvMarkers() {
    int markerY = BJ_GRAPH_Y + BJ_GRAPH_HEIGHT - 8;

    // ADV37 = NRF ch 2 (bar 2)
    int x37 = BJ_GRAPH_X + (2 * BJ_GRAPH_WIDTH / BJ_NUM_BARS);
    // ADV38 = NRF ch 26 (bar 26)
    int x38 = BJ_GRAPH_X + (26 * BJ_GRAPH_WIDTH / BJ_NUM_BARS);
    // ADV39 = NRF ch 80 (bar 80)
    int x39 = BJ_GRAPH_X + (80 * BJ_GRAPH_WIDTH / BJ_NUM_BARS);

    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setTextSize(1);
    tft.setCursor(x37, markerY);
    tft.print("37");
    tft.setCursor(x38, markerY);
    tft.print("38");
    tft.setTextColor(HALEHOUND_VIOLET, TFT_BLACK);
    tft.setCursor(x39 - 4, markerY);
    tft.print("39");
}

// ═══════════════════════════════════════════════════════════════════════════
// SKULL ROWS - 3x8 with frequency-tracking red indicator
// Active frequency skull turns RED, adjacent skulls glow orange
// ═══════════════════════════════════════════════════════════════════════════

static void drawSkulls() {
    int skullStartX = 10;
    int skullSpacing = (SCREEN_WIDTH - 20) / BJ_SKULL_NUM;

    // Map current NRF channel (2-80) to skull position (0-7)
    int activeSkull = ((currentNRFChannel - BJ_BT_NRF_START) * BJ_SKULL_NUM) / (BJ_BT_NRF_END - BJ_BT_NRF_START + 1);
    if (activeSkull >= BJ_SKULL_NUM) activeSkull = BJ_SKULL_NUM - 1;
    if (activeSkull < 0) activeSkull = 0;

    for (int row = 0; row < BJ_SKULL_ROWS; row++) {
        int rowY = BJ_SKULL_Y + (row * BJ_SKULL_ROW_SPACING);

        for (int i = 0; i < BJ_SKULL_NUM; i++) {
            int x = skullStartX + (i * skullSpacing);
            tft.fillRect(x, rowY, 16, 16, TFT_BLACK);

            uint16_t color;
            if (jamming) {
                int dist = abs(i - activeSkull);

                if (dist == 0) {
                    // ACTIVE FREQUENCY SKULL - PULSING BRIGHT RED
                    int pulse = (skullFrame + (row * 2)) % 4;
                    uint8_t brightness = 180 + (pulse * 25);
                    color = tft.color565(brightness, 0, 0);
                } else if (dist == 1) {
                    // ADJACENT SKULLS - ORANGE/RED GLOW
                    int pulse = (skullFrame + i + (row * 3)) % 6;
                    uint8_t r = 200 + (pulse * 9);
                    uint8_t g = 40 + (pulse * 8);
                    color = tft.color565(r, g, 0);
                } else {
                    // Normal cyan-to-hot-pink wave for distant skulls
                    int phase = (skullFrame + i + (row * 3)) % 8;
                    if (phase < 4) {
                        float ratio = phase / 3.0f;
                        uint8_t r = (uint8_t)(ratio * 255);
                        uint8_t g = 207 - (uint8_t)(ratio * (207 - 28));
                        uint8_t b = 255 - (uint8_t)(ratio * (255 - 82));
                        color = tft.color565(r, g, b);
                    } else {
                        float ratio = (phase - 4) / 3.0f;
                        uint8_t r = 255 - (uint8_t)(ratio * 255);
                        uint8_t g = 28 + (uint8_t)(ratio * (207 - 28));
                        uint8_t b = 82 + (uint8_t)(ratio * (255 - 82));
                        color = tft.color565(r, g, b);
                    }
                }
            } else {
                color = HALEHOUND_GUNMETAL;  // Gray when inactive
            }

            tft.drawBitmap(x, rowY, bjSkulls[i], 16, 16, color);
        }

        // Status text next to skulls on first row only
        if (row == 0) {
            tft.fillRect(skullStartX + (BJ_SKULL_NUM * skullSpacing), rowY, 50, 16, TFT_BLACK);
            tft.setTextColor(jamming ? HALEHOUND_HOTPINK : HALEHOUND_GUNMETAL, TFT_BLACK);
            tft.setTextSize(1);
            tft.setCursor(skullStartX + (BJ_SKULL_NUM * skullSpacing) + 5, rowY + 4);
            tft.print(jamming ? "TX!" : "OFF");
        }
    }

    skullFrame++;
}

// ═══════════════════════════════════════════════════════════════════════════
// JAMMING CONTROL
// ═══════════════════════════════════════════════════════════════════════════

