rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
static void startJamming() {
    // ═══════════════════════════════════════════════════════════════════════
    // DUAL-CORE CONTINUOUS WAVE JAMMER
    // Core 0: FreeRTOS task owns ALL SPI + NRF24. startConstCarrier() for
    //         100% duty cycle continuous wave, setChannel() for tight hopping.
    // Core 1: Display animations at full speed (separate HSPI bus).
    // Core 1 NEVER touches NRF24 while jam task is running.
    // ═══════════════════════════════════════════════════════════════════════

    // Set shared state BEFORE launching task
    hopIndex = 0;
    currentNRFChannel = bjModes[currentMode].channels[0];
    bjHitCount = 0;
    bjJamMode = currentMode;
    bjJamTaskDone = false;
    jamming = true;

    // Launch jam task on core 0 — task handles ALL SPI/radio init on that core
    bjJamTaskRunning = true;
    xTaskCreatePinnedToCore(bjJamTask, "BleJam", 8192, NULL, 1, &bjJamTaskHandle, 0);

    Serial.printf("[BLEJAM] DUAL-CORE Started - Mode: %s, Channels: %d, Core0 task launched\n",
                  BJ_MODE_NAMES[currentMode], bjModes[currentMode].count);
}

static void stopJamming() {
    // Signal jam task to stop — task does its own radio cleanup on core 0
    bjJamTaskRunning = false;

    // Wait for task to finish cleanup (it powers down radio + releases SPI)
    if (bjJamTaskHandle) {
        unsigned long waitStart = millis();
        while (!bjJamTaskDone && (millis() - waitStart < 500)) {
            vTaskDelay(10 / portTICK_PERIOD_MS);
        }
        bjJamTaskHandle = NULL;
    }

    // Re-init SPI on core 1 for other modules (scanner, mousejacker, etc.)
    delay(2);
    SPI.begin(RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI, NRF24_CSN);
    nrf24Radio.begin();
    nrf24Radio.setPALevel(RF24_PA_MAX);
    nrf24Radio.setDataRate(RF24_2MBPS);
    nrf24Radio.setAutoAck(false);
    nrf24Radio.disableCRC();

    jamming = false;
    Serial.println("[BLEJAM] Stopped — core 0 task terminated, SPI restored to core 1");
}

static void nextMode() {
    currentMode = (currentMode + 1) % BJ_MODE_COUNT;
    hopIndex = 0;
    bjJamMode = currentMode;  // sync to jam task (volatile, task picks up next iteration)
}

static void prevMode() {
    currentMode = (currentMode - 1 + BJ_MODE_COUNT) % BJ_MODE_COUNT;
    hopIndex = 0;
    bjJamMode = currentMode;  // sync to jam task
}

// ═══════════════════════════════════════════════════════════════════════════
// SETUP
// ═══════════════════════════════════════════════════════════════════════════

void setup() {
    exitRequested = false;
    jamming = false;
    currentMode = BJ_MODE_BLE;    // Default BLE — kills connected AirPods/speakers
    currentNRFChannel = BJ_BT_NRF_START;
    hopIndex = 0;
    skullFrame = 0;
    bjHitCount = 0;
    memset(channelHeat, 0, sizeof(channelHeat));

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    drawIconBar();

    #if CYD_DEBUG
    Serial.println("[BLEJAM] Initializing BLE Jammer...");
    #endif

    nrf24ClaimSPI();
    if (!nrf24Radio.begin()) {
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setTextSize(2);
        drawCenteredText(100, "NRF24 NOT FOUND", HALEHOUND_HOTPINK, 2);
        tft.setTextSize(1);
        drawCenteredText(130, "Check wiring:", HALEHOUND_MAGENTA, 1);
        drawCenteredText(145, ("CE=GPIO" + String(NRF24_CE) + " CSN=GPIO" + String(NRF24_CSN)).c_str(), HALEHOUND_MAGENTA, 1);
        initialized = false;
        return;
    }

    // Max power, 2Mbps, no auto-ack, no CRC — maximum aggression
    nrf24Radio.setPALevel(RF24_PA_MAX);
    nrf24Radio.setDataRate(RF24_2MBPS);
    nrf24Radio.setAutoAck(false);
    nrf24Radio.disableCRC();

    Serial.printf("[BLEJAM] NRF24 INIT OK - isPVariant: %d, chipConnected: %d\n",
                  nrf24Radio.isPVariant(), nrf24Radio.isChipConnected());
    Serial.printf("[BLEJAM] CE=GPIO%d, CSN=GPIO%d, SPI: SCK=%d MISO=%d MOSI=%d\n",
                  NRF24_CE, NRF24_CSN, RADIO_SPI_SCK, RADIO_SPI_MISO, RADIO_SPI_MOSI);

    drawBjMainUI();
    drawJammerDisplay();
    drawSkulls();

    lastDisplayTime = millis();
    initialized = true;

    #if CYD_DEBUG
    Serial.println("[BLEJAM] NRF24 initialized - BLE Jammer ready");
    #endif
}

// ═══════════════════════════════════════════════════════════════════════════
// MAIN LOOP
// ═══════════════════════════════════════════════════════════════════════════

void loop() {
    if (!initialized) {
        // NRF24 not found - just check for exit
        touchButtonsUpdate();
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty) || buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
            exitRequested = true;
        }
        return;
    }

    touchButtonsUpdate();

    // ═══════════════════════════════════════════════════════════════════════
    // TOUCH HANDLING - with release detection (prevents repeat triggers)
    // Icons: Back=10, Toggle=60, PrevMode=105, NextMode=140, Antenna=180, Cycle=215
    // ═══════════════════════════════════════════════════════════════════════
    uint16_t tx, ty;
    if (getTouchPoint(&tx, &ty)) {
        // Icon bar area
        if (ty >= ICON_BAR_Y && ty <= (ICON_BAR_BOTTOM + 4)) {
            // Wait for touch release to prevent repeated triggers
            waitForTouchRelease();

            // Back icon (x=10)
            if (tx >= 5 && tx <= 30) {
                if (jamming) stopJamming();
                exitRequested = true;
                return;
            }
            // Toggle icon (x=60)
            else if (tx >= 50 && tx <= 80) {
                if (jamming) stopJamming(); else startJamming();
                drawIconBar();
                drawBjMainUI();
                return;
            }
            // Prev mode icon (x=105)
            else if (tx >= 95 && tx <= 125) {
                prevMode();
                drawBjMainUI();
                return;
            }
            // Next mode icon (x=140)
            else if (tx >= 130 && tx <= 160) {
                nextMode();
                drawBjMainUI();
                return;
            }
            // Antenna icon (x=180) - visual indicator only
            else if (tx >= 170 && tx <= 200) {
                return;
            }
            // Cycle mode icon at right edge
            else if (tx >= (tft.width() - 35) && tx <= tft.width()) {
                nextMode();
                drawBjMainUI();
                return;
            }
        }
    }

    // Hardware button fallback
    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (jamming) stopJamming();
        exitRequested = true;
        return;
    }

