rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // ═══════════════════════════════════════════════════════════════════════
    // JAMMING ENGINE — RUNS ON CORE 0 (FreeRTOS task)
    // The jam task (bjJamTask) handles all NRF24 operations on core 0
    // using VSPI. Display runs here on core 1 using HSPI. Zero conflict.
    // No burst/pause pattern needed — jammer is 100% duty cycle.
    // ═══════════════════════════════════════════════════════════════════════

    // ═══════════════════════════════════════════════════════════════════════
    // DISPLAY UPDATE — Full animations ALL the time!
    // Jammer runs on core 0 with its own SPI bus. Display doesn't affect it.
    // Equalizer, skulls, stats — everything runs at full speed.
    // ═══════════════════════════════════════════════════════════════════════
    unsigned long displayInterval = jamming ? 80 : 30;
    if (millis() - lastDisplayTime >= displayInterval) {
        bjUpdateStats();
        drawJammerDisplay();
        drawSkulls();
        lastDisplayTime = millis();
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// LIFECYCLE
// ═══════════════════════════════════════════════════════════════════════════

bool isExitRequested() {
    return exitRequested;
}

void cleanup() {
    // Kill jam task on core 0 first
    if (jamming || bjJamTaskRunning) {
        stopJamming();
    }
    nrf24Radio.powerDown();
    delay(2);
    nrf24ReleaseSPI();
    initialized = false;
    exitRequested = false;

    #if CYD_DEBUG
    Serial.println("[BLEJAM] Cleanup complete — core 0 task terminated");
    #endif
}

}  // namespace BleJammer


// ═══════════════════════════════════════════════════════════════════════════
// BLE SNIFFER IMPLEMENTATION - Continuous BLE Advertisement Monitor
// Passive scanning, live device tracking, vendor ID, type classification
// ═══════════════════════════════════════════════════════════════════════════

namespace BleSniffer {

// ── State ────────────────────────────────────────────────────────────────
static bool initialized = false;
static bool exitRequested = false;
static bool scanning = false;
static bool detailView = false;
static BLEScan* pBleScan = nullptr;

// ── Device storage ───────────────────────────────────────────────────────
struct BleDevice {
    uint8_t  mac[6];
    int8_t   rssi;
    int8_t   rssiMin;
    int8_t   rssiMax;
    char     name[17];       // 16 chars + null
    char     vendor[8];      // 7 chars + null
    uint16_t companyId;      // BT SIG company ID from manufacturer data (0xFFFF = none)
    uint32_t firstSeen;
    uint32_t lastSeen;
    uint16_t frameCount;
    uint8_t  mfgData[8];    // First 8 bytes of manufacturer data
    uint8_t  mfgDataLen;
    bool     hasName;
    bool     randomMAC;
};

#define BSNIFF_MAX_DEVICES 64
#define BSNIFF_MAX_VISIBLE 10
#define BSNIFF_ITEM_HEIGHT 20

static BleDevice devices[BSNIFF_MAX_DEVICES];
static int deviceCount = 0;
static int currentIndex = 0;
static int listStartIndex = 0;
static uint32_t scanStartTime = 0;
static unsigned long lastDisplayUpdate = 0;

// ── Filter modes ─────────────────────────────────────────────────────────
enum SniffFilter : uint8_t {
    FILT_ALL = 0,
    FILT_NAMED,
    FILT_APPLE,
    FILT_STRONG,
    FILT_COUNT
};
static SniffFilter currentFilter = FILT_ALL;
static const char* filterNames[] = {"ALL", "NAMED", "APPLE", "STRONG"};

// ── Volatile queue (callback → loop) ─────────────────────────────────────
static volatile bool pendingReady = false;
static uint8_t  pendingMAC[6];
static int8_t   pendingRSSI = 0;
static char     pendingName[17];
static bool     pendingHasName = false;
static uint8_t  pendingMfgData[8];
static uint8_t  pendingMfgLen = 0;

// ── Icon bar ─────────────────────────────────────────────────────────────
#define BSNIFF_ICON_SIZE 16
#define BSNIFF_ICON_NUM 6
static int bsniffIconX[BSNIFF_ICON_NUM] = {10, 55, 100, 135, 175, 215};
static const unsigned char* bsniffIcons[BSNIFF_ICON_NUM] = {
    bitmap_icon_go_back,     // 0: back
    bitmap_icon_start,       // 1: scan toggle
    bitmap_icon_LEFT,        // 2: filter left
    bitmap_icon_RIGHT,       // 3: filter right
    bitmap_icon_eye2,        // 4: detail view
    bitmap_icon_ble          // 5: BLE pulse indicator
};

// ── Forward declarations ─────────────────────────────────────────────────
static void drawIconBar();
static void drawHeader();
static void drawColumnHeaders();
static void drawDeviceList();
static void drawStatsLine();
static void drawButtonBar();
static void drawFullUI();
static void showDeviceDetail(int idx);
static void handleTouch();
static int  countFiltered();

// ═══════════════════════════════════════════════════════════════════════════
// OUI VENDOR LOOKUP (own copy — same entries as StationScan)
// ═══════════════════════════════════════════════════════════════════════════

static const char* lookupVendor(uint8_t* mac) {
    if (mac[0] & 0x02) return "Random";

    // Apple OUIs
    if (mac[0] == 0x00 && mac[1] == 0x1C && mac[2] == 0xB3) return "Apple";
    if (mac[0] == 0xF0 && mac[1] == 0x18 && mac[2] == 0x98) return "Apple";
    if (mac[0] == 0xAC && mac[1] == 0xDE && mac[2] == 0x48) return "Apple";
    if (mac[0] == 0xA4 && mac[1] == 0x83 && mac[2] == 0xE7) return "Apple";
    if (mac[0] == 0x3C && mac[1] == 0x06 && mac[2] == 0x30) return "Apple";
    if (mac[0] == 0x14 && mac[1] == 0x98 && mac[2] == 0x77) return "Apple";
    if (mac[0] == 0xDC && mac[1] == 0xA4 && mac[2] == 0xCA) return "Apple";
    if (mac[0] == 0x78 && mac[1] == 0x7B && mac[2] == 0x8A) return "Apple";
    if (mac[0] == 0x38 && mac[1] == 0xC9 && mac[2] == 0x86) return "Apple";
    if (mac[0] == 0xBC && mac[1] == 0x6C && mac[2] == 0x21) return "Apple";
    if (mac[0] == 0x40 && mac[1] == 0xB3 && mac[2] == 0x95) return "Apple";
    if (mac[0] == 0x6C && mac[1] == 0x94 && mac[2] == 0xF8) return "Apple";

    // Samsung
    if (mac[0] == 0x00 && mac[1] == 0x07 && mac[2] == 0xAB) return "Samsng";
    if (mac[0] == 0x00 && mac[1] == 0x16 && mac[2] == 0x6C) return "Samsng";
    if (mac[0] == 0x00 && mac[1] == 0x1A && mac[2] == 0x8A) return "Samsng";
    if (mac[0] == 0x00 && mac[1] == 0x26 && mac[2] == 0x37) return "Samsng";
    if (mac[0] == 0xE8 && mac[1] == 0x50 && mac[2] == 0x8B) return "Samsng";
    if (mac[0] == 0x8C && mac[1] == 0x77 && mac[2] == 0x12) return "Samsng";
    if (mac[0] == 0xCC && mac[1] == 0x07 && mac[2] == 0xAB) return "Samsng";

    // Google
    if (mac[0] == 0x3C && mac[1] == 0x5A && mac[2] == 0xB4) return "Google";
    if (mac[0] == 0xF4 && mac[1] == 0xF5 && mac[2] == 0xD8) return "Google";
    if (mac[0] == 0x54 && mac[1] == 0x60 && mac[2] == 0x09) return "Google";

    // Intel
    if (mac[0] == 0x00 && mac[1] == 0x1B && mac[2] == 0x21) return "Intel";
    if (mac[0] == 0x00 && mac[1] == 0x1E && mac[2] == 0x64) return "Intel";
    if (mac[0] == 0x68 && mac[1] == 0x05 && mac[2] == 0xCA) return "Intel";
    if (mac[0] == 0x3C && mac[1] == 0x6A && mac[2] == 0xA7) return "Intel";
    if (mac[0] == 0x80 && mac[1] == 0x86 && mac[2] == 0xF2) return "Intel";

