rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Espressif
    if (mac[0] == 0x24 && mac[1] == 0x0A && mac[2] == 0xC4) return "ESP";
    if (mac[0] == 0xA4 && mac[1] == 0xCF && mac[2] == 0x12) return "ESP";
    if (mac[0] == 0x30 && mac[1] == 0xAE && mac[2] == 0xA4) return "ESP";
    if (mac[0] == 0xEC && mac[1] == 0xFA && mac[2] == 0xBC) return "ESP";
    if (mac[0] == 0x08 && mac[1] == 0x3A && mac[2] == 0xF2) return "ESP";
    if (mac[0] == 0x88 && mac[1] == 0x57 && mac[2] == 0x21) return "ESP";

    // Microsoft
    if (mac[0] == 0x00 && mac[1] == 0x50 && mac[2] == 0xF2) return "Msft";
    if (mac[0] == 0x28 && mac[1] == 0x18 && mac[2] == 0x78) return "Msft";
    if (mac[0] == 0x7C && mac[1] == 0x1E && mac[2] == 0x52) return "Msft";

    // Qualcomm
    if (mac[0] == 0x00 && mac[1] == 0x03 && mac[2] == 0x7A) return "Qcomm";

    // Broadcom
    if (mac[0] == 0x00 && mac[1] == 0x10 && mac[2] == 0x18) return "Brcm";

    // Realtek
    if (mac[0] == 0x00 && mac[1] == 0xE0 && mac[2] == 0x4C) return "Rtk";

    // Huawei
    if (mac[0] == 0x00 && mac[1] == 0x9A && mac[2] == 0xCD) return "Huawei";
    if (mac[0] == 0x00 && mac[1] == 0x46 && mac[2] == 0x4B) return "Huawei";
    if (mac[0] == 0x48 && mac[1] == 0x46 && mac[2] == 0xC1) return "Huawei";

    return "???";
}

// ═══════════════════════════════════════════════════════════════════════════
// DEVICE LABEL (from ble_database.h company ID lookup)
// ═══════════════════════════════════════════════════════════════════════════

// Extract company ID from manufacturer data (first 2 bytes, little-endian)
static uint16_t extractCompanyId(uint8_t* mfgData, uint8_t len) {
    if (len < 2) return 0xFFFF;
    return mfgData[0] | (mfgData[1] << 8);
}

// Get display label for device — uses ble_database.h for 94 companies
static const char* devDisplayLabel(uint16_t companyId, bool hasName) {
    if (companyId != 0xFFFF) {
        const char* name = lookupCompanyName(companyId);
        if (name) return name;
    }
    return hasName ? "Named" : "---";
}

// ═══════════════════════════════════════════════════════════════════════════
// DEVICE MANAGEMENT
// ═══════════════════════════════════════════════════════════════════════════

static int findDevice(uint8_t* mac) {
    for (int i = 0; i < deviceCount; i++) {
        if (memcmp(devices[i].mac, mac, 6) == 0) return i;
    }
    return -1;
}

static void addOrUpdateDevice(uint8_t* mac, int8_t rssi, const char* name,
                               bool hasName, uint8_t* mfgData, uint8_t mfgLen) {
    uint32_t now = millis();
    int idx = findDevice(mac);

    if (idx >= 0) {
        // Update existing device
        BleDevice* d = &devices[idx];
        d->rssi = rssi;
        if (rssi < d->rssiMin) d->rssiMin = rssi;
        if (rssi > d->rssiMax) d->rssiMax = rssi;
        d->lastSeen = now;
        d->frameCount++;
        if (hasName && !d->hasName) {
            strncpy(d->name, name, 16);
            d->name[16] = '\0';
            d->hasName = true;
        }
        if (mfgLen > 0 && d->mfgDataLen == 0) {
            uint8_t copyLen = mfgLen > 8 ? 8 : mfgLen;
            memcpy(d->mfgData, mfgData, copyLen);
            d->mfgDataLen = copyLen;
            uint16_t cid = extractCompanyId(mfgData, mfgLen);
            if (cid != 0xFFFF) d->companyId = cid;
        }
        return;
    }

    // Add new device
    if (deviceCount >= BSNIFF_MAX_DEVICES) return;

    BleDevice* d = &devices[deviceCount];
    memcpy(d->mac, mac, 6);
    d->rssi = rssi;
    d->rssiMin = rssi;
    d->rssiMax = rssi;
    d->firstSeen = now;
    d->lastSeen = now;
    d->frameCount = 1;
    d->randomMAC = (mac[0] & 0x02) != 0;

    if (hasName) {
        strncpy(d->name, name, 16);
        d->name[16] = '\0';
        d->hasName = true;
    } else {
        d->name[0] = '\0';
        d->hasName = false;
    }

    strncpy(d->vendor, lookupVendor(mac), 7);
    d->vendor[7] = '\0';

    if (mfgLen > 0) {
        uint8_t copyLen = mfgLen > 8 ? 8 : mfgLen;
        memcpy(d->mfgData, mfgData, copyLen);
        d->mfgDataLen = copyLen;
        d->companyId = extractCompanyId(mfgData, mfgLen);
    } else {
        d->mfgDataLen = 0;
        d->companyId = 0xFFFF;
    }

    deviceCount++;

    #if CYD_DEBUG
    Serial.printf("[BSNIFF] +DEV #%d %02X:%02X:%02X:%02X:%02X:%02X %ddBm %s %s\n",
                  deviceCount, mac[0], mac[1], mac[2], mac[3], mac[4], mac[5],
                  rssi, d->vendor, devDisplayLabel(d->companyId, d->hasName));
    #endif
}

// ── Filter check ─────────────────────────────────────────────────────────
static bool passesFilter(BleDevice* d) {
    switch (currentFilter) {
        case FILT_NAMED:  return d->hasName;
        case FILT_APPLE:  return d->companyId == 0x004C;  // Apple BT SIG company ID
        case FILT_STRONG: return d->rssi > -60;
        default:          return true;
    }
}

static int countFiltered() {
    if (currentFilter == FILT_ALL) return deviceCount;
    int count = 0;
    for (int i = 0; i < deviceCount; i++) {
        if (passesFilter(&devices[i])) count++;
    }
    return count;
}

// ═══════════════════════════════════════════════════════════════════════════
// BLE SCAN CALLBACKS
// ═══════════════════════════════════════════════════════════════════════════

class SnifferCallbacks : public BLEAdvertisedDeviceCallbacks {
    void onResult(BLEAdvertisedDevice advertisedDevice) override {
        if (pendingReady) return;  // Queue full, skip this frame

        // Copy MAC
        const uint8_t* addr = *advertisedDevice.getAddress().getNative();
        memcpy(pendingMAC, addr, 6);
        pendingRSSI = advertisedDevice.getRSSI();

        // Copy name
        if (advertisedDevice.haveName() && advertisedDevice.getName().length() > 0) {
            strncpy(pendingName, advertisedDevice.getName().c_str(), 16);
            pendingName[16] = '\0';
            pendingHasName = true;
        } else {
            pendingName[0] = '\0';
            pendingHasName = false;
        }

        // Copy manufacturer data
        if (advertisedDevice.haveManufacturerData()) {
            std::string mfg = advertisedDevice.getManufacturerData();
            pendingMfgLen = mfg.length() > 8 ? 8 : mfg.length();
            memcpy(pendingMfgData, mfg.data(), pendingMfgLen);
        } else {
            pendingMfgLen = 0;
        }

