rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
        pendingReady = true;
    }
};

static SnifferCallbacks snifferCB;

// Scan completion callback — restart for continuous scanning
static void scanCompleteCallback(BLEScanResults results) {
    if (scanning && pBleScan) {
        // is_continue = false → clears BLE library's internal device map to prevent heap exhaustion
        pBleScan->start(5, scanCompleteCallback, false);
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// UI DRAWING
// ═══════════════════════════════════════════════════════════════════════════

static void drawIconBar() {
    tft.drawLine(0, 19, SCREEN_WIDTH, 19, HALEHOUND_MAGENTA);
    tft.fillRect(0, 20, SCREEN_WIDTH, 16, HALEHOUND_GUNMETAL);
    for (int i = 0; i < BSNIFF_ICON_NUM; i++) {
        uint16_t color = HALEHOUND_MAGENTA;
        // Use HALEHOUND_MAGENTA (Electric Blue 0x041F) for active — CYAN and HOTPINK are same color (0xF81F)
        if (i == 1 && scanning) color = HALEHOUND_MAGENTA;    // Scan toggle ELECTRIC BLUE when active
        if (i == 1 && !scanning) color = HALEHOUND_GUNMETAL;  // Scan toggle dim when stopped
        if (i == 5 && scanning) color = HALEHOUND_MAGENTA;    // BLE pulse ELECTRIC BLUE when active
        if (i == 5 && !scanning) color = HALEHOUND_GUNMETAL;  // BLE pulse dim when stopped
        tft.drawBitmap(bsniffIconX[i], 20, bsniffIcons[i], BSNIFF_ICON_SIZE, BSNIFF_ICON_SIZE, color);
    }
    tft.drawLine(0, 36, SCREEN_WIDTH, 36, HALEHOUND_HOTPINK);

    // Scan status text next to play icon
    tft.setTextSize(1);
    tft.fillRect(35, 22, 18, 10, HALEHOUND_GUNMETAL);
    if (scanning) {
        tft.setTextColor(HALEHOUND_MAGENTA, HALEHOUND_GUNMETAL);
        tft.setCursor(35, 23);
        tft.print("ON");
    } else {
        tft.setTextColor(HALEHOUND_GUNMETAL, HALEHOUND_GUNMETAL);
    }
}

static void drawHeader() {
    tft.fillRect(0, 38, SCREEN_WIDTH, 20, HALEHOUND_BLACK);
    drawGlitchText(55, "BLE SNIFF", &Nosifer_Regular10pt7b);

    // Device count + filter name on right side
    tft.setFreeFont(NULL);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA, HALEHOUND_BLACK);
    tft.setCursor(5, 42);
    int filtered = countFiltered();
    tft.printf("%d/%d", filtered, deviceCount);
    tft.setTextColor(HALEHOUND_VIOLET, HALEHOUND_BLACK);
    tft.setCursor(195, 42);
    tft.print(filterNames[currentFilter]);
}

static void drawColumnHeaders() {
    tft.fillRect(0, 58, SCREEN_WIDTH, 14, HALEHOUND_DARK);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(5, 60);
    tft.print("MAC");
    tft.setCursor(80, 60);
    tft.print("dB");
    tft.setCursor(115, 60);
    tft.print("TYPE");
    tft.setCursor(170, 60);
    tft.print("VENDOR");
}

static void drawDeviceList() {
    tft.fillRect(0, 74, SCREEN_WIDTH, 199, HALEHOUND_BLACK);

    if (deviceCount == 0) {
        tft.setTextColor(HALEHOUND_GUNMETAL);
        tft.setTextSize(1);
        tft.setCursor(40, 140);
        tft.print("Scanning for devices...");
        return;
    }

    uint32_t now = millis();
    int y = 74;
    int visibleIdx = 0;
    int drawn = 0;
    int skipped = 0;

    for (int i = 0; i < deviceCount && drawn < BSNIFF_MAX_VISIBLE; i++) {
        BleDevice* d = &devices[i];
        if (!passesFilter(d)) continue;

        // Pagination: skip items before listStartIndex
        if (skipped < listStartIndex) {
            skipped++;
            continue;
        }

        uint32_t age = now - d->lastSeen;

        // Color coding
        uint16_t rowColor;
        if (visibleIdx + listStartIndex == currentIndex) {
            rowColor = HALEHOUND_BRIGHT;           // Highlighted/selected
        } else if (age < 5000 && d->hasName) {
            rowColor = TFT_WHITE;                  // Recent + named
        } else if (age < 5000) {
            rowColor = HALEHOUND_MAGENTA;             // Recent
        } else if (d->companyId != 0xFFFF && lookupCompanyName(d->companyId) != nullptr) {
            rowColor = HALEHOUND_VIOLET;           // Known manufacturer type
        } else if (age > 30000) {
            rowColor = HALEHOUND_GUNMETAL;         // Stale
        } else {
            rowColor = HALEHOUND_MAGENTA;
        }

        // Highlight selected row background
        if (visibleIdx + listStartIndex == currentIndex) {
            tft.fillRect(0, y, SCREEN_WIDTH, BSNIFF_ITEM_HEIGHT - 2, HALEHOUND_DARK);
        }

        tft.setTextColor(rowColor);
        tft.setTextSize(1);

        // MAC (last 3 octets)
        char macStr[10];
        snprintf(macStr, sizeof(macStr), "%02X:%02X:%02X",
                 d->mac[3], d->mac[4], d->mac[5]);
        tft.setCursor(5, y + 4);
        tft.print(macStr);

        // RSSI
        tft.setCursor(80, y + 4);
        tft.printf("%d", d->rssi);

        // Type (company name from ble_database.h)
        tft.setCursor(115, y + 4);
        tft.print(devDisplayLabel(d->companyId, d->hasName));

        // Vendor
        tft.setCursor(170, y + 4);
        tft.print(d->vendor);

        // Frame count indicator (small dot for active devices)
        if (d->frameCount > 5 && age < 10000) {
            tft.fillCircle(SCREEN_WIDTH - 5, y + 8, 2, HALEHOUND_HOTPINK);
        }

        y += BSNIFF_ITEM_HEIGHT;
        drawn++;
        visibleIdx++;
    }
}

static void drawStatsLine() {
    tft.fillRect(0, 273, SCREEN_WIDTH, 10, HALEHOUND_BLACK);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA, HALEHOUND_BLACK);

    int filtered = countFiltered();
    uint32_t elapsed = (millis() - scanStartTime) / 1000;
    uint32_t mins = elapsed / 60;
    uint32_t secs = elapsed % 60;

    tft.setCursor(5, 274);
    tft.printf("T:%d F:%d", deviceCount, filtered);

    tft.setTextColor(HALEHOUND_VIOLET, HALEHOUND_BLACK);
    tft.setCursor(160, 274);
    tft.printf("%02d:%02d", mins, secs);

    tft.fillRect(200, 274, 40, 8, HALEHOUND_BLACK);
    if (scanning) {
        tft.setTextColor(HALEHOUND_MAGENTA, HALEHOUND_BLACK);
        tft.setCursor(210, 274);
        tft.print("LIVE");
    } else {
        tft.setTextColor(HALEHOUND_GUNMETAL, HALEHOUND_BLACK);
        tft.setCursor(200, 274);
        tft.print("PAUSE");
    }
}

static void drawButtonBar() {
    tft.fillRect(0, 283, SCREEN_WIDTH, 37, HALEHOUND_GUNMETAL);

    // BACK button (x=5-42)
    tft.fillRect(5, 288, 37, 25, HALEHOUND_DARK);
    tft.drawRect(5, 288, 37, 25, HALEHOUND_MAGENTA);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setTextSize(1);
    tft.setCursor(8, 296);
    tft.print("BACK");

    // INFO button (x=47-82)
    uint16_t infoColor = (deviceCount > 0) ? HALEHOUND_MAGENTA : HALEHOUND_GUNMETAL;
    tft.fillRect(47, 288, 35, 25, HALEHOUND_DARK);
    tft.drawRect(47, 288, 35, 25, infoColor);
    tft.setTextColor(infoColor);
    tft.setCursor(52, 296);
    tft.print("INFO");

    // PREV button (x=87-117)
    uint16_t prevColor = (listStartIndex > 0) ? HALEHOUND_MAGENTA : HALEHOUND_GUNMETAL;
    tft.fillRect(87, 288, 30, 25, HALEHOUND_DARK);
    tft.drawRect(87, 288, 30, 25, prevColor);
    tft.setTextColor(prevColor);
    tft.setCursor(92, 296);
    tft.print("PRV");

    // Page indicator (x=120-160)
    int filtered = countFiltered();
    int totalPages = (filtered + BSNIFF_MAX_VISIBLE - 1) / BSNIFF_MAX_VISIBLE;
    if (totalPages < 1) totalPages = 1;
    int curPage = (listStartIndex / BSNIFF_MAX_VISIBLE) + 1;
    tft.fillRect(120, 288, 40, 25, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(127, 296);
    tft.printf("%d/%d", curPage, totalPages);

    // NEXT button (x=163-193)
    uint16_t nextColor = (listStartIndex + BSNIFF_MAX_VISIBLE < filtered) ? HALEHOUND_MAGENTA : HALEHOUND_GUNMETAL;
    tft.fillRect(163, 288, 30, 25, HALEHOUND_DARK);
    tft.drawRect(163, 288, 30, 25, nextColor);
    tft.setTextColor(nextColor);
    tft.setCursor(168, 296);
    tft.print("NXT");

