rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // CLR button (x=198-233)
    tft.fillRect(198, 288, 35, 25, HALEHOUND_DARK);
    tft.drawRect(198, 288, 35, 25, HALEHOUND_HOTPINK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(205, 296);
    tft.print("CLR");
}

static void drawFullUI() {
    drawIconBar();
    drawHeader();
    drawColumnHeaders();
    drawDeviceList();
    drawStatsLine();
    drawButtonBar();
}

// ═══════════════════════════════════════════════════════════════════════════
// DETAIL VIEW (popup overlay)
// ═══════════════════════════════════════════════════════════════════════════

static void showDeviceDetail(int idx) {
    // Find the actual device index through the filter
    int filtIdx = 0;
    int realIdx = -1;
    for (int i = 0; i < deviceCount; i++) {
        if (!passesFilter(&devices[i])) continue;
        if (filtIdx == idx) { realIdx = i; break; }
        filtIdx++;
    }
    if (realIdx < 0 || realIdx >= deviceCount) return;

    BleDevice* d = &devices[realIdx];
    detailView = true;

    // Draw overlay
    tft.fillRect(10, 40, tft.width() - 20, tft.height() - 80, HALEHOUND_BLACK);
    tft.drawRect(10, 40, tft.width() - 20, tft.height() - 80, HALEHOUND_HOTPINK);
    tft.drawRect(11, 41, tft.width() - 22, tft.height() - 82, HALEHOUND_VIOLET);

    int y = 52;
    tft.setTextSize(1);

    // Name
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("Name: ");
    tft.setTextColor(TFT_WHITE);
    tft.print(d->hasName ? d->name : "(none)");
    y += 16;

    // Full MAC
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("MAC: ");
    tft.setTextColor(HALEHOUND_MAGENTA);
    char fullMac[18];
    snprintf(fullMac, sizeof(fullMac), "%02X:%02X:%02X:%02X:%02X:%02X",
             d->mac[0], d->mac[1], d->mac[2], d->mac[3], d->mac[4], d->mac[5]);
    tft.print(fullMac);
    y += 16;

    // Random MAC flag
    if (d->randomMAC) {
        tft.setTextColor(HALEHOUND_VIOLET);
        tft.setCursor(18, y);
        tft.print("(Locally Administered / Random)");
        y += 14;
    }

    // Type
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("Type: ");
    tft.setTextColor(HALEHOUND_BRIGHT);
    tft.print(devDisplayLabel(d->companyId, d->hasName));
    y += 16;

    // Vendor
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("Vendor: ");
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.print(d->vendor);
    y += 16;

    // RSSI current / min / max
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("RSSI: ");
    tft.setTextColor(TFT_WHITE);
    tft.printf("%d dBm", d->rssi);
    tft.setTextColor(HALEHOUND_GUNMETAL);
    tft.printf(" (%d/%d)", d->rssiMin, d->rssiMax);
    y += 16;

    // Frame count
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("Frames: ");
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.print(d->frameCount);
    y += 16;

    // First/Last seen
    uint32_t now = millis();
    uint32_t firstAge = (now - d->firstSeen) / 1000;
    uint32_t lastAge = (now - d->lastSeen) / 1000;

    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(18, y);
    tft.print("First: ");
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.printf("%ds ago", firstAge);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.print(" Last: ");
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.printf("%ds", lastAge);
    y += 16;

    // Manufacturer data hex dump
    if (d->mfgDataLen > 0) {
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setCursor(18, y);
        tft.print("MfgData: ");
        tft.setTextColor(HALEHOUND_VIOLET);
        for (int i = 0; i < d->mfgDataLen; i++) {
            tft.printf("%02X ", d->mfgData[i]);
        }
        y += 16;
    }

    // Close button
    y = 260;
    tft.fillRect(85, y, 70, 18, HALEHOUND_DARK);
    tft.drawRect(85, y, 70, 18, HALEHOUND_MAGENTA);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(100, y + 4);
    tft.print("CLOSE");
}

// ═══════════════════════════════════════════════════════════════════════════
// TOUCH HANDLING
// ═══════════════════════════════════════════════════════════════════════════

// Touch-release tracking — prevents held finger from firing multiple actions
static bool waitForRelease = false;

static void handleTouch() {
    static unsigned long lastTap = 0;

    uint16_t tx, ty;
    bool touching = getTouchPoint(&tx, &ty);

    // Wait for finger to lift after any view-changing action
    if (waitForRelease) {
        if (!touching) waitForRelease = false;
        return;
    }

    if (!touching) return;
    if (millis() - lastTap < 400) return;  // 400ms debounce — CYD touch needs firm timing
    lastTap = millis();

    // ── Detail view: ONLY close via CLOSE button or back icon ────────────
    if (detailView) {
        // CLOSE button (x=85-155, y=255-280)
        if (ty >= 255 && ty <= 280 && tx >= 80 && tx <= 160) {
            detailView = false;
            waitForRelease = true;
            drawFullUI();
            return;
        }
        // Back icon in icon bar (x=10-26, y=20-36)
        if (ty >= 20 && ty <= 36 && tx >= 10 && tx < 30) {
            detailView = false;
            waitForRelease = true;
            drawFullUI();
            return;
        }
        // All other touches in detail view are ignored
        return;
    }

    // ── Icon bar (y=20-36) ───────────────────────────────────────────────
    if (ty >= 20 && ty <= 36) {
        for (int i = 0; i < BSNIFF_ICON_NUM; i++) {
            if (tx >= bsniffIconX[i] && tx < bsniffIconX[i] + BSNIFF_ICON_SIZE + 10) {
                switch (i) {
                    case 0:  // Back
                        exitRequested = true;
                        waitForRelease = true;
                        return;
                    case 1:  // Scan toggle
                        if (scanning) {
                            scanning = false;
                            if (pBleScan) pBleScan->stop();
                        } else {
                            scanning = true;
                            if (pBleScan) pBleScan->start(5, scanCompleteCallback, false);
                        }
                        waitForRelease = true;
                        drawIconBar();
                        drawStatsLine();
                        return;
                    case 2:  // Filter left
                        currentFilter = (SniffFilter)((currentFilter + FILT_COUNT - 1) % FILT_COUNT);
                        listStartIndex = 0;
                        currentIndex = 0;
                        waitForRelease = true;
                        drawHeader();
                        drawDeviceList();
                        drawStatsLine();
                        drawButtonBar();
                        return;
                    case 3:  // Filter right
                        currentFilter = (SniffFilter)((currentFilter + 1) % FILT_COUNT);
                        listStartIndex = 0;
                        currentIndex = 0;
                        waitForRelease = true;
                        drawHeader();
                        drawDeviceList();
                        drawStatsLine();
                        drawButtonBar();
                        return;
                    case 4:  // Eye/detail
                        if (deviceCount > 0) {
                            showDeviceDetail(currentIndex);
                            waitForRelease = true;
                        }
                        return;
                    case 5:  // BLE pulse (indicator only — no action)
                        return;
                }
            }
        }
        return;
    }

    // ── Device list area (y=74-272): tap to select ───────────────────────
    if (ty >= 74 && ty < 273 && deviceCount > 0) {
        int tappedRow = (ty - 74) / BSNIFF_ITEM_HEIGHT;
        int newIdx = listStartIndex + tappedRow;
        int filtered = countFiltered();
        if (newIdx < filtered) {
            currentIndex = newIdx;
            waitForRelease = true;
            drawDeviceList();
        }
        return;
    }

    // ── Button bar (y=283-318) ───────────────────────────────────────────
    if (ty >= 283) {
        waitForRelease = true;
        if (tx >= 5 && tx < 42) {
            // BACK
            exitRequested = true;
        } else if (tx >= 47 && tx < 82) {
            // INFO
            if (deviceCount > 0) showDeviceDetail(currentIndex);
        } else if (tx >= 87 && tx < 117) {
            // PREV
            if (listStartIndex >= BSNIFF_MAX_VISIBLE) {
                listStartIndex -= BSNIFF_MAX_VISIBLE;
                currentIndex = listStartIndex;
                drawDeviceList();
                drawButtonBar();
            }
        } else if (tx >= 163 && tx < 193) {
            // NEXT
            int filtered = countFiltered();
            if (listStartIndex + BSNIFF_MAX_VISIBLE < filtered) {
                listStartIndex += BSNIFF_MAX_VISIBLE;
                currentIndex = listStartIndex;
                drawDeviceList();
                drawButtonBar();
            }
        } else if (tx >= 198 && tx < 233) {
            // CLR
            deviceCount = 0;
            currentIndex = 0;
            listStartIndex = 0;
            scanStartTime = millis();
            drawHeader();
            drawDeviceList();
            drawStatsLine();
            drawButtonBar();
            #if CYD_DEBUG
            Serial.println("[BSNIFF] Device list cleared");
            #endif
        }
    }
}

// ═══════════════════════════════════════════════════════════════════════════
// SETUP / LOOP / CLEANUP
// ═══════════════════════════════════════════════════════════════════════════

void setup() {
    if (initialized) return;

    #if CYD_DEBUG
    Serial.println("[BSNIFF] Initializing BLE Sniffer...");
    #endif

    // Reset state
    deviceCount = 0;
    currentIndex = 0;
    listStartIndex = 0;
    currentFilter = FILT_ALL;
    exitRequested = false;
    detailView = false;
    waitForRelease = false;
    pendingReady = false;
    scanStartTime = millis();
    lastDisplayUpdate = 0;

    // Draw initial UI
    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();

    // Tear down WiFi before BLE init — frees ~50KB heap
    WiFi.mode(WIFI_OFF);
    delay(50);

    // BLE init
    releaseClassicBtMemory();
    BLEDevice::init("");
    delay(150);  // Race condition fix — BLE controller needs time

    pBleScan = BLEDevice::getScan();
    if (!pBleScan) {
        #if CYD_DEBUG
        Serial.println("[BSNIFF] ERROR: getScan() returned NULL");
        #endif
        exitRequested = true;
        return;
    }

    pBleScan->setActiveScan(false);  // PASSIVE — no SCAN_REQ sent, stealth mode
    pBleScan->setInterval(100);      // Scan timing (wardriving pattern)
    pBleScan->setWindow(99);         // Near-continuous listening
    pBleScan->setAdvertisedDeviceCallbacks(&snifferCB, true);  // wantDuplicates = true

    scanning = true;
    initialized = true;

    drawFullUI();

    // Start continuous non-blocking scan
    pBleScan->start(5, scanCompleteCallback, false);

    #if CYD_DEBUG
    Serial.println("[BSNIFF] Passive scanning started");
    #endif
}

void loop() {
    if (!initialized) return;

