rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
static void wpDrawList() {
    tft.fillRect(0, 78, SCREEN_WIDTH, SCREEN_HEIGHT - 78, HALEHOUND_BLACK);

    // Sub-header bar — dark background like spoofer mode bar
    tft.fillRect(0, 78, SCREEN_WIDTH, 16, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(5, 82);
    tft.print("Fast Pair Targets: ");
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.print(wpCount);
    tft.drawLine(0, 94, SCREEN_WIDTH, 94, HALEHOUND_HOTPINK);

    if (wpCount == 0) {
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(10, 105);
        tft.print("No Fast Pair devices");
        tft.setCursor(10, 120);
        tft.print("found nearby.");
        tft.setTextColor(HALEHOUND_VIOLET);
        tft.setCursor(10, 145);
        tft.print("Ensure targets are powered");
        tft.setCursor(10, 158);
        tft.print("on and within BLE range.");
        tft.setTextColor(HALEHOUND_HOTPINK);
        tft.setCursor(5, SCREEN_HEIGHT - 12);
        tft.print("SEL=Rescan  BACK=Exit");
        return;
    }

    int y = 98;
    for (int i = 0; i < WP_MAX_VISIBLE && i + wpListStart < wpCount; i++) {
        int idx = i + wpListStart;
        FPDevice& d = wpDevs[idx];

        if (idx == wpCurIdx) {
            tft.fillRect(0, y - 2, SCREEN_WIDTH, WP_LINE_HEIGHT, HALEHOUND_DARK);
            tft.setTextColor(HALEHOUND_HOTPINK);
            tft.setCursor(5, y);
            tft.print("> ");
        } else {
            tft.setTextColor(HALEHOUND_MAGENTA);
            tft.setCursor(5, y);
            tft.print("  ");
        }

        tft.setCursor(20, y);
        String nm = String(d.name).substring(0, 14);
        tft.print(nm);

        if (d.result != WPR_NONE) {
            tft.setCursor(SCREEN_WIDTH - 65, y);
            tft.setTextColor(wpResultColor(d.result));
            if (d.result == WPR_VULNERABLE) tft.print("VULN");
            else if (d.result == WPR_EXPOSED) tft.print("EXPD");
            else if (d.result == WPR_NO_CHAR) tft.print("OK");
            else tft.print("--");
        } else {
            tft.setCursor(SCREEN_WIDTH - 50, y);
            tft.setTextColor(HALEHOUND_VIOLET);
            tft.print(d.rssi);
            tft.print("dB");
        }

        y += WP_LINE_HEIGHT;
    }

    tft.drawLine(0, SCREEN_HEIGHT - 18, SCREEN_WIDTH, SCREEN_HEIGHT - 18, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("SEL=Probe UP/DN=Nav L=Scan");
}

static void wpDrawProbeStatus(int line, const char* msg, uint16_t col) {
    int y = 135 + line * 15;
    tft.fillRect(0, y, SCREEN_WIDTH, 14, HALEHOUND_BLACK);
    tft.setTextColor(col);
    tft.setCursor(10, y);
    tft.print(msg);
}

static void wpDrawResult() {
    tft.fillRect(0, 78, SCREEN_WIDTH, SCREEN_HEIGHT - 78, HALEHOUND_BLACK);

    FPDevice& d = wpDevs[wpProbeIdx];

    // Sub-header bar
    tft.fillRect(0, 78, SCREEN_WIDTH, 16, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(5, 82);
    tft.print("PROBE RESULT");
    tft.drawLine(0, 94, SCREEN_WIDTH, 94, HALEHOUND_HOTPINK);

    int y = 100;
    // Labels in electric blue, values in hot pink
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y); tft.print("Name: ");
    tft.setTextColor(HALEHOUND_HOTPINK); tft.print(d.name);
    y += 15;
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y); tft.print("MAC:  ");
    tft.setTextColor(HALEHOUND_HOTPINK); tft.print(d.addrStr);
    y += 15;
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, y); tft.print("RSSI: ");
    tft.setTextColor(HALEHOUND_HOTPINK); tft.print(d.rssi); tft.print(" dBm");
    y += 15;
    tft.setTextColor(HALEHOUND_MAGENTA);
    char modelHex[16];
    snprintf(modelHex, sizeof(modelHex), "0x%06X", d.modelId);
    tft.setCursor(10, y); tft.print("Model: ");
    tft.setTextColor(HALEHOUND_HOTPINK); tft.print(modelHex);
    y += 20;

    // Result banner with rounded border
    tft.drawLine(0, y - 4, SCREEN_WIDTH, y - 4, HALEHOUND_DARK);
    uint16_t rc = wpResultColor(d.result);
    tft.fillRoundRect(8, y, SCREEN_WIDTH - 16, 26, 4, rc);
    tft.drawRoundRect(7, y - 1, SCREEN_WIDTH - 14, 28, 4, HALEHOUND_MAGENTA);
    tft.setTextColor(HALEHOUND_BLACK);
    const char* rs = wpResultStr(d.result);
    int tw = strlen(rs) * 6;
    tft.setCursor((SCREEN_WIDTH - tw) / 2, y + 8);
    tft.print(rs);
    y += 36;

    // Explanation text
    tft.setTextColor(HALEHOUND_MAGENTA);
    switch (d.result) {
        case WPR_VULNERABLE:
            tft.setCursor(10, y);
            tft.print("Device responded to KBP");
            tft.setCursor(10, y + 14);
            tft.print("request outside pair mode");
            tft.setCursor(10, y + 30);
            tft.setTextColor(0xF800);
            tft.print("CVE-2025-36911 CONFIRMED");
            break;
        case WPR_EXPOSED:
            tft.setCursor(10, y);
            tft.print("KBP characteristic found");
            tft.setCursor(10, y + 14);
            tft.print("outside pairing mode.");
            tft.setCursor(10, y + 30);
            tft.setTextColor(0xFFE0);
            tft.print("Potentially vulnerable");
            break;
        case WPR_NO_CHAR:
            tft.setCursor(10, y);
            tft.print("FP service present but");
            tft.setCursor(10, y + 14);
            tft.print("KBP char not exposed.");
            tft.setCursor(10, y + 30);
            tft.setTextColor(0x07E0);
            tft.print("Appears patched");
            break;
        case WPR_NO_SERVICE:
            tft.setCursor(10, y);
            tft.print("Fast Pair GATT service");
            tft.setCursor(10, y + 14);
            tft.print("not accessible via GATT");
            break;
        case WPR_UNREACHABLE:
            tft.setCursor(10, y);
            tft.print("GATT connection failed.");
            tft.setCursor(10, y + 14);
            tft.print("Target may be out of range");
            break;
    }

    // Bottom bar with ATTACK button for vulnerable devices
    tft.drawLine(0, SCREEN_HEIGHT - 38, SCREEN_WIDTH, SCREEN_HEIGHT - 38, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(5, SCREEN_HEIGHT - 12);
    tft.print("BACK");

    if (d.result == WPR_EXPOSED || d.result == WPR_VULNERABLE) {
        tft.fillRoundRect(140, SCREEN_HEIGHT - 34, 92, 26, 4, 0xF800);
        tft.drawRoundRect(139, SCREEN_HEIGHT - 35, 94, 28, 4, HALEHOUND_MAGENTA);
        tft.drawBitmap(146, SCREEN_HEIGHT - 29, bitmap_icon_sword, 16, 16, HALEHOUND_BLACK);
        tft.setTextColor(HALEHOUND_BLACK);
        tft.setCursor(166, SCREEN_HEIGHT - 25);
        tft.print("ATTACK");
    }
}

