rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
// ─── Attack Report Display ──────────────────────────────────────────────
static void wpDrawAttackReport() {
    if (wpProbeIdx < 0) return;
    FPDevice& d = wpDevs[wpProbeIdx];

    tft.fillRect(0, 78, SCREEN_WIDTH, SCREEN_HEIGHT - 78, HALEHOUND_BLACK);

    if (atkResultPage == 0) {
        // ─── Page 1: Summary ─────────────────────────────────────────
        tft.fillRect(0, 78, SCREEN_WIDTH, 16, HALEHOUND_DARK);
        tft.setTextColor(0xF800);
        tft.setCursor(5, 82);
        tft.print("ATTACK REPORT");
        tft.setTextColor(HALEHOUND_GUNMETAL);
        tft.setCursor(SCREEN_WIDTH - 24, 82);
        tft.print("1/2");
        tft.drawLine(0, 94, SCREEN_WIDTH, 94, 0xF800);

        int y = 100;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y); tft.print("Target: ");
        tft.setTextColor(HALEHOUND_HOTPINK); tft.print(d.name);
        y += 12;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y); tft.print("BLE: ");
        tft.setTextColor(HALEHOUND_HOTPINK); tft.print(d.addrStr);
        y += 16;

        // BR/EDR address — prominent
        if (wpAtkResult.hasBrEdr) {
            tft.fillRoundRect(5, y, SCREEN_WIDTH - 10, 28, 3, HALEHOUND_DARK);
            tft.drawRoundRect(4, y - 1, SCREEN_WIDTH - 8, 30, 3, 0xF800);
            tft.setTextColor(0xF800);
            tft.setCursor(10, y + 3);
            tft.print("BR/EDR:");
            char brStr[20];
            snprintf(brStr, sizeof(brStr), "%02X:%02X:%02X:%02X:%02X:%02X",
                     wpAtkResult.brEdrAddr[0], wpAtkResult.brEdrAddr[1],
                     wpAtkResult.brEdrAddr[2], wpAtkResult.brEdrAddr[3],
                     wpAtkResult.brEdrAddr[4], wpAtkResult.brEdrAddr[5]);
            tft.setCursor(10, y + 15);
            tft.setTextColor(HALEHOUND_HOTPINK);
            tft.print(brStr);
            y += 34;
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL);
            tft.setCursor(5, y);
            tft.print("BR/EDR: Not extracted");
            y += 14;
        }

        y += 2;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("Phase 1: KBP Exploit");
        y += 12;

        for (int s = 0; s < 4; s++) {
            tft.setCursor(10, y);
            tft.setTextColor(HALEHOUND_VIOLET);
            tft.print(wpStrategies[s].name);
            tft.setCursor(130, y);
            if (wpAtkResult.strategyResults[s] == 2) {
                tft.setTextColor(0x07E0);
                tft.print("HIT");
            } else if (wpAtkResult.strategyResults[s] == 1) {
                tft.setTextColor(HALEHOUND_GUNMETAL);
                tft.print("---");
            } else {
                tft.setTextColor(HALEHOUND_GUNMETAL);
                tft.print("N/A");
            }
            y += 11;
        }

        y += 4;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("Phase 2: ");
        if (wpAtkResult.acctKeyWritten) {
            tft.setTextColor(0x07E0);
            tft.print("Key INJECTED");
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL);
            tft.print("Key not written");
        }
        y += 14;

        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("Phase 3: ");
        int intelCount = 0;
        if (wpAtkResult.hasPasskey) intelCount++;
        if (wpAtkResult.hasAdditional) intelCount++;
        if (wpAtkResult.hasModelId) intelCount++;
        if (wpAtkResult.hasFirmware) intelCount++;
        char intelStr[16];
        snprintf(intelStr, sizeof(intelStr), "%d chars found", intelCount);
        tft.setTextColor(intelCount > 0 ? 0x07E0 : HALEHOUND_GUNMETAL);
        tft.print(intelStr);

    } else {
        // ─── Page 2: Raw Data ────────────────────────────────────────
        tft.fillRect(0, 78, SCREEN_WIDTH, 16, HALEHOUND_DARK);
        tft.setTextColor(0xF800);
        tft.setCursor(5, 82);
        tft.print("RAW INTEL");
        tft.setTextColor(HALEHOUND_GUNMETAL);
        tft.setCursor(SCREEN_WIDTH - 24, 82);
        tft.print("2/2");
        tft.drawLine(0, 94, SCREEN_WIDTH, 94, 0xF800);

        int y = 100;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("KBP Response:");
        y += 12;

        if (wpAtkResult.kbpRespLen > 0) {
            char hexLine[42];
            for (int row = 0; row < 2; row++) {
                int pos = 0;
                for (int i = row * 8; i < (row + 1) * 8 && (size_t)i < wpAtkResult.kbpRespLen; i++) {
                    pos += snprintf(hexLine + pos, sizeof(hexLine) - pos,
                                    "%02X ", wpAtkResult.kbpResp[i]);
                }
                if (pos > 0) {
                    hexLine[pos] = '\0';
                    tft.setTextColor(HALEHOUND_HOTPINK);
                    tft.setCursor(10, y);
                    tft.print(hexLine);
                    y += 11;
                }
            }
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL);
            tft.setCursor(10, y);
            tft.print("No response captured");
            y += 11;
        }

        y += 6;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("Account Key:");
        y += 12;

        if (wpAtkResult.acctKeyWritten) {
            tft.drawBitmap(SCREEN_WIDTH - 22, y - 10, bitmap_icon_key, 16, 16, 0x07E0);
            char hexLine[42];
            for (int row = 0; row < 2; row++) {
                int pos = 0;
                for (int i = row * 8; i < (row + 1) * 8; i++) {
                    pos += snprintf(hexLine + pos, sizeof(hexLine) - pos,
                                    "%02X ", wpAtkResult.acctKey[i]);
                }
                hexLine[pos] = '\0';
                tft.setTextColor(HALEHOUND_HOTPINK);
                tft.setCursor(10, y);
                tft.print(hexLine);
                y += 11;
            }
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL);
            tft.setCursor(10, y);
            tft.print("Not written");
            y += 11;
        }

