rgomez31UAQ/ESP32-DIV_CYD-Gadget/bluetooth_attacks.cpp
    wpDoScan();

    #if CYD_DEBUG
    Serial.printf("[WP] Init complete — %d FP devices found\n", wpCount);
    #endif
}

void loop() {
    if (!wpInit) return;

    touchButtonsUpdate();

    // Icon bar touch handling
    static unsigned long lastTap = 0;
    if (millis() - lastTap > 200) {
        uint16_t tx, ty;
        if (getTouchPoint(&tx, &ty)) {
            if (ty >= 20 && ty <= 36) {
                if (tx >= 10 && tx < 26) {
                    // Back icon
                    if (inAttackResult) {
                        inAttackResult = false;
                        inResult = true;
                        tft.fillScreen(HALEHOUND_BLACK);
                        drawStatusBar();
                        wpDrawHeader();
                        wpDrawResult();
                    } else if (inResult) {
                        inResult = false;
                        tft.fillScreen(HALEHOUND_BLACK);
                        drawStatusBar();
                        wpDrawHeader();
                        wpDrawList();
                    } else {
                        wpExit = true;
                    }
                    lastTap = millis();
                    return;
                }
                else if (tx >= 210 && tx < 226) {
                    // Rescan icon
                    if (!inResult && !inAttackResult) {
                        wpDoScan();
                    }
                    lastTap = millis();
                    return;
                }
            }
        }
    }

    // Button handling
    if (buttonPressed(BTN_BACK) || buttonPressed(BTN_BOOT)) {
        if (inAttackResult) {
            inAttackResult = false;
            inResult = true;
            tft.fillScreen(HALEHOUND_BLACK);
            drawStatusBar();
            wpDrawHeader();
            wpDrawResult();
        } else if (inResult) {
            inResult = false;
            tft.fillScreen(HALEHOUND_BLACK);
            drawStatusBar();
            wpDrawHeader();
            wpDrawList();
        } else {
            wpExit = true;
        }
        return;
    }

    if (!inResult) {
        // Device list navigation
        if (buttonPressed(BTN_UP)) {
            if (wpCurIdx > 0) {
                wpCurIdx--;
                if (wpCurIdx < wpListStart) wpListStart--;
                wpDrawList();
            }
        }

        if (buttonPressed(BTN_DOWN)) {
            if (wpCurIdx < wpCount - 1) {
                wpCurIdx++;
                if (wpCurIdx >= wpListStart + WP_MAX_VISIBLE) wpListStart++;
                wpDrawList();
            }
        }

        if (buttonPressed(BTN_SELECT) || buttonPressed(BTN_RIGHT)) {
            if (wpCount > 0) {
                wpProbeDevice(wpCurIdx);
            } else {
                wpDoScan();
            }
        }

        if (buttonPressed(BTN_LEFT)) {
            wpDoScan();
        }

        // Touch to select device — list items draw at y=98 with WP_LINE_HEIGHT spacing
        int visCount = wpCount - wpListStart;
        if (visCount > WP_MAX_VISIBLE) visCount = WP_MAX_VISIBLE;
        int touched = getTouchedMenuItem(98, WP_LINE_HEIGHT, visCount);
        if (touched >= 0) {
            wpCurIdx = wpListStart + touched;
            wpDrawList();          // highlight before probe
            wpProbeDevice(wpCurIdx);
        }

        // Touch bottom bar area to rescan (no BTN_LEFT touch zone on CYD)
        {
            uint16_t bx, by;
            if (getTouchPoint(&bx, &by) && by >= SCREEN_HEIGHT - 18) {
                wpDoScan();
            }
        }
    } else if (inAttackResult) {
        // Attack report — page navigation + save
        if (buttonPressed(BTN_RIGHT) || buttonPressed(BTN_DOWN)) {
            if (atkResultPage < 1) { atkResultPage++; wpDrawAttackReport(); }
        }
        if (buttonPressed(BTN_LEFT) || buttonPressed(BTN_UP)) {
            if (atkResultPage > 0) { atkResultPage--; wpDrawAttackReport(); }
        }
        if (buttonPressed(BTN_SELECT)) {
            wpSaveLoot();
        }

        // Touch: SAVE (left) or page nav (right)
        uint16_t rtx, rty;
        if (getTouchPoint(&rtx, &rty) && rty >= SCREEN_HEIGHT - 38) {
            if (rtx < 80) {
                wpSaveLoot();
                waitForTouchRelease();
            } else if (rtx > SCREEN_WIDTH - 70) {
                atkResultPage = (atkResultPage == 0) ? 1 : 0;
                waitForTouchRelease();
                wpDrawAttackReport();
            }
        }
    } else {
        // Result view — LEFT returns to list
        if (buttonPressed(BTN_LEFT)) {
            inResult = false;
            tft.fillScreen(HALEHOUND_BLACK);
            drawStatusBar();
            wpDrawHeader();
            wpDrawList();
        }

        // ATTACK button for vulnerable devices
        if (wpProbeIdx >= 0 && wpProbeIdx < wpCount) {
            FPDevice& rd = wpDevs[wpProbeIdx];
            if (rd.result == WPR_EXPOSED || rd.result == WPR_VULNERABLE) {
                if (buttonPressed(BTN_SELECT) || buttonPressed(BTN_RIGHT)) {
                    wpRunAttack();
                    return;
                }
                uint16_t atx, aty;
                if (getTouchPoint(&atx, &aty)) {
                    if (atx >= 140 && atx <= 232 && aty >= SCREEN_HEIGHT - 35 && aty <= SCREEN_HEIGHT - 7) {
                        waitForTouchRelease();
                        wpRunAttack();
                        return;
                    }
                }
            }
        }
    }
}

bool isExitRequested() { return wpExit; }

void cleanup() {
    if (pWpClient) {
        pWpClient->disconnect();
        pWpClient = nullptr;  // deinit cleans up tracked clients
    }
    if (pWpScan) pWpScan->stop();
    BLEDevice::deinit(false);
    wpInit = false;
    wpExit = false;
    inResult = false;
    inAttack = false;
    inAttackResult = false;
    wpAtkLogCount = 0;
    wpCount = 0;
    wpProbeIdx = -1;

    #if CYD_DEBUG
    Serial.println("[WP] Cleanup complete");
    #endif
}

}  // namespace WhisperPair
